{
    "table_name": "brf_sum_text",
    "table_fullname": "spider2-public-data.patentsview.brf_sum_text",
    "column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "yvfou5645b1fsbpck2g41lbj4",
            "patent_id": "4573069",
            "text": "The present invention relates generally to video signal processing apparatus and particularly to fine gain control apparatus in the automatic chrominance control circuitry of a digital color television receiver. In color television receivers, automatic chrominance control (ACC) circuitry responds to the color reference burst component of the chrominance component of a composite video signal to ensure that the amplitude of chrominance signal component remains within standardized minimum and maximum values. A standardized chrominance signal is desirable to keep the intensity of the displayed image relatively invariant for both weak and strong signals. Only when the signal is so weak as to make satisfactory color portrayal unlikely is the chrominance component allowed to vary substantially from the standard. Under these conditions its amplitude is forced to zero by the color killer circuitry of the receiver. In addition to standardizing the incoming video signals, the ACC circuitry amplifies or attenuates the chrominance signals according to the settings of viewer color controls such as the saturation (SAT) and picture (PIX) controls of, for example, the RCA Colortrak (TM) system. The peak amplitude values of the chrominance signal are also monitored by the ACC circuitry, and the chrominance signal gain is adjusted, responsive to these values, to avoid displaying oversaturated colors. In the ACC system of an analog receiver, the multiple gain control circuits that implement these functions are realized with relative simplicity by analog amplifiers. A parallel implementation in a digital receiver would have each analog amplifier replaced by a digital multiplier. The size and complexity of digital multiplier circuits, however, makes this parallel implementation impractical. Two designs for ACC apparatus in a digital television receivers that utilize simplified digital multipliers are set forth in U.S. Pat. No. 4,447,826 \"\"DIGITAL TELEVISION RECEIVER AUTOMATIC CHROMA CONTROL SYSTEM\"\" (Lewis, Jr. et al.) and Ser. No. 537,814 \"\"AUTOMATIC CHROMINANCE CONTROL FOR A DIGITAL TELEVISION RECEIVER\"\" (Lewis, Jr.). Both of these applications describe ACC apparatus using controllable shift registers for coarse gain control and some other means for fine gain control. In the first application (Lewis, Jr. et al.) a digital multiplier that includes an adder and a random access memory controlled by a microprocessor provides fine gain adjustment up to a total of 6 dB. In the latter application (Lewis, Jr.) an analog IF tilt circuit provides fine gain control instead of a multiplier. An ACC apparatus using a fine gain control apparatus that does not require even a simplified multiplier and does not impose frequency domain distortion on the incoming signal would be advantageous. Accordingly, the present invention is an improved apparatus for providing fine gain control in a digital video signal processor. The apparatus includes a digital-to-analog (D/A) converter that produces a pulse amplitude modulated output signal. The D/A converter is resettable via a reset input; its output signal being forced to a predetermined value (e.g. ground potential) when a certain logic level (e.g. a low logic level) is applied to the reset input. The average amplitude value of the output signal of the D/A converter over one sample period, and thus the gain of the circuit, can be controlled by applying variable width pulses to the reset input of the D/A converter. To this end, the output of a pulse generator--responsive to a control signal for providing variable width pulses--is coupled to the reset input of the D/A converter. The range of pulse widths provided are between one sample period and one-half sample period, providing fine gain control between 0 dB and -6 dB."
        },
        {
            "uuid": "fae7z98z9ultzncf9hl1hwyvf",
            "patent_id": "10106960",
            "text": "This disclosure relates generally to ground engaging tools, and more particularly, to a lock assembly for removably attaching ground engaging tools. BACKGROUND Earth-working machines, such as, for example, excavators, wheel loaders, hydraulic mining shovels, cable shovels, bucket wheels, bulldozers, and draglines, are generally used for digging or ripping into the earth or rock and/or moving loosened work material from one place to another at a worksite. These earth-working machines include various earth-working implements, such as a bucket or a blade, for excavating or moving the work material. These implements can be subjected to extreme wear from the abrasion and impacts experienced during the earth-working applications. To protect these implements against wear, and thereby prolong the useful life of the implements, various ground engaging tools, such as teeth, edge protectors, and other wear members, can be provided to the earth-working implements in the areas where the most damaging abrasions and impacts occur. These ground engaging tools are removably attached to the implements using lock assemblies, so that worn or damaged ground engaging tools can be readily removed and replaced with new ground engaging tools. U.S. Pat. No. 7,178,274 to Emrich is directed to a coupling arrangement for securing two separable components in an excavating operation. The coupling arrangement includes a wear component, a base component and a lock. The lock has a body having a configuration adapted to be received in a hole in the base component, and a rotatable locking member. The locking member includes a flange that is movable between a locking position wherein the flange holds the lock in the assembly and a release position wherein the flange permits the lock to be removed from the assembly. In the release position, the flange sets within the axial extension of the outline of the body. In the locking position, at least part of the flange sets outside the axial extension of the outline of the body. In one construction, the rotation of the locking member to the locking position tightens the fit of the wear component on the base component. The present disclosure is directed toward overcoming one or more of the problems discovered by the inventors or that is known in the art. SUMMARY OF THE DISCLOSURE In one embodiment, a lock assembly for securing a wear member to an implement is provided. The lock assembly includes a compressible base. The compressible base includes a front face and a back face opposite the front face. The front face and the back face may each have a noncircular shape. The lock assembly includes a rigid latch member extending from the front face of the compressible base. The latch member includes a ramp extending away from the front face. The ramp may have a low end and an elevated end, the elevated end extending further away from the front face than the low end. The latch member includes a ramp surface extending between the low end and the elevated end. The latch member includes a tool engaging feature extending into the ramp. In another embodiment, an implement and lock assembly is provided. The implement and lock assembly includes an implement. The implement includes an aperture extending through a tapered end of the implement. The lock assembly includes a compressible base. The compressible base includes a front face and a back face opposite the front face. The front face and the back face may each have a noncircular shape. The lock assembly includes a rigid latch member extending from the front face of the compressible base. The latch member includes a ramp extending away from the front face. The ramp may have a low end and an elevated end, the elevated end extending further away from the front face than the low end. The latch member includes a ramp surface extending between the low end and the elevated end. The latch member includes a tool engaging feature extending into the ramp. The shape of the aperture may match the shape of the compressible base. In yet another embodiment, a lock assembly for securing a wear member to an implement is provided. The implement may have an aperture extending through a tapered end. The wear member may have a lock aperture concentric to the aperture of the implement. The lock assembly includes a compressible base insertable into the aperture of the implement. The compressible base may be in the shape of a right prism having rounded corner edges. The rounded corner edges may be configured to resist rotation of the compressible base within the aperture. The lock assembly includes a latch member extending from the compressible base. The latch member includes a ramp extending away from the compressible base and configured to align with the lock aperture. The ramp may have a low end and an elevated end. The elevated end may extend further away from the base than the low end. The elevated end may be configured to brace against the lock aperture. The latch member includes a ramp surface extending between the low end and the elevated end. The latch member includes a tool engaging feature extending into the ramp."
        },
        {
            "uuid": "8fwlafsc3y6v98rzdjtloclxm",
            "patent_id": "5058919",
            "text": "The present invention relates to an air bag module comprising a pair of subassemblies which are coupled together to form the module. One subassembly, referred to as an air bag/cover subassembly, comprises a cover having an air bag, a folded air bag within the cavity, and a retainer coupled directly to the cover to maintain the folded air bag within the cavity. The other subassembly, known as an inflator/reaction device subassembly, comprises an inflator and a reaction device. The reaction device includes integrally formed structure for directly engaging the inflator and for coupling the inflator to the reaction device. The subassemblies are separately formed, and then connected together to complete the air bag module. A vehicle air bag module is a complete air bag unit which is assembled apart from the vehicle and then coupled as a unit with the vehicle. Typically, an air bag module includes (i) a reaction device, (ii) a folded air bag connected to the reaction device, (iii) an inflator, or gas generator, connected to the reaction device, and (iv) a cover connected to the reaction device to complete an enclosure for the folded air bag. The module is generally coupled with a structural part of the vehicle via the reaction device, and the cover may form a part of the vehicle interior which faces the passenger compartment. In the case of a passenger side air bag module, for example, the reaction device will usually be coupled with the support structure for the dashboard of the vehicle, and the cover of the module may form a part of the dashboard of the vehicle. Alternatively, in the case of a driver side air bag module, the reaction device may usually be coupled with the steering wheel support structure, and the cover of the module may form a part of the steering wheel cover. When coupled with a vehicle, an air bag module operates to deploy an air bag at the onset of a vehicle collision. Specifically, at the onset of a collision, a chemical mixture in the inflator that forms part of the module is ignited to generate large quantities of gas under relatively high pressure. The cover is designed so that when such gas is generated in the module, portions of the cover can separate to create a deployment opening for the air bag. The gas simultaneously (i) forces the air bag through the deployment opening in the cover and (ii) inflates the air bag. As the air bag is being discharged and inflated, relatively high forces are applied to the various components of the air bag module. The reaction device will usually transmit such forces to the vehicle structure to stabilize the air bag module during deployment of the air bag. Over the years, various techniques for forming air bag modules have been suggested. One well known technique comprises initially securing an air bag and an inflator with a reaction device, folding the air bag into a predetermined pattern relative to the inflator and the reaction device, and then attaching a cover to the reaction device. The reaction device is adapted to be coupled with a structural part of the vehicle, to couple the module with the vehicle. One example of such a technique is shown in U.S. Pat. No. 4,148,503, wherein an air bag module comprises an inflator and an air bag which are each bolted to a reaction device. The air bag is arranged to surround the inflator and is then received in a folded condition within a receiving case or cover. Another example of such a technique is shown in U.S. Pat. No. 4,842,300, wherein an air bag module comprises an inflator and an air bag which are each bolted to a reaction device. The air bag is folded into a predetermined pattern within the reaction device relative to the inflator, and a cover is then attached to the reaction device to complete the module. Another known technique for forming an air bag module is initially to form a subassembly comprising a reaction device, a folded air bag and a cover, and to secure an inflator to the subassembly to complete the module. The subassembly is formed by folding the air bag into a predetermined configuration, and securing and closing the air bag within a covered reaction device to complete the subassembly. The inflator is then bolted to the subassembly to complete the air bag module. This technique minimizes the handling of inflators in assembling the module. Also, it enables inflators to be transported separately from the subassembly. Thus, if the chemical mixture in the inflators is accidentally ignited during transport, the subassemblies of the modules are not destroyed. An example of such a technique is shown in U.S. Pat. No. 4,153,273. Still another known technique for forming an air bag module is disclosed in U.S. Pat. No. 4,915,410. A reaction device is initially coupled to a folded air bag and to a cover (preferably by means of bolts) to form a subassembly. An inflator is later secured to the subassembly, preferably by means of resilient bands which couple the inflator to the reaction device. By initially forming a subassembly without an inflator and later coupling the inflator to the subassembly, the handling of live inflators is minimized. In the air bag industry, new and useful techniques for forming air bag modules are becoming increasingly important. Air bag modules are currently being installed in large numbers of automobiles. The number of air bag modules installed in the future will continue to increase, as consumer demand and federal regulatory requirements for vehicle safety also continue to increase. To enable auto makers to meet this growing demand, there is a continuing need for simple and effective techniques which lend themselves to the mass production of air bag modules. Moreover, applicants believe there is a continuing need for air bag module structures and assembly techniques which (i) minimize the components required to construct the modules, (ii) reduce the weight of individual module components, (iii) reduce the costs and simplify the techniques for manufacturing such individual components, and (iv) simplify the techniques for assembling the modules. Additionally, it is important to allow inflators to be manufactured and transported separately from the remaining components of the modules, and incorporated into the modules as the last step in the assembly process. This minimizes the risk of damage to the remaining components of the modules, due to accidental ignition of an inflator. Also, applicants believe there is a need for a lightweight module construction in which certain components of the module can be standardized for a number of vehicle makes and styles, and other components can be adapted for specific vehicle applications and environments. For example, in a passenger side air bag system, the cover of the module typically forms a part of the vehicle dashboard. Thus, the cover must be designed with an external configuration which matches the profile of the vehicle make and style. However, if other parts of a passenger side module are standardized to be used with covers of different external configurations, the manufacture of passenger side modules for vehicles of different makes and styles becomes more efficient. The present invention provides a new and useful air bag module structure and new and useful techniques for forming an air bag module. The invention provides an air bag/cover subassembly and an inflator/reaction device subassembly which are coupled together to form an air bag module. The subassemblies are separately assembled, and can be separately transported, to minimize the handling of inflators as compared to an assembly process in which inflators may be one of the first components of an air bag module to be incorporated into the module. The components which form the subassemblies are designed to be relatively simple and efficient to manufacture and assemble. Additionally, the subassemblies are designed with a number of components which can be standardized for use in forming modules for vehicles of different makes and styles. Further, the subassemblies are formed using relatively few components, and with integral coupling structure to eliminate the use of additional fasteners. The subassemblies are particularly designed with a view toward the mass production of air bag modules. The air bag/cover subassembly of the present invention comprises a cover with an air bag cavity, a prefolded air bag disposed in the air bag cavity, and a retainer coupled directly to the cover and adapted to maintain the air bag in the cavity. The cover has an access opening for receiving the folded air bag, and side flanges to enable mounting of the module to the vehicle. Moreover, the cover has portions adapted to separate when gas under pressure is applied to the air bag, to create a deployment opening for the air bag. The prefolded air bag has a gas inlet opening with a relatively rigid border rim. The cover has integrally formed internal recess structure adapted to receive the relatively rigid border rim of the air bag to locate the air bag properly within the cavity and to retain the gas inlet opening of the air bag attached to the cover as the air bag is being deployed. The cover has additional integrally formed internal recess structure adapted to engage the retainer directly to couple the retainer to the cover. The inflator/reaction device subassembly of the invention comprises an inflator which is adapted to contain a gas generating device, and a reaction device which has integrally formed structure adapted to engage the inflator directly and to couple the inflator with the reaction device. Specifically, the reaction device has an integrally formed, resiliently deflectable portion which deflects to enable the inflator to be properly oriented relative to the reaction device, and which then returns to a predetermined position, to retain the inflator coupled with the reaction device. Each of the cover and reaction device is preferably formed of an injection moldable plastic. The plastic which forms the reaction device is particularly characterized by its resistance to the relatively high temperatures generated by the inflator during its operation. The plastic which forms the cover is particularly characterized by (i) its ability to separate, under pressure, to form the deployment opening, (ii) its relative flexibility, and (iii) its impact resistance properties. Each of the cover and the reaction device has integrally formed coupling structure which enables those members to be directly coupled to each other, without the need for bolts or other types of fasteners. Thus, the subassemblies can be coupled together to form the module by coupling the reaction device to the cover. Also, the air bag/cover subassembly can be formed and transported separately from the inflator/reaction device subassembly, and the subassemblies coupled together as the last step in the formation of the module. Moreover, the components for forming either subassembly can be separately transported and then assembled to form the subassembly at the time the module is being assembled. Thus, the handling and transportation of live inflators is minimized. Applicants believe the air bag module, and the techniques used to form the module components and subassemblies, are particularly suited for efficient and effective mass production of air bag modules. Still further, the subassemblies are designed such that most of their components can be standardized for use in forming modules for vehicles of various makes and styles. This provides significant opportunity for increased efficiency and simplification of the techniques for manufacturing and assembling modules for vehicles of different makes and styles. The various components of the module, and the materials they are formed of, are also designed to minimize module weight, which is a continuing objective in the automobile industry. Further features and advantages of the present invention will become further apparent from the following detailed description and the accompanying drawings."
        },
        {
            "uuid": "yatk7s2wfghai7gf95x7rvl62",
            "patent_id": "4474114",
            "text": "For certain transport requirements a type of intermittently-operating conveyor is available in which a feed device with reciprocating motion feeds forward supporting devices for goods of one type or other. This type of conveyor device has advantages in comparison with the other type of conveyor generally employed which has a continuously-moving drive element and is particularly suitable on the one hand where the path along which the material is to be transported is extremely long and can at the same time be provided with a certain slope, at least over significant distances, and secondly where extensively branched paths with many side lines are involved. In the first case the reciprocating drive devices can be employed on restricted distances where ascending gradients are involved or where the speed needs to be regulated while along the remaining sections the material supporting devices can move by means of gravity. In the latter case it may be difficult to arrange for continuously moving drive elements, because the drive of such elements can become particularly complicated in the event of several side paths. At the same time complicated transfer arrangements are often required at the branching points for the material. Hence conveyors of the said type are advantageous and are difficult to replace by other types for certain applications. However they do generally have disadvantages. The reciprocating drive devices have to be connected to special drive means which have to be arranged along the path at the requisite locations. These drive means are often complicated and bulky and take the form of special units adjacent to the conveyor track which require special stands and fixing devices. In the invention the track consists of a girder with the shape of a hollow profile having a groove which in the lengthwise direction of the track firstly has one or more portions with completely closed cross-section and secondly one or more sections provided with a side aperture, whereby in the closed portion or portions plugs are inserted, between which one or more cylindrical spaces are formed, each arranged so as to enclose a piston with piston rod. The latter extends outside the cylindrical space. In the open portions, extending lengthwise along the groove, extended preferably flexible members are arranged which are joined to the piston rods, provided with the said driver members which are accessible through the said side apertures. On the outside of the girder a track is arranged for material carriers adjacent to the said side aperture, so that the driver members can make contact with the material carriers through the aperture. The cylindrical chamber is connected to pipelines for a pressure medium, so that the piston or pistons can be displaced back and forth as a result of the pressure medium being introduced on different sides of the piston. The members are driven by the piston rod so that the driver devices move the material carriers in the intended transport direction. The object of the present invention is, in the case of conveyors of the said type with reciprocating drive device, to bring about drive arrangements in the path of the material supporting devices which facilitates a simpler and less bulky design and greater ease of erection. Another object of the invention is to bring about a drive device of the specified type which is extremely versatile, in use not only for the propulsion of material supporting devices, but also for other functions."
        },
        {
            "uuid": "k2td5cytwn8hkw60wn21lporz",
            "patent_id": "6817270",
            "text": "BACKGROUND OF THE INVENTION The present invention relates generally to a nut wrench called a drumbar and, more particularly, to a nut wrench used for removing and replacing nuts and bolts to remove and replace the brake drums in the wheels of trailers, trucks, buses and all other vehicles that utilize spoke wheels, including but not limited to Dayton Wheels(tm) manufactured by the Dayton Wheel Products Company. Dayton Wheel Products Company is located at 115 Compark Road Dayton, Ohio 45459 The process of removing and replacing brake drums requires the mechanic to remove nuts and bolts from the wheel to remove and replace the brake drums. The mechanic holds the bolt located on the backside of the wheel to prevent the bolt from rotating while rotating the nut located on the frontside of the wheel on or off the bolt. One way to accomplish this task is to have the mechanic use extensions and bars to reach the bolts on the backside of the wheel while rotating the nuts on the frontside. This process requires the mechanic to straddle the wheel with his arms and to control two tools at one time, which can be very cumbersome and awkward, and requires a high degree of skill. Alternatively, two mechanics can assist each other in the process of removing and replacing the brake drums. One mechanic positions himself/herself behind the wheel assembly of the vehicle to hold the bolts located on the backside of the wheel to prevent the bolts from rotating while the second mechanic removes or replaces the nuts on the bolts from the frontside of the wheel. This process requires two mechanics which is labor intensive and costly. In a third method for removing and replacing the nuts and bolts that secure the brake drums to the wheel one mechanic reaches through the axle housing to hold the bolt located on the backside of the wheel to prevent the bolt from rotating while removing or replacing the nuts on the bolts from the frontside of the wheel. This process is labor intensive, costly and can only be performed with a mechanic that has an extremity, which is small enough to fit through the axle housing of the wheel. The present invention is directed to overcoming one or more of the problems set forth above. SUMMARY OF THE INVENTION An aspect of the invention is to provide a drumbar apparatus and method for assisting mechanics in removing and replacing nuts and bolts from a wheel of trailers, trucks, buses and all other devices that utilize Dayton Wheels(tm) or spoke wheels in such a manner that the necessary assembly and disassembly costs and labor times are reduced with improved assembly and disassembly techniques and excellent performance. In one aspect of this invention there is provided a drumbar apparatus for allowing one mechanic to position himself/herself on the frontside of a wheel and wherein said mechanic extends said drumbar through the axle housing to hold a bolt with said drumbar on the backside of the wheel to prevent the bolt from rotating while the mechanic removes or replaces the nut of the frontside of the wheel. In another aspect of this invention there is provided a method in which one mechanic positioned in front of a wheel extends a drumbar through the axle housing and holds the bolt of a wheel located on the backside of the wheel with the drumbar to prevent the bolt from rotating while removing or replacing the nut on the frontside of the wheel. With respect to the two mechanic process previously described, this invention reduces the number of mechanics needed for removing or replacing the nuts and bolts on a wheel to remove and replace the brake drums, hence, the labor costs are substantially lowered as a result of the drumbar. With respect to the one mechanic process previously described, the labor time and required skill level of the mechanic for removing and replacing the nuts and bolts to remove and replace the brake drums are reduced, hence, the labor costs are substantially lowered and the required skill level of the mechanic is reduced as a result of the drumbar."
        }
    ]
}