{
    "table_name": "government_interest",
    "table_fullname": "spider2-public-data.patentsview.government_interest",
    "column_names": [
        "patent_id",
        "gi_statement"
    ],
    "column_types": [
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "patent_id",
        "gi_statement"
    ],
    "nested_column_types": [
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null
    ],
    "sample_rows": [
        {
            "patent_id": "6467284",
            "gi_statement": "&lsqb;Federal Research Statement Paragraph&rsqb;This invention was made with Government support under contract no. DE-AC05-00OR22725 to UT-Battelle, LLC, awarded by the United States Department of Energy. The Government has certain rights in the invention."
        },
        {
            "patent_id": "10593821",
            "gi_statement": "ACKNOWLEDGEMENT OF GOVERNMENT SUPPORT This invention was made with Government support under Grant no. IIP-1134849, Grant no. 1357419, and Grant no. DGE1110007, awarded by the National Science Foundation. The Government has certain rights in this invention."
        },
        {
            "patent_id": "9133203",
            "gi_statement": "ACKNOWLEDGEMENT OF GOVERNMENT SUPPORT This invention was made with support of the United States government under the terms of Grant Number RO1GM087305, awarded by the National Institutes of Health. The United States government has rights to this invention."
        },
        {
            "patent_id": "8377831",
            "gi_statement": "ACKNOWLEDGEMENTS This invention was made with government support under funding by the Department of Energy Basic Energy Sciences (DE-FG02-01ER15255) and the National Science Foundation (CTS-0207781). The government may have certain rights in the invention."
        },
        {
            "patent_id": "8741564",
            "gi_statement": "ACKNOWLEDGMENT OF GOVERNMENT SUPPORT This invention was made with government support under Grant No. 5R43HG005949-02 awarded by The National Institutes of Health, National Human Genome Research Institute. The government has certain rights in the invention."
        }
    ]
}