{
    "table_name": "patent",
    "table_fullname": "spider2-public-data.patentsview.patent",
    "column_names": [
        "id",
        "type",
        "number",
        "country",
        "date",
        "abstract",
        "title",
        "kind",
        "num_claims",
        "filename",
        "withdrawn"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "INT64"
    ],
    "nested_column_names": [
        "id",
        "type",
        "number",
        "country",
        "date",
        "abstract",
        "title",
        "kind",
        "num_claims",
        "filename",
        "withdrawn"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "INT64"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "id": "10344281",
            "type": "utility",
            "number": "10344281",
            "country": "US",
            "date": "2019-07-09",
            "abstract": "Functionally-modified oligonucleotide analogues comprising modified intersubunit linkages and/or modified 3′ and/or 5′-end groups are provided. The disclosed compounds are useful for the treatment of diseases where inhibition of protein expression or correction of aberrant mRNA splice products produces beneficial therapeutic effects.",
            "title": "Functionally-modified oligonucleotides and subunits thereof",
            "kind": "B2",
            "num_claims": 16,
            "filename": "ipg190709.xml",
            "withdrawn": 0
        },
        {
            "id": "9474645",
            "type": "utility",
            "number": "9474645",
            "country": "US",
            "date": "2016-10-25",
            "abstract": "The invention provides punctal plugs for the delivery of active agent to one or both of the tear fluid of the eye and to the nasolacrimal duct that comprise a body, at least one cap, and optionally a collarette.",
            "title": "Punctal plugs for the delivery of active agents",
            "kind": "B2",
            "num_claims": 2,
            "filename": "ipg161025.xml",
            "withdrawn": 0
        },
        {
            "id": "9479570",
            "type": "utility",
            "number": "9479570",
            "country": "US",
            "date": "2016-10-25",
            "abstract": "A method for processing load balancing of graphic streams is provided. The method is used in a system, wherein the system includes a server device and a client device, and the method includes the steps of: receiving, by a virtual machine, a graphic with a plurality of objects and graphic capability information; dispatching, by a dispatcher, the plurality of objects according to the graphic capability information; receiving, by a server GPU, a first group of objects dispatched by the dispatcher, and transforming the first group of objects into a first video stream; receiving, by a virtual desktop viewer, a second group of objects dispatched by the dispatcher; transforming, by a client GPU, the second group of objects into a second video stream; and rendering, by a virtual desktop viewer, the first video stream and the second video stream.",
            "title": "System and method for processing load balancing of graphic streams",
            "kind": "B2",
            "num_claims": 8,
            "filename": "ipg161025.xml",
            "withdrawn": 0
        },
        {
            "id": "9486813",
            "type": "utility",
            "number": "9486813",
            "country": "US",
            "date": "2016-11-08",
            "abstract": "An HVAC system having an air cleaner, a fan configured to selectively generate an air flow, wherein at least a portion of the air flow is passed through the air cleaner, and a controller configured to control the air cleaner in response to at least one of a setting for controlling the fan and an operation characteristic of the fan is disclosed.",
            "title": "Air cleaning systems and methods",
            "kind": "B2",
            "num_claims": 12,
            "filename": "ipg161108.xml",
            "withdrawn": 0
        },
        {
            "id": "5057059",
            "type": "utility",
            "number": "5057059",
            "country": "US",
            "date": "1991-10-15",
            "abstract": " A belt tensioner and method of making the same are provided, the tensioner comprising a support for being fixed relative to a belt, a belt engaging arm carried by the support and being movable relative thereto, a spring operatively associated with the support and the belt engaging arm for urging the belt engaging arm relative to the support and against the belt with a force to tension the belt, the support comprising a shaft having a longitudinal axis, the belt engaging arm being rotatably mounted on the shaft, the arm having a bearing surface angled relative to the axis and the support having a bearing surface angled relative to the axis and facing the bearing surface of the arm, and a bushing disposed between the bearing surfaces and in engagement therewith to facilitate movement therebetween and to tend to prevent cocking of the arm on the shaft when the belt engaging arm is tensioning the belt. ",
            "title": "Belt tensioner and method of making the same",
            "kind": "A",
            "num_claims": 19,
            "filename": "pftaps19911015_wk42.zip",
            "withdrawn": 0
        }
    ]
}