{
    "table_name": "USPTO_OCE_CLAIMS.PATENT_CLAIMS_FULLTEXT_2014",
    "table_fullname": "PATENTS_USPTO.USPTO_OCE_CLAIMS.PATENT_CLAIMS_FULLTEXT_2014",
    "column_names": [
        "pat_no",
        "claim_no",
        "dependencies",
        "claim_txt",
        "appl_id",
        "ind_flg"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "pat_no": "8775049",
            "claim_no": "25",
            "claim_txt": "25. The method according to claim 1, wherein the evaluation of the state of the combustion is performed for each individual cylinder of the internal combustion engine.",
            "dependencies": "1",
            "ind_flg": "0",
            "appl_id": "13306241"
        },
        {
            "pat_no": "8775049",
            "claim_no": "21",
            "claim_txt": "21. The apparatus according to claim 20, wherein each multichannel signal evaluation device is connected with a database in which sample signals of flame light signals with assigned particle emissions are stored.",
            "dependencies": "20",
            "ind_flg": "0",
            "appl_id": "13306241"
        },
        {
            "pat_no": "8775049",
            "claim_no": "3",
            "claim_txt": "3. The method according to claim 1, wherein a limit value for flame light intensity is defined and upon exceeding the limit value in at least one cylinder, a measure is performed for reducing particle emissions in the respective cylinder.",
            "dependencies": "1",
            "ind_flg": "0",
            "appl_id": "13306241"
        },
        {
            "pat_no": "8775049",
            "claim_no": "18",
            "claim_txt": "18. The method according to claim 17, wherein the cumulatively detected emissions are compared with flame light signals peaks detected in a cylinder-selective manner and are assigned to the respective cylinder.",
            "dependencies": "17",
            "ind_flg": "0",
            "appl_id": "13306241"
        },
        {
            "pat_no": "8775049",
            "claim_no": "16",
            "claim_txt": "16. The method according to claim 14, wherein an optimization procedure is performed for the parameterization of the injection and/or the air throttling depending on the mixture state and/or the deviation of the cylinder pressure peaks from the light signal peaks.",
            "dependencies": "14",
            "ind_flg": "0",
            "appl_id": "13306241"
        }
    ]
}