{
    "table_name": "WORLD_BANK_WDI.SERIES_SUMMARY",
    "table_fullname": "COVID19_JHU_WORLD_BANK.WORLD_BANK_WDI.SERIES_SUMMARY",
    "column_names": [
        "other_notes",
        "short_definition",
        "long_definition",
        "series_code",
        "related_indicators",
        "other_web_links",
        "topic",
        "notes_from_original_source",
        "limitations_and_exceptions",
        "indicator_name",
        "general_comments",
        "license_type",
        "base_period",
        "development_relevance",
        "related_source_links",
        "unit_of_measure",
        "source",
        "aggregation_method",
        "statistical_concept_and_methodology",
        "periodicity"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "A brief record of facts topics or thoughts written down and used to contextualize the series definition values and other characteristics.",
        "Short statement of the exact meaning of a series.",
        "Extended statement of the exact meaning of a series.",
        "A number or a sequence of related statistical units arranged or occurring in temporal spatial or other order or succession. WDI carries mostly time series.",
        "In general indicator that are of interest and related to the specific series.",
        "Internet addresses of related pages tools or knowledge bases.",
        "The matter dealt with in the context discourse or subject related to the series.",
        "A brief record of facts topics or thoughts written down and used to contextualize the series definition values and other characteristics.",
        "A limiting rule or circumstance that applies to usage of the series such as the scope of the survey collecting the data or missing years and countries.  It should also note when data are imputed or estimated",
        "Given name of a series.",
        "Other notes regarding the series which do not appear in Development relevance or Limitations or exceptions",
        "Explains the rights conferred and restrictions imposed by the owner to the users of a series",
        "Base period is the period of time for which data is used as the base of an index number or other ratio have been collected. This period is frequently one of a year but it may be as short as one day or as long as the average of a group of years.",
        "The relevance of a series refers to how the indicator’s data may be used to monitor particular aspects of development goals and programs for example the Sustainable Development Goals. The indicator may conclusively measure progress towards a particular objective or may act as a proxy or interpretation of a development aim.",
        "Internet address of related source page tool or knowledge base.",
        "A quantity used as a standard of measurement. Example: Units of time are second minute hour day week month year and decade.",
        "A place person or organization from which the series comes or can be obtained.",
        "Aggregation methods are types of calculations used to group attribute values into a metric for each dimension value. For example for each region one may retrieve the total value of country entries (the sum of the series value for countries belonging to the region).",
        "The abstract idea general statistical notions or a system of methods used to generate the series.",
        "Applies to series recurring at regular intervals. Most of the time this term denotes that interval of recurrence."
    ],
    "sample_rows": [
        {
            "series_code": "AG.AGR.TRAC.NO",
            "topic": "Environment: Agricultural production",
            "indicator_name": "Agricultural machinery, tractors",
            "short_definition": null,
            "long_definition": "Agricultural machinery refers to the number of wheel and crawler tractors (excluding garden tractors) in use in agriculture at the end of the calendar year specified or during the first quarter of the following year.",
            "unit_of_measure": null,
            "periodicity": "Annual",
            "base_period": null,
            "other_notes": null,
            "aggregation_method": "Sum",
            "limitations_and_exceptions": "The data are collected by the Food and Agriculture Organization of the United Nations (FAO) through annual questionnaires. The FAO tries to impose standard definitions and reporting methods, but complete consistency across countries and over time is not possible. The data collected from official national sources through the questionnaire are supplemented with information from official secondary data sources. The secondary sources cover official country data from websites of national ministries, national publications and related country data reported by various international organizations.",
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "Food and Agriculture Organization, electronic files and web site.",
            "statistical_concept_and_methodology": "A tractor provides the power and traction to mechanize agricultural tasks, especially tillage. Agricultural implements may be towed behind or mounted on the tractor, and the tractor may also provide a source of power if the implement is mechanized. The most common use of the term \"tractor\" is for the vehicles used on farms. The farm tractor is used for pulling or pushing agricultural machinery or trailers, for plowing, tilling, disking, harrowing, planting, and similar tasks. Planting, tending and harvesting a crop requires both a significant amount of power and a suitable range of tools and equipment. Mechanization of farming has allowed an increase to the area that can be planted and has contributed towards increased yields, mainly due to the precision with which the farming tasks can be accomplished.",
            "development_relevance": "Agricultural land covers more than one-third of the world's land area. In many industrialized countries, agricultural land is subject to zoning regulations. In the context of zoning, agricultural land (or more properly agriculturally zoned land) refers to plots that may be used for agricultural activities, regardless of the physical type or quality of land.\n\nA substantial contribution to agriculture in the last century has been the escalation from manual and stock-animal farm work to gas-powered farm equipment. Globally, steel plows, mowers, mechanical reapers, seed drills, and threshers contributed to the development of mechanized agriculture, tractors enabled the farmer to sow and harvest large agricultural lands with less manpower. In modern times, powered machinery such as tractors, has replaced many jobs formerly carried out by men or animals such as oxen, horses and mules. FAO estimates that most farmers in developing countries experience a greater annual expenditure on farm power inputs than on fertilizer, seeds or agrochemicals.\n\nAgriculture is still a major sector in many economies, and agricultural activities provide developing countries with food and revenue. But agricultural activities also can degrade natural resources as poor farming practices cause soil erosion and loss of soil fertility.\n\nThere is no single correct mix of inputs to the agricultural land, as it is dependent on local climate, land quality, and economic development; appropriate levels and application rates vary by country and over time and depend on the type of crops, the climate and soils, and the production process used.",
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        },
        {
            "series_code": "AG.CON.FERT.ZS",
            "topic": "Environment: Agricultural production",
            "indicator_name": "Fertilizer consumption (kilograms per hectare of arable land)",
            "short_definition": null,
            "long_definition": "Fertilizer consumption measures the quantity of plant nutrients used per unit of arable land. Fertilizer products cover nitrogenous, potash, and phosphate fertilizers (including ground rock phosphate). Traditional nutrients--animal and plant manures--are not included. For the purpose of data dissemination, FAO has adopted the concept of a calendar year (January to December). Some countries compile fertilizer data on a calendar year basis, while others are on a split-year basis. Arable land includes land defined by the FAO as land under temporary crops (double-cropped areas are counted once), temporary meadows for mowing or for pasture, land under market or kitchen gardens, and land temporarily fallow. Land abandoned as a result of shifting cultivation is excluded.",
            "unit_of_measure": null,
            "periodicity": "Annual",
            "base_period": null,
            "other_notes": null,
            "aggregation_method": "Weighted average",
            "limitations_and_exceptions": "The FAO has revised the time series for fertilizer consumption and irrigation for 2002 onward. FAO collects fertilizer statistics for production, imports, exports, and consumption through the new FAO fertilizer resources questionnaire. In the previous release, the data were based on total consumption of fertilizers, but the data in the recent release are based on the nutrients in fertilizers. Some countries compile fertilizer data on a calendar year basis, while others compile on a crop year basis (July-June). Previous editions of this indicator, Fertilizer consumption (100 grams per hectare of arable land), reported data on a crop year basis, but this edition uses the calendar year, as adopted by the FAO. Caution should thus be used when comparing data over time.\n\nThe data are collected by the Food and Agriculture Organization of the United Nations (FAO) through annual questionnaires. The FAO tries to impose standard definitions and reporting methods, but complete consistency across countries and over time is not possible. The secondary sources cover official country data from websites of national ministries, national publications and related country data reported by various international organizations.",
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "Food and Agriculture Organization, electronic files and web site.",
            "statistical_concept_and_methodology": "Fertilizer consumption measures the quantity of plant nutrients, and is calculated as production plus imports minus exports. Because some chemical compounds used for fertilizers have other industrial applications, the consumption data may overstate the quantity available for crops. Fertilizer consumption as a share of production shows the agriculture sector's vulnerability to import and energy price fluctuation.\n\nMost fertilizers that are commonly used in agriculture contain the three basic plant nutrients - nitrogen, phosphorus, and potassium. Some fertilizers also contain certain \"micronutrients,\" such as zinc and other metals that are necessary for plant growth. Materials that are applied to the land primarily to enhance soil characteristics (rather than as plant food) are commonly referred to as soil amendments. Fertilizers and soil amendments are largely derived from raw material, composts and other organic matter, and wastes, such as sewage sludge and certain industrial wastes.\n\nFAO defines arable land as land under temporary crops (double-cropped areas are counted once), temporary meadows for mowing or for pasture, land under market or kitchen gardens, and land temporarily fallow; land abandoned as a result of shifting cultivation is excluded.",
            "development_relevance": "Factors such as the green revolution, has led to impressive progress in increasing crop yields over the last few decades. This progress, however, is not equal across all regions. Continued progress depends on maintaining agricultural research and education. The cultivation of cereals varies widely in different countries and depends partly upon the development of the economy. Production depends on the nature of the soil, the amount of rainfall, irrigation, quality od seeds, and the techniques applied to promote growth.\n\nAgriculture is still a major sector in many economies, and agricultural activities provide developing countries with food and revenue. But agricultural activities also can degrade natural resources. Poor farming practices can cause soil erosion and loss of soil fertility. Efforts to increase productivity by using chemical fertilizers, pesticides, and intensive irrigation have environmental costs and health impacts. Salinization of irrigated land diminishes soil fertility. Thus, inappropriate use of inputs for agricultural production has far-reaching effects.\n\nIn many developed countries, excessive nitrogen fertilizer applications have sometime lead to pest problems by increasing the birth rate, longevity and overall fitness of certain agricultural pests, such as aphids. Further, excessive use of fertilizers emits significant quantities of greenhouse gas into the atmosphere. Over-fertilization of a vital nutrient can be detrimental, as \"fertilizer burn\" can occur when too much fertilizer is applied, resulting in drying out of the leaves and damage or even death of the plant. In many industrialized countries, overuse of fertilizers has resulted in contamination of surface water and groundwater.\n\nThere is no single correct mix of inputs to the agricultural land, as it is dependent on local climate, land quality, and economic development; appropriate levels and application rates vary by country and over time and depend on the type of crops, the climate and soils, and the production process used.",
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        },
        {
            "series_code": "AG.LND.AGRI.K2",
            "topic": "Environment: Land use",
            "indicator_name": "Agricultural land (sq. km)",
            "short_definition": null,
            "long_definition": "Agricultural land refers to the share of land area that is arable, under permanent crops, and under permanent pastures. Arable land includes land defined by the FAO as land under temporary crops (double-cropped areas are counted once), temporary meadows for mowing or for pasture, land under market or kitchen gardens, and land temporarily fallow. Land abandoned as a result of shifting cultivation is excluded. Land under permanent crops is land cultivated with crops that occupy the land for long periods and need not be replanted after each harvest, such as cocoa, coffee, and rubber. This category includes land under flowering shrubs, fruit trees, nut trees, and vines, but excludes land under trees grown for wood or timber. Permanent pasture is land used for five or more years for forage, including natural and cultivated crops.",
            "unit_of_measure": null,
            "periodicity": "Annual",
            "base_period": null,
            "other_notes": "Areas of former states are included in the successor states.",
            "aggregation_method": "Sum",
            "limitations_and_exceptions": "The data are collected by the Food and Agriculture Organization of the United Nations (FAO) through annual questionnaires. The FAO tries to impose standard definitions and reporting methods, but complete consistency across countries and over time is not possible. Thus, data on agricultural land in different climates may not be comparable. For example, permanent pastures are quite different in nature and intensity in African countries and dry Middle Eastern countries. Data on agricultural employment, in particular, should be used with caution. In many countries much agricultural employment is informal and unrecorded, including substantial work performed by women and children. To address some of these concerns, this indicator is heavily footnoted in the database in sources, definition, and coverage. The secondary sources cover official country data from websites of national ministries, national publications and related country data reported by various international organizations.",
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "Food and Agriculture Organization, electronic files and web site.",
            "statistical_concept_and_methodology": "Agricultural land constitutes only a part of any country's total area, which can include areas not suitable for agriculture, such as forests, mountains, and inland water bodies. Three components of the agricultural land are a) arable land - land defined by the FAO as land under temporary crops (double-cropped areas are counted once), temporary meadows for mowing or for pasture, land under market or kitchen gardens, and land temporarily fallow, b) permanent pasture - land used for five or more years for forage, including natural and cultivated crops, and c) and under permanent crops - land cultivated with crops that occupy the land for long periods and need not be replanted after each harvest, such as cocoa, coffee, and rubber; land under flowering shrubs, fruit trees, nut trees, and vines is included, but land under trees grown for wood or timber is not.\n\nAgricultural land is also sometimes classified as irrigated and non-irrigated land. In arid and semi-arid countries agriculture is often confined to irrigated land, with very little farming possible in non-irrigated areas. Land abandoned as a result of shifting cultivation is excluded from arable land.\n\nData on agricultural land are valuable for conducting studies on a various perspectives concerning agricultural production, food security and for deriving cropping intensity among others uses. Agricultural land indicator, along with land-use indicators, can also elucidate the environmental sustainability of countries' agricultural practices.",
            "development_relevance": "Agricultural land covers more than one-third of the world's land area. In many industrialized countries, agricultural land is subject to zoning regulations. In the context of zoning, agricultural land (or more properly agriculturally zoned land) refers to plots that may be used for agricultural activities, regardless of the physical type or quality of land.\n\nFAO's agricultural land data contains a wide range of information on variables that are significant for understanding the structure of a country's agricultural sector; making economic plans and policies for food security; and deriving environmental indicators, including those related to investment in agriculture and data on gross crop area and net crop area which are useful for policy formulation and monitoring.\n\nAgriculture is still a major sector in many economies, and agricultural activities provide developing countries with food and revenue. But agricultural activities also can degrade natural resources. Poor farming practices can cause soil erosion and loss of soil fertility. Efforts to increase productivity by using chemical fertilizers, pesticides, and intensive irrigation have environmental costs and health impacts. Excessive use of chemical fertilizers can alter the chemistry of soil. Pesticide poisoning is common in developing countries. And salinization of irrigated land diminishes soil fertility. Thus, inappropriate use of inputs for agricultural production has far-reaching effects.\n\nThere is no single correct mix of inputs to the agricultural land, as it is dependent on local climate, land quality, and economic development; appropriate levels and application rates vary by country and over time and depend on the type of crops, the climate and soils, and the production process used.",
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        },
        {
            "series_code": "AG.LND.ARBL.HA",
            "topic": "Environment: Land use",
            "indicator_name": "Arable land (hectares)",
            "short_definition": null,
            "long_definition": "Arable land (in hectares) includes land defined by the FAO as land under temporary crops (double-cropped areas are counted once), temporary meadows for mowing or for pasture, land under market or kitchen gardens, and land temporarily fallow. Land abandoned as a result of shifting cultivation is excluded.",
            "unit_of_measure": null,
            "periodicity": "Annual",
            "base_period": null,
            "other_notes": null,
            "aggregation_method": null,
            "limitations_and_exceptions": "The Food and Agriculture Organization (FAO) tries to impose standard definitions and reporting methods, but complete consistency across countries and over time is not possible. Thus, data on agricultural land in different climates may not be comparable. For example, permanent pastures are quite different in nature and intensity in African countries and dry Middle Eastern countries.\n\nThe data collected by the Food and Agriculture Organization (FAO) of the United Nations from official national sources through the questionnaire are supplemented with information from official secondary data sources. The secondary sources cover official country data from websites of national ministries, national publications and related country data reported by various international organizations. Data on agricultural land are valuable for conducting studies on a various perspectives concerning agricultural production, food security and for deriving cropping intensity among others uses. Agricultural land indicator, along with land-use indicators, can also elucidate the environmental sustainability of countries' agricultural practices.\n\nTrue comparability of the data is limited, however, by variations in definitions, statistical methods, and quality of data. Countries use different definitions land use. The Food and Agriculture Organization of the United Nations (FAO), the primary compiler of the data, occasionally adjusts its definitions of land use categories and revises earlier data. Because the data reflect changes in reporting procedures as well as actual changes in land use, apparent trends should be interpreted cautiously.\n\nSatellite images show land use that differs from that of ground-based measures in area under cultivation and type of land use. Moreover, land use data in some countries (India is an example) are based on reporting systems designed for collecting tax revenue. With land taxes no longer a major source of government revenue, the quality and coverage of land use data have declined.",
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "Food and Agriculture Organization, electronic files and web site.",
            "statistical_concept_and_methodology": "Temporary fallow land refers to land left fallow for less than five years. The abandoned land resulting from shifting cultivation is not included in this category. Data for \"Arable land\" are not meant to indicate the amount of land that is potentially cultivable.",
            "development_relevance": "Agricultural land covers more than one-third of the world's land area. Agricultural land constitutes only a part of any country's total area, which can include areas not suitable for agriculture, such as forests, mountains, and inland water bodies.\n\nAgriculture is still a major sector in many economies, and agricultural activities provide developing countries with food and revenue. But agricultural activities also can degrade natural resources. Poor farming practices can cause soil erosion and loss of soil fertility. Efforts to increase productivity by using chemical fertilizers, pesticides, and intensive irrigation have environmental costs and health impacts. Excessive use of chemical fertilizers can alter the chemistry of soil. Pesticide poisoning is common in developing countries. And salinization of irrigated land diminishes soil fertility. Thus, inappropriate use of inputs for agricultural production has far-reaching effects.\n\nThere is significant geographic variation in the availability of land considered suitable for agriculture. Increasing population and demand from other sectors place growing pressure on available resources. According to FAO, the world's cultivated area has grown by 12 percent over the last 50 years. The global irrigated area has doubled over the same period, accounting for most of the net increase in cultivated land. Agriculture already uses 11 percent of the world's land surface for crop production. It also makes use of 70 percent of all water withdrawn from aquifers, streams and lakes. Agricultural policies have primarily benefitted farmers with productive land and access to water, bypassing the majority of small-scale producers who are still locked in a poverty trap of high vulnerability, land degradation and climatic uncertainty.\n\nLand resources are central to agriculture and rural development, and are intrinsically linked to global challenges of food insecurity and poverty, climate change adaptation and mitigation, as well as degradation and depletion of natural resources that affect the livelihoods of millions of rural people across the world.\n\nIn many industrialized countries, agricultural land is subject to zoning regulations. In the context of zoning, agricultural land (or more properly agriculturally zoned land) refers to plots that may be used for agricultural activities, regardless of the physical type or quality of land.",
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        },
        {
            "series_code": "AG.LND.ARBL.HA.PC",
            "topic": "Environment: Land use",
            "indicator_name": "Arable land (hectares per person)",
            "short_definition": null,
            "long_definition": "Arable land (hectares per person) includes land defined by the FAO as land under temporary crops (double-cropped areas are counted once), temporary meadows for mowing or for pasture, land under market or kitchen gardens, and land temporarily fallow. Land abandoned as a result of shifting cultivation is excluded.",
            "unit_of_measure": null,
            "periodicity": "Annual",
            "base_period": null,
            "other_notes": "Areas of former states are included in the successor states.",
            "aggregation_method": "Weighted Average",
            "limitations_and_exceptions": "The Food and Agriculture Organization (FAO) tries to impose standard definitions and reporting methods, but complete consistency across countries and over time is not possible. Thus, data on agricultural land in different climates may not be comparable. For example, permanent pastures are quite different in nature and intensity in African countries and dry Middle Eastern countries.\n\nTrue comparability of the data is limited, by variations in definitions, statistical methods, and quality of data. Countries use different definitions land use. The Food and Agriculture Organization of the United Nations (FAO), the primary compiler of the data, occasionally adjusts its definitions of land use categories and revises earlier data. Because the data reflect changes in reporting procedures as well as actual changes in land use, apparent trends should be interpreted cautiously.\n\nSatellite images show land use that differs from that of ground-based measures in area under cultivation and type of land use. Moreover, land use data in some countries (India is an example) are based on reporting systems designed for collecting tax revenue. With land taxes no longer a major source of government revenue, the quality and coverage of land use data have declined.",
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "Food and Agriculture Organization, electronic files and web site.",
            "statistical_concept_and_methodology": "Temporary fallow land refers to land left fallow for less than five years. The abandoned land resulting from shifting cultivation is not included in this category. Data for \"Arable land\" are not meant to indicate the amount of land that is potentially cultivable. The data collected by the Food and Agriculture Organization (FAO) of the United Nations from official national sources through the questionnaire are supplemented with information from official secondary data sources. The secondary sources cover official country data from websites of national ministries, national publications and related country data reported by various international organizations.",
            "development_relevance": "Agricultural land covers about one-third of the world's land area, with arable land representing less than one-third of agricultural land (about 10 percent of the world's land area). Agricultural land constitutes only a part of any country's total area, which can include areas not suitable for agriculture, such as forests, mountains, and inland water bodies.\n\nAgriculture is still a major sector in many economies, and agricultural activities provide developing countries with food and revenue. But agricultural activities also can degrade natural resources. Poor farming practices can cause soil erosion and loss of soil fertility. Efforts to increase productivity by using chemical fertilizers, pesticides, and intensive irrigation have environmental costs and health impacts. Excessive use of chemical fertilizers can alter the chemistry of soil. Pesticide poisoning is common in developing countries. And salinization of irrigated land diminishes soil fertility. Thus, inappropriate use of inputs for agricultural production has far-reaching effects.\n\nThere is significant geographic variation in the availability of land considered suitable for agriculture. Increasing population and demand from other sectors place growing pressure on available resources. According to FAO, the world's cultivated area has grown by 12 percent over the last 50 years. The global irrigated area has doubled over the same period, accounting for most of the net increase in cultivated land. Agriculture already uses 11 percent of the world's land surface for crop production. It also makes use of 70 percent of all water withdrawn from aquifers, streams and lakes. Agricultural policies have primarily benefitted farmers with productive land and access to water, bypassing the majority of small-scale producers who are still locked in a poverty trap of high vulnerability, land degradation and climatic uncertainty.\n\nData on agricultural land are valuable for conducting studies on a various perspectives concerning agricultural production, food security and for deriving cropping intensity among others uses. Agricultural land indicator, along with land-use indicators, can also elucidate the environmental sustainability of countries' agricultural practices.\n\nLand resources are central to agriculture and rural development, and are intrinsically linked to global challenges of food insecurity and poverty, climate change adaptation and mitigation, as well as degradation and depletion of natural resources that affect the livelihoods of millions of rural people across the world.\n\nIn many industrialized countries, agricultural land is subject to zoning regulations. In the context of zoning, agricultural land (or more properly agriculturally zoned land) refers to plots that may be used for agricultural activities, regardless of the physical type or quality of land.",
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        }
    ]
}