{
    "table_name": "hpsa_mental_health",
    "table_fullname": "bigquery-public-data.sdoh_hrsa_shortage_areas.hpsa_mental_health",
    "column_names": [
        "Source_ID",
        "Source_Name",
        "Status_Code",
        "Status_Description",
        "Type_Code",
        "Type_Desc",
        "Address",
        "City",
        "State_Abbr",
        "Postal_Code",
        "Degree_of_Shortage",
        "Designation_Date",
        "Designation_Last_Update_Date",
        "Designation_Pop",
        "Estimated_Underserved_Pop",
        "Estimated_Served_Pop",
        "Formal_Ratio",
        "Total_FTE_Clinicians",
        "Metropolitan_Indicator_Code",
        "Metropolitan_Indicator_Desc",
        "Provider_Ratio_Goal",
        "Percent_Pop_Below_Poverty",
        "HPSA_Score",
        "HPSA_Shortage",
        "Discipline_Class_Num",
        "Discipline_Class_Desc",
        "Component_Source_ID",
        "Component_Source_Name",
        "Component_Status_Code",
        "Component_Status_Desc",
        "Component_Type_Code",
        "Component_Type_Desc",
        "Component_State_Abbr",
        "Component_Postal_Code",
        "Component_Designation_Date",
        "Component_Designation_Date_String",
        "Component_Designation_Last_Update_Date",
        "Geography_ID",
        "CountyFIPS",
        "County_Name",
        "StateCountyFIPS",
        "State_FIPS",
        "State_Abbr_2",
        "State_Name",
        "Primary_State_Name",
        "Primary_State_FIPS",
        "Primary_HHS_Region_Name",
        "US_Mexico_Border_County",
        "US_Mexico_Border_100km",
        "Data_Warehouse_Record_Create_Date",
        "Data_Warehouse_Record_Create_Date_Text",
        "HPSA_Name",
        "HPSA_Component_Name",
        "Break_in_Designation",
        "Geocoding_Primary_X",
        "Geocoding_Primary_Y",
        "HPSA_Pop_Type_Code",
        "HPSA_Pop_Type_Desc",
        "HPSA_Resident_Civilian_Pop",
        "Common_City_Name_with_State_Abbr",
        "Common_Postal_Code",
        "Common_County_Name",
        "Common_StateCounty_FIPS",
        "Common_State_Abbr",
        "Common_State_Name",
        "Common_State_FIPS",
        "Common_Region_Name",
        "HPSA_Withdrawn_Date",
        "HPSA_Withdrawn_Date_String",
        "Provider_Type",
        "Rural_Status_Code",
        "Rural_Status_Desc",
        "HPSA_Designation_Pop_Type_Desc",
        "BHCMIS_OrgID"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "DATE",
        "DATE",
        "INT64",
        "INT64",
        "INT64",
        "STRING",
        "FLOAT64",
        "STRING",
        "STRING",
        "STRING",
        "FLOAT64",
        "INT64",
        "FLOAT64",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "DATE",
        "STRING",
        "DATE",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "DATE",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "DATE",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "Source_ID",
        "Source_Name",
        "Status_Code",
        "Status_Description",
        "Type_Code",
        "Type_Desc",
        "Address",
        "City",
        "State_Abbr",
        "Postal_Code",
        "Degree_of_Shortage",
        "Designation_Date",
        "Designation_Last_Update_Date",
        "Designation_Pop",
        "Estimated_Underserved_Pop",
        "Estimated_Served_Pop",
        "Formal_Ratio",
        "Total_FTE_Clinicians",
        "Metropolitan_Indicator_Code",
        "Metropolitan_Indicator_Desc",
        "Provider_Ratio_Goal",
        "Percent_Pop_Below_Poverty",
        "HPSA_Score",
        "HPSA_Shortage",
        "Discipline_Class_Num",
        "Discipline_Class_Desc",
        "Component_Source_ID",
        "Component_Source_Name",
        "Component_Status_Code",
        "Component_Status_Desc",
        "Component_Type_Code",
        "Component_Type_Desc",
        "Component_State_Abbr",
        "Component_Postal_Code",
        "Component_Designation_Date",
        "Component_Designation_Date_String",
        "Component_Designation_Last_Update_Date",
        "Geography_ID",
        "CountyFIPS",
        "County_Name",
        "StateCountyFIPS",
        "State_FIPS",
        "State_Abbr_2",
        "State_Name",
        "Primary_State_Name",
        "Primary_State_FIPS",
        "Primary_HHS_Region_Name",
        "US_Mexico_Border_County",
        "US_Mexico_Border_100km",
        "Data_Warehouse_Record_Create_Date",
        "Data_Warehouse_Record_Create_Date_Text",
        "HPSA_Name",
        "HPSA_Component_Name",
        "Break_in_Designation",
        "Geocoding_Primary_X",
        "Geocoding_Primary_Y",
        "HPSA_Pop_Type_Code",
        "HPSA_Pop_Type_Desc",
        "HPSA_Resident_Civilian_Pop",
        "Common_City_Name_with_State_Abbr",
        "Common_Postal_Code",
        "Common_County_Name",
        "Common_StateCounty_FIPS",
        "Common_State_Abbr",
        "Common_State_Name",
        "Common_State_FIPS",
        "Common_Region_Name",
        "HPSA_Withdrawn_Date",
        "HPSA_Withdrawn_Date_String",
        "Provider_Type",
        "Rural_Status_Code",
        "Rural_Status_Desc",
        "HPSA_Designation_Pop_Type_Desc",
        "BHCMIS_OrgID"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "DATE",
        "DATE",
        "INT64",
        "INT64",
        "INT64",
        "STRING",
        "FLOAT64",
        "STRING",
        "STRING",
        "STRING",
        "FLOAT64",
        "INT64",
        "FLOAT64",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "DATE",
        "STRING",
        "DATE",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "DATE",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "DATE",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        "Primary identifier for a Health Professional Shortage Area (HPSA) as a complete unit in the source data system.",
        "The name of the Health Professional Shortage Area (HPSA). This data element comes directly from the source system in the most recent data refresh. For further information about HPSA refer to the http://www.hrsa.gov/shortage/ website.",
        "One character identifier that designates the current status of the HPSA designation. For further information about Health Professional Shortage Areas (HPSA) refer to the http://www.hrsa.gov/shortage/ website.",
        "Textual description of the current status of the Health Professional Shortage Area (HPSA) designation.",
        "Geography or facility type code characterizing the Health Professional Shortage Area (HPSA).",
        "Textual description of the Health Professional Shortage Area (HPSA) type.",
        "Standardized version of the street address of a Health Professional Shortage Area (HPSA) facility.",
        "Standardized version of the city name in which a Health Professional Shortage Areas (HPSA) facility is located.",
        "U.S. Postal Service (USPS) code for the state in which the Health Professional Shortage Area (HPSA) entity is located.",
        "Health Professional Shortage Area (HPSA) U.S. Postal Service (USPS) Zoning Improvement Plan (ZIP) Code. In the context of HPSA data, this field only applies to facilities.",
        "Degree of practitioner shortage for the Health Professional Shortage Area (HPSA) based on population to provider ratio.",
        "Date on which the Health Professional Shortage Area (HPSA) was originally designated as a shortage area.",
        "Date on which the Health Professional Shortage Area (HPSA) information was last updated in the source system.",
        "Number of persons which have been identified by the HRSA, Bureau of Health Workforce (BHW), Division of Policy and Shortage Designation (DPSD) as being affected by the Health Professional Shortage Area (HPSA).",
        "Estimated underserved population served by the full-time equivalent (FTE) health care practitioners within a Health Professional Shortage Area (HPSA).",
        "Estimated total population served by the full-time equivalent (FTE) Health care practitioners within a Health Professional Shortage Area (HPSA).",
        "Ratio of the Health Professional Shortage Area (HPSA) Designation Population to HPSA provider full-time equivalents displayed in ratio format (for example, 3500:1), where the population and the designation share the same discipline class (for example, Primary Care, Dental Care, and Mental Health).",
        "Number of practitioners providing ambulatory patient care in the Health Professional Shortage Area (HPSA) expressed as full-time equivalents.",
        "Single character indicating whether a Health Professional Shortage Area (HPSA) is considered to be in a metropolitan, non-metropolitan, or frontier area.",
        "Description indicating whether a Health Professional Shortage Area (HPSA) is either Metropolitan, Non-Metropolitan, or Frontier in nature.",
        "Health Professional Shortage Area (HPSA) Provider Ratio Goal that is the target population per provider (physician) for the HPSA in a Discipline Class. Federal regulations stipulate that, in order to be considered as having a shortage of providers, an area must have a population-to-provider ratio of a certain threshold. For primary medical care, the population to provider ratio must be at least 3,500 to 1 (3,000 to 1 if there are unusually high needs in the community). For dental, the ratio must be at least 5,000 to 1 (4,000 to 1 in high-need communities). For mental health, the area must have a population to psychiatrist ratio of 30,000 to 1 (20,000 to 1 in high-need communities). For further information about Health Professional Shortage Areas (HPSA) refer to the http://www.hrsa.gov/shortage/ website.",
        "Percent of the population in the Health Professional Shortage Area (HPSA) living below the U.S. Federal Poverty Level (USFPL).",
        "Health Professional Shortage Area (HPSA) Score developed by the National Health Service Corps (NHSC) in determining priorities for assignment of clinicians. The scores range from 0 to 26 where the higher the score, the greater the priority.",
        "Number of full-time equivalent (FTE) practitioners needed in the Health Professional Shortage Area (HPSA) so that it will achieve the population to practitioner target ratio. The target ratio is determined by the type (discipline) of the HPSA.",
        "Single character code used by the HRSA Data Warehouse (HDW) to indicate the Discipline Class identification number (ID) values associated with health related discipline classes.",
        "Health Professional Shortage Area (HPSA) discipline class description. HPSA disciplines may be listed as Primary Care, Dental Health, or Mental Health.",
        "Identification number linking a Health Professional Shortage Area (HPSA) component to its \"parent\" HPSA.",
        "Name assigned to the Health Professional Shortage Area (HPSA) component as identified in the most recent data refresh.",
        "One-character code that indicates the designation status for the component part of the Health Professional Shortage Areas (HPSA).",
        "Health Professional Shortage Area (HPSA) Component Status Description which is the English-language expansion of the HPSA Component Status Code. This text description identifies the current status of the HPSA component and is subject to change during the life span of the HPSA.",
        "Geography or facility type code which characterizes the Health Professional Shortage Area (HPSA) component.",
        "Health Professional Shortage Area (HPSA) Component Type Description which identifies in words the type of the HPSA for the component.",
        "U.S. Postal Service (USPS) two alphabetic character code for a U.S. state or U.S. territory that is associated with the county or county equivalent in which the Health Professional Shortage Area (HPSA) component is located.",
        "U.S. Postal Service Zone Improvement Plan (ZIP) associated with a Health Professional Shortage Area (HPSA) Component.",
        "Date when the HPSA was designated as a shortage area as represented in the most recent data refresh from the source data. For further information about Health Professional Shortage Areas (HPSA) refer to the http://www.hrsa.gov/shortage/ website.",
        "Date when the Health Professional Shortage Area (HPSA) was designated as a shortage area as represented in the most recent data-refresh from the source data and stored as a text string.",
        "Date when the HPSA component was last updated, as represented in the most recent HPSA source data refresh. For further information about Health Professional Shortage Areas (HPSA) refer to the http://www.hrsa.gov/shortage/ website.",
        "Health Professional Shortage Area (HPSA) geography code which identifies the specific geographic area (county, minor civil division (MCD), or Census Tract) associated with the HPSA.",
        "Numeric character string assigned by the National Institute of Standards and Technology to the counties and/or county equivalents for the states, the District of Columbia, and U.S. territories.",
        "Name of the county or county equivalent in which the associated address is located, displayed as a text string.",
        "Concatenation (combination) of the Federal Information Processing Standard (FIPS) state and county codes.",
        "State Federal Information Processing Standard (FIPS) code identifying the two numeric character string assigned by the National Institute of Standards and Technology (NIST) to states, the District of Columbia, and U.S. territories.",
        "U.S. Postal Service (USPS) two alphabetic character code for a U.S. state or U.S. territory associated with a location where an entity is situated.",
        "State or territory name.",
        "Formal, official U.S. state or U.S. territory name associated with the location or address for the entity (record). With respect to a Health Professional Shortage Area (HPSA) or a Medically Underserved Area/Population (MUA/P), the physical land area associated with the entity may cross state boundaries, which means a HPSA or MUA/P may consist of components or parts from one or more states. Therefore, the primary state for one of these areas is the state associated with the parent or primary record. Also, the primary state is used for aggregating counts and sums at the state level.",
        "State Federal Information Processing Standard (FIPS) code identifying the two numeric character string assigned by the National Institute of Standards and Technology (NIST) to states, the District of Columbia, and U.S. territories.",
        "Formal name for the U.S. Department of Health and Human Services (DHHS) Region associated with the location or address for the entity. With respect to a Health Professional Shortage Area (HPSA) or a Medically Underserved Area/Population (MUA/P), the physical land area associated with the entity may cross state boundaries, which means a HPSA or MUA/P may consist of components or parts from one or more states. Therefore, the primary state for one of these areas is the state associated with the parent or primary record. Also, the primary state is used for aggregating counts and sums at the state level.",
        "Indication of whether a county or a part of a county is listed in U.S. counties that the U.S. - Mexico Border Health Commission has defined as comprising the Border Health Initiative zone. For counties in the contiguous U.S., this data element may differ from the value of the U.S. - Mexico Border 100 Kilometer Indicator due to the fact that three counties in Arizona fall partially within the defined 100-kilometer boundary area, but are not listed in the list of counties that the U.S. - Mexico Border Health Commission identified as comprising the zone of interest.",
        "Indication of whether any portion of the geographic entity cited is within 100 kilometers of the U.S. - Mexico border. The HRSA Data Warehouse generates this value by performing a geoprocessing analysis against the 100 kilometer U.S. - Mexico border region as defined by the HRSA Office of Rural Health Policy, Border Health Program.",
        "Date on which the data was processed by the HRSA Data Warehouse.",
        "Date on which the data was processed by the HRSA Data Warehouse.",
        "Title case format, user friendly name which is generated by decoding the Health Professional Shortage Area (HPSA) name which came directly from the source system.",
        "Name of the Health Professional Shortage Area (HPSA) component, as identified in the source data system. For area HPSAs, a component may be a county, census tract, or minor civil division (MCD).",
        "Indication of whether the Health Professional Shortage Area (HPSA) or Medically Underserved Area/Population (MUA/P) has been continuously designated since the original designation date.",
        "Primary longitude in decimal degrees (x coordinate) of an entity based on its address.",
        "Primary latitude in decimal degrees (y coordinate) of an entity based on its address.",
        "Code of the population type in a designated Health Professional Shortage Area (HPSA).",
        "Population type description which characterizes the Health Professional Shortage Area (HPSA).",
        "Population type description for the Health Professional Shortage Area (HPSA).",
        "City name in which the entity is physically located.",
        "Postal code associated with an entity address. For the purposes of the HRSA Data Warehouse this value is a five character U.S. Postal Service (USPS) Zone Improvement Plan (ZIP) code.",
        "HRSA Data Warehouse (HDW) concatenation of the complete county name and the state abbreviation.",
        "Combination of the state and county Federal Information Processing Standard (FIPS) codes.",
        "U.S. Postal Service (USPS) two alphabetic character code for a U.S. state or U.S. territory associated with a location where an entity is situated.",
        "State or territory name.",
        "State Federal Information Processing Standard (FIPS) code identifying the two numeric character string assigned by the National Institute of Standards and Technology (NIST) to states, the District of Columbia, and U.S. territories.",
        "Formal name for the U.S. Department of Health and Human Services (HHS) region associated with the entity location or address.",
        "Date on which the designation status was changed from designated to withdrawn.",
        "Date on which the designation status was changed from designated to withdrawn.",
        "Type of mental health providers used in the full-time equivalent (FTE) calculations for the specified Health Professional Shortage Area (HPSA) designation.",
        "Status code indicating rural status of an entity (such as a facility or a geographic area).",
        "Rural status description for the entity (such as a facility or a geographic area).",
        "This attribute represents Health Professional Shortage Area (HPSA) designation population type description.",
        "Organization source identification number from the HRSA, Bureau of Primary Health Care (BPHC) Health Center Management Information System (BHCMIS)."
    ],
    "sample_rows": [
        {
            "Source_ID": "733007",
            "Source_Name": "Coos",
            "Status_Code": "W",
            "Status_Description": "Withdrawn",
            "Type_Code": "Hpsa Geo",
            "Type_Desc": "Geographic HPSA",
            "Address": null,
            "City": null,
            "State_Abbr": "NH",
            "Postal_Code": null,
            "Degree_of_Shortage": "Not applicable",
            "Designation_Date": "1979-05-30",
            "Designation_Last_Update_Date": "2003-06-27",
            "Designation_Pop": null,
            "Estimated_Underserved_Pop": null,
            "Estimated_Served_Pop": null,
            "Formal_Ratio": null,
            "Total_FTE_Clinicians": 0.0,
            "Metropolitan_Indicator_Code": "N",
            "Metropolitan_Indicator_Desc": "Non-Metropolitan",
            "Provider_Ratio_Goal": null,
            "Percent_Pop_Below_Poverty": 9.0,
            "HPSA_Score": 0,
            "HPSA_Shortage": NaN,
            "Discipline_Class_Num": 7,
            "Discipline_Class_Desc": "Mental Health",
            "Component_Source_ID": null,
            "Component_Source_Name": "Coos",
            "Component_Status_Code": "W",
            "Component_Status_Desc": "Withdrawn",
            "Component_Type_Code": "SCTY",
            "Component_Type_Desc": "Single County",
            "Component_State_Abbr": "NH",
            "Component_Postal_Code": null,
            "Component_Designation_Date": "1979-05-30",
            "Component_Designation_Date_String": "5/30/1979",
            "Component_Designation_Last_Update_Date": "2003-06-27",
            "Geography_ID": "33007",
            "CountyFIPS": 7,
            "County_Name": "Coos",
            "StateCountyFIPS": "33007",
            "State_FIPS": "33",
            "State_Abbr_2": "NH",
            "State_Name": "New Hampshire",
            "Primary_State_Name": "New Hampshire",
            "Primary_State_FIPS": 33,
            "Primary_HHS_Region_Name": "Region I",
            "US_Mexico_Border_County": "N",
            "US_Mexico_Border_100km": "N",
            "Data_Warehouse_Record_Create_Date": "2019-12-17",
            "Data_Warehouse_Record_Create_Date_Text": "12/17/2019",
            "HPSA_Name": "Coos",
            "HPSA_Component_Name": "Coos",
            "Break_in_Designation": "N",
            "Geocoding_Primary_X": NaN,
            "Geocoding_Primary_Y": NaN,
            "HPSA_Pop_Type_Code": "TRC",
            "HPSA_Pop_Type_Desc": "Geographic Population",
            "HPSA_Resident_Civilian_Pop": null,
            "Common_City_Name_with_State_Abbr": null,
            "Common_Postal_Code": null,
            "Common_County_Name": "Coos County, NH",
            "Common_StateCounty_FIPS": "33007",
            "Common_State_Abbr": "NH",
            "Common_State_Name": "New Hampshire",
            "Common_State_FIPS": "33",
            "Common_Region_Name": "Region I",
            "HPSA_Withdrawn_Date": "2003-06-27",
            "HPSA_Withdrawn_Date_String": "6/27/2003",
            "Provider_Type": null,
            "Rural_Status_Code": "R",
            "Rural_Status_Desc": "Rural",
            "HPSA_Designation_Pop_Type_Desc": "Geographic Population",
            "BHCMIS_OrgID": null
        },
        {
            "Source_ID": "7449994412",
            "Source_Name": "Northern Rhode Island Catchment Area",
            "Status_Code": "W",
            "Status_Description": "Withdrawn",
            "Type_Code": "Hpsa Geo",
            "Type_Desc": "Geographic HPSA",
            "Address": null,
            "City": null,
            "State_Abbr": "RI",
            "Postal_Code": null,
            "Degree_of_Shortage": "Not applicable",
            "Designation_Date": "2003-02-20",
            "Designation_Last_Update_Date": "2008-08-11",
            "Designation_Pop": 0,
            "Estimated_Underserved_Pop": null,
            "Estimated_Served_Pop": null,
            "Formal_Ratio": null,
            "Total_FTE_Clinicians": NaN,
            "Metropolitan_Indicator_Code": "M",
            "Metropolitan_Indicator_Desc": "Metropolitan",
            "Provider_Ratio_Goal": null,
            "Percent_Pop_Below_Poverty": 6.5,
            "HPSA_Score": 0,
            "HPSA_Shortage": NaN,
            "Discipline_Class_Num": 7,
            "Discipline_Class_Desc": "Mental Health",
            "Component_Source_ID": null,
            "Component_Source_Name": "184",
            "Component_Status_Code": "W",
            "Component_Status_Desc": "Withdrawn",
            "Component_Type_Code": "CT",
            "Component_Type_Desc": "Census Tract",
            "Component_State_Abbr": "RI",
            "Component_Postal_Code": null,
            "Component_Designation_Date": "2003-02-20",
            "Component_Designation_Date_String": "2/20/2003",
            "Component_Designation_Last_Update_Date": "2008-08-11",
            "Geography_ID": "44007018400",
            "CountyFIPS": 7,
            "County_Name": "Providence",
            "StateCountyFIPS": "44007",
            "State_FIPS": "44",
            "State_Abbr_2": "RI",
            "State_Name": "Rhode Island",
            "Primary_State_Name": "Rhode Island",
            "Primary_State_FIPS": 44,
            "Primary_HHS_Region_Name": "Region I",
            "US_Mexico_Border_County": "N",
            "US_Mexico_Border_100km": "N",
            "Data_Warehouse_Record_Create_Date": "2019-12-17",
            "Data_Warehouse_Record_Create_Date_Text": "12/17/2019",
            "HPSA_Name": "Northern Rhode Island Catchment Area",
            "HPSA_Component_Name": "184",
            "Break_in_Designation": "N",
            "Geocoding_Primary_X": NaN,
            "Geocoding_Primary_Y": NaN,
            "HPSA_Pop_Type_Code": "TRC",
            "HPSA_Pop_Type_Desc": "Geographic Population",
            "HPSA_Resident_Civilian_Pop": 0,
            "Common_City_Name_with_State_Abbr": null,
            "Common_Postal_Code": null,
            "Common_County_Name": "Providence County, RI",
            "Common_StateCounty_FIPS": "44007",
            "Common_State_Abbr": "RI",
            "Common_State_Name": "Rhode Island",
            "Common_State_FIPS": "44",
            "Common_Region_Name": "Region I",
            "HPSA_Withdrawn_Date": "2008-08-11",
            "HPSA_Withdrawn_Date_String": "8/11/2008",
            "Provider_Type": null,
            "Rural_Status_Code": null,
            "Rural_Status_Desc": null,
            "HPSA_Designation_Pop_Type_Desc": "Geographic Population",
            "BHCMIS_OrgID": null
        },
        {
            "Source_ID": "7449994412",
            "Source_Name": "Northern Rhode Island Catchment Area",
            "Status_Code": "W",
            "Status_Description": "Withdrawn",
            "Type_Code": "Hpsa Geo",
            "Type_Desc": "Geographic HPSA",
            "Address": null,
            "City": null,
            "State_Abbr": "RI",
            "Postal_Code": null,
            "Degree_of_Shortage": "Not applicable",
            "Designation_Date": "2003-02-20",
            "Designation_Last_Update_Date": "2008-08-11",
            "Designation_Pop": 0,
            "Estimated_Underserved_Pop": null,
            "Estimated_Served_Pop": null,
            "Formal_Ratio": null,
            "Total_FTE_Clinicians": NaN,
            "Metropolitan_Indicator_Code": "M",
            "Metropolitan_Indicator_Desc": "Metropolitan",
            "Provider_Ratio_Goal": null,
            "Percent_Pop_Below_Poverty": 6.5,
            "HPSA_Score": 0,
            "HPSA_Shortage": NaN,
            "Discipline_Class_Num": 7,
            "Discipline_Class_Desc": "Mental Health",
            "Component_Source_ID": null,
            "Component_Source_Name": "185",
            "Component_Status_Code": "W",
            "Component_Status_Desc": "Withdrawn",
            "Component_Type_Code": "CT",
            "Component_Type_Desc": "Census Tract",
            "Component_State_Abbr": "RI",
            "Component_Postal_Code": null,
            "Component_Designation_Date": "2003-02-20",
            "Component_Designation_Date_String": "2/20/2003",
            "Component_Designation_Last_Update_Date": "2008-08-11",
            "Geography_ID": "44007018500",
            "CountyFIPS": 7,
            "County_Name": "Providence",
            "StateCountyFIPS": "44007",
            "State_FIPS": "44",
            "State_Abbr_2": "RI",
            "State_Name": "Rhode Island",
            "Primary_State_Name": "Rhode Island",
            "Primary_State_FIPS": 44,
            "Primary_HHS_Region_Name": "Region I",
            "US_Mexico_Border_County": "N",
            "US_Mexico_Border_100km": "N",
            "Data_Warehouse_Record_Create_Date": "2019-12-17",
            "Data_Warehouse_Record_Create_Date_Text": "12/17/2019",
            "HPSA_Name": "Northern Rhode Island Catchment Area",
            "HPSA_Component_Name": "185",
            "Break_in_Designation": "N",
            "Geocoding_Primary_X": NaN,
            "Geocoding_Primary_Y": NaN,
            "HPSA_Pop_Type_Code": "TRC",
            "HPSA_Pop_Type_Desc": "Geographic Population",
            "HPSA_Resident_Civilian_Pop": 0,
            "Common_City_Name_with_State_Abbr": null,
            "Common_Postal_Code": null,
            "Common_County_Name": "Providence County, RI",
            "Common_StateCounty_FIPS": "44007",
            "Common_State_Abbr": "RI",
            "Common_State_Name": "Rhode Island",
            "Common_State_FIPS": "44",
            "Common_Region_Name": "Region I",
            "HPSA_Withdrawn_Date": "2008-08-11",
            "HPSA_Withdrawn_Date_String": "8/11/2008",
            "Provider_Type": null,
            "Rural_Status_Code": null,
            "Rural_Status_Desc": null,
            "HPSA_Designation_Pop_Type_Desc": "Geographic Population",
            "BHCMIS_OrgID": null
        },
        {
            "Source_ID": "7449994412",
            "Source_Name": "Northern Rhode Island Catchment Area",
            "Status_Code": "W",
            "Status_Description": "Withdrawn",
            "Type_Code": "Hpsa Geo",
            "Type_Desc": "Geographic HPSA",
            "Address": null,
            "City": null,
            "State_Abbr": "RI",
            "Postal_Code": null,
            "Degree_of_Shortage": "Not applicable",
            "Designation_Date": "2003-02-20",
            "Designation_Last_Update_Date": "2008-08-11",
            "Designation_Pop": 0,
            "Estimated_Underserved_Pop": null,
            "Estimated_Served_Pop": null,
            "Formal_Ratio": null,
            "Total_FTE_Clinicians": NaN,
            "Metropolitan_Indicator_Code": "M",
            "Metropolitan_Indicator_Desc": "Metropolitan",
            "Provider_Ratio_Goal": null,
            "Percent_Pop_Below_Poverty": 6.5,
            "HPSA_Score": 0,
            "HPSA_Shortage": NaN,
            "Discipline_Class_Num": 7,
            "Discipline_Class_Desc": "Mental Health",
            "Component_Source_ID": null,
            "Component_Source_Name": "130.02",
            "Component_Status_Code": "W",
            "Component_Status_Desc": "Withdrawn",
            "Component_Type_Code": "CT",
            "Component_Type_Desc": "Census Tract",
            "Component_State_Abbr": "RI",
            "Component_Postal_Code": null,
            "Component_Designation_Date": "2003-02-20",
            "Component_Designation_Date_String": "2/20/2003",
            "Component_Designation_Last_Update_Date": "2008-08-11",
            "Geography_ID": "44007013002",
            "CountyFIPS": 7,
            "County_Name": "Providence",
            "StateCountyFIPS": "44007",
            "State_FIPS": "44",
            "State_Abbr_2": "RI",
            "State_Name": "Rhode Island",
            "Primary_State_Name": "Rhode Island",
            "Primary_State_FIPS": 44,
            "Primary_HHS_Region_Name": "Region I",
            "US_Mexico_Border_County": "N",
            "US_Mexico_Border_100km": "N",
            "Data_Warehouse_Record_Create_Date": "2019-12-17",
            "Data_Warehouse_Record_Create_Date_Text": "12/17/2019",
            "HPSA_Name": "Northern Rhode Island Catchment Area",
            "HPSA_Component_Name": "130.02",
            "Break_in_Designation": "N",
            "Geocoding_Primary_X": NaN,
            "Geocoding_Primary_Y": NaN,
            "HPSA_Pop_Type_Code": "TRC",
            "HPSA_Pop_Type_Desc": "Geographic Population",
            "HPSA_Resident_Civilian_Pop": 0,
            "Common_City_Name_with_State_Abbr": null,
            "Common_Postal_Code": null,
            "Common_County_Name": "Providence County, RI",
            "Common_StateCounty_FIPS": "44007",
            "Common_State_Abbr": "RI",
            "Common_State_Name": "Rhode Island",
            "Common_State_FIPS": "44",
            "Common_Region_Name": "Region I",
            "HPSA_Withdrawn_Date": "2008-08-11",
            "HPSA_Withdrawn_Date_String": "8/11/2008",
            "Provider_Type": null,
            "Rural_Status_Code": null,
            "Rural_Status_Desc": null,
            "HPSA_Designation_Pop_Type_Desc": "Geographic Population",
            "BHCMIS_OrgID": null
        },
        {
            "Source_ID": "7449994412",
            "Source_Name": "Northern Rhode Island Catchment Area",
            "Status_Code": "W",
            "Status_Description": "Withdrawn",
            "Type_Code": "Hpsa Geo",
            "Type_Desc": "Geographic HPSA",
            "Address": null,
            "City": null,
            "State_Abbr": "RI",
            "Postal_Code": null,
            "Degree_of_Shortage": "Not applicable",
            "Designation_Date": "2003-02-20",
            "Designation_Last_Update_Date": "2008-08-11",
            "Designation_Pop": 0,
            "Estimated_Underserved_Pop": null,
            "Estimated_Served_Pop": null,
            "Formal_Ratio": null,
            "Total_FTE_Clinicians": NaN,
            "Metropolitan_Indicator_Code": "M",
            "Metropolitan_Indicator_Desc": "Metropolitan",
            "Provider_Ratio_Goal": null,
            "Percent_Pop_Below_Poverty": 6.5,
            "HPSA_Score": 0,
            "HPSA_Shortage": NaN,
            "Discipline_Class_Num": 7,
            "Discipline_Class_Desc": "Mental Health",
            "Component_Source_ID": null,
            "Component_Source_Name": "112",
            "Component_Status_Code": "W",
            "Component_Status_Desc": "Withdrawn",
            "Component_Type_Code": "CT",
            "Component_Type_Desc": "Census Tract",
            "Component_State_Abbr": "RI",
            "Component_Postal_Code": null,
            "Component_Designation_Date": "2003-02-20",
            "Component_Designation_Date_String": "2/20/2003",
            "Component_Designation_Last_Update_Date": "2008-08-11",
            "Geography_ID": "44007011200",
            "CountyFIPS": 7,
            "County_Name": "Providence",
            "StateCountyFIPS": "44007",
            "State_FIPS": "44",
            "State_Abbr_2": "RI",
            "State_Name": "Rhode Island",
            "Primary_State_Name": "Rhode Island",
            "Primary_State_FIPS": 44,
            "Primary_HHS_Region_Name": "Region I",
            "US_Mexico_Border_County": "N",
            "US_Mexico_Border_100km": "N",
            "Data_Warehouse_Record_Create_Date": "2019-12-17",
            "Data_Warehouse_Record_Create_Date_Text": "12/17/2019",
            "HPSA_Name": "Northern Rhode Island Catchment Area",
            "HPSA_Component_Name": "112",
            "Break_in_Designation": "N",
            "Geocoding_Primary_X": NaN,
            "Geocoding_Primary_Y": NaN,
            "HPSA_Pop_Type_Code": "TRC",
            "HPSA_Pop_Type_Desc": "Geographic Population",
            "HPSA_Resident_Civilian_Pop": 0,
            "Common_City_Name_with_State_Abbr": null,
            "Common_Postal_Code": null,
            "Common_County_Name": "Providence County, RI",
            "Common_StateCounty_FIPS": "44007",
            "Common_State_Abbr": "RI",
            "Common_State_Name": "Rhode Island",
            "Common_State_FIPS": "44",
            "Common_Region_Name": "Region I",
            "HPSA_Withdrawn_Date": "2008-08-11",
            "HPSA_Withdrawn_Date_String": "8/11/2008",
            "Provider_Type": null,
            "Rural_Status_Code": null,
            "Rural_Status_Desc": null,
            "HPSA_Designation_Pop_Type_Desc": "Geographic Population",
            "BHCMIS_OrgID": null
        }
    ]
}