{
    "table_name": "srrs_clinical_tier2_current",
    "table_fullname": "isb-cgc-bq.HTAN.srrs_clinical_tier2_current",
    "column_names": [
        "Days_to_Progression",
        "Last_Known_Disease_Status",
        "Days_to_Last_Known_Disease_Status",
        "Year_of_Death",
        "Progression_or_Recurrence_Type",
        "Progression_or_Recurrence",
        "Cancer_Incidence_Location",
        "Morphology",
        "Days_to_Progression_Free",
        "Timepoint_Label",
        "Component",
        "Race",
        "Site_of_Resection_or_Biopsy",
        "Stop_Days_from_Index",
        "NCI_Atlas_Cancer_Site",
        "Cancer_Incidence",
        "Progression_or_Recurrence_Anatomic_Site",
        "Days_to_Death",
        "Age_at_Diagnosis",
        "Ethnicity",
        "Cause_of_Death_Source",
        "Treatment_Type",
        "Tumor_Grade",
        "Test_Result",
        "Years_Smoked",
        "Medically_Underserved_Area",
        "Days_to_Follow_Up",
        "Vital_Status",
        "entityId",
        "Primary_Diagnosis",
        "Country_of_Birth",
        "Tumor_Largest_Dimension_Diameter",
        "Medically_Underserved_Score",
        "Gender",
        "Molecular_Analysis_Method",
        "Days_to_Recurrence",
        "HTAN_Participant_ID",
        "Gene_Symbol",
        "Start_Days_from_Index",
        "Pack_Years_Smoked",
        "Tissue_or_Organ_of_Origin",
        "Days_to_Last_Follow_up",
        "Id",
        "Education_Level",
        "Cause_of_Death",
        "Rural_vs_Urban",
        "HTAN_Center",
        "Manifest_Id",
        "Manifest_Version"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64"
    ],
    "nested_column_names": [
        "Days_to_Progression",
        "Last_Known_Disease_Status",
        "Days_to_Last_Known_Disease_Status",
        "Year_of_Death",
        "Progression_or_Recurrence_Type",
        "Progression_or_Recurrence",
        "Cancer_Incidence_Location",
        "Morphology",
        "Days_to_Progression_Free",
        "Timepoint_Label",
        "Component",
        "Race",
        "Site_of_Resection_or_Biopsy",
        "Stop_Days_from_Index",
        "NCI_Atlas_Cancer_Site",
        "Cancer_Incidence",
        "Progression_or_Recurrence_Anatomic_Site",
        "Days_to_Death",
        "Age_at_Diagnosis",
        "Ethnicity",
        "Cause_of_Death_Source",
        "Treatment_Type",
        "Tumor_Grade",
        "Test_Result",
        "Years_Smoked",
        "Medically_Underserved_Area",
        "Days_to_Follow_Up",
        "Vital_Status",
        "entityId",
        "Primary_Diagnosis",
        "Country_of_Birth",
        "Tumor_Largest_Dimension_Diameter",
        "Medically_Underserved_Score",
        "Gender",
        "Molecular_Analysis_Method",
        "Days_to_Recurrence",
        "HTAN_Participant_ID",
        "Gene_Symbol",
        "Start_Days_from_Index",
        "Pack_Years_Smoked",
        "Tissue_or_Organ_of_Origin",
        "Days_to_Last_Follow_up",
        "Id",
        "Education_Level",
        "Cause_of_Death",
        "Rural_vs_Urban",
        "HTAN_Center",
        "Manifest_Id",
        "Manifest_Version"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64"
    ],
    "description": [
        "Number of days between the date used for index and the date the patient's disease progressed. If not applicable please enter 'Not Applicable'",
        "Text term that describes the last known state or condition of an individual's neoplasm.",
        "Time interval from the date of last follow up to the date of initial pathologic diagnosis, represented as a calculated number of days. If not applicable please enter 'Not Applicable'",
        "Numeric value to represent the year of the death of an individual.",
        "The text term used to describe the type of progressive or recurrent disease or relapsed disease.",
        "Yes/No/unknown indicator to identify whether a patient has had a new tumor event after initial treatment.",
        "The county and state in which the patient lives and to which the cancer_incidence data correlates. Record as \"County, State\" as they appear in the incidence box from which the cancer_incidence data is obtained in the https://gis.cancer.gov/canceratlas/tableview/ website",
        "The third edition of the International Classification of Diseases for Oncology, published in 2000 used principally in tumor and cancer registries for coding the site (topography) and the histology (morphology) of neoplasms. The study of the structure of the cells and their arrangement to constitute tissues and, finally, the association among these to form organs. In pathology, the microscopic process of identifying normal and abnormal morphologic characteristics in tissues, by employing various cytochemical and immunocytochemical stains. A system of numbered categories for representation of data.",
        "Number of days between the date used for index and the date the patient's disease was formally confirmed as progression-free. If not applicable please enter 'Not Applicable'",
        "Label to identify the time point at which the clinical data or biospecimen was obtained (e.g. Baseline, End of Treatment, Overall survival, Final). NO PHI/PII INFORMATION IS ALLOWED.",
        "Category of metadata (e.g. Diagnosis, Biospecimen, scRNA-seq Level 1, etc.); provide the same one for all items/rows.",
        "An arbitrary classification of a taxonomic group that is a division of a species. It usually arises as a consequence of geographical isolation withina a species and is characterized by shared heredity, physical attributes and behavior, and in the case of humans, by common history, nationality, or geographic distribution.",
        "The text term used to describe the anatomic site of the resection or biopsy of the patient's malignant disease, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O).",
        "Number of days from the date of birth (index date) to the end date of the event (e.g. exposure to environmental factor, treatment start, etc.). Note: if the event occurs at a single time point, e.g. a diagnosis or a lab test, the values for this column is 'Not Applicable'",
        "The primary tumor site used to calculate the incidence rate using the NCI Cancer Atlas, a digital atlas which provides geographical data related to cancer utilizing the Surveillance, Epidemiology, and End Results (SEER) Program cancer incidence rates for 2013 to 2017",
        "Incidence of specific cancer type in a defined area (a number between 0 and 100). The rate of incident cases per population of 100,000 persons of a specific type of cancer as designated in the \"primary_diagnosis\" data element in the county where the patient resides, using the most recent 2013-2017 NCI Cancer Atlas derived data.  Use patient zip code to find the county the patient lives in by going to https://www.unitedstateszipcodes.org/. Enter the zip code in the main text field and use the asociated county on the right side of the result field. On the https://gis.cancer.gov/canceratlas/tableview/ website, choose \"Incidence\" from the Topic dropdown menu, state of interest from the Area menu, \"All Races\" from the Race menu, and the cancer type (\"Both Sexes\" when possible) from the Statistic menu. Find the county of interest and enter the numeric Age-Adjusted Rate per 100,000 as the value.",
        "The text term used to describe the anatomic site of resection; biopsy; tissue or organ of biospecimen origin; progression or recurrent disease; treatment",
        "Number of days between the date used for index and the date from a person's date of death represented as a calculated number of days. If not applicable please enter 'Not Applicable'",
        "Age at the time of diagnosis expressed in number of days since birth.",
        "An individual's self-described social and cultural grouping, specifically whether an individual describes themselves as Hispanic or Latino. The provided values are based on the categories defined by the U.S. Office of Management and Business and used by the U.S. Census Bureau.",
        "The text term used to describe the source used to determine the patient's cause of death.",
        "Text term that describes the kind of treatment administered.",
        "Numeric value to express the degree of abnormality of cancer cells, a measure of differentiation and aggressiveness.",
        "The text term used to describe the result of the molecular test. If the test result was a numeric value see test_value. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Numeric value (or unknown) to represent the number of years a person has been smoking.",
        "Areas or populations designated by HRSA as having too few primary care providers, high infant mortality, high poverty or a high elderly population:  Use patient zip code to find the county the patient lives in by going to https://www.unitedstateszipcodes.org/ - enter the zip code in the main text field and use the associated county on the right side of the result field. Go to data.hrsa.gov website and select \"Query Data\". Pick the Medically Underserved Areas/Populations (MUA/P) data source in the step 1 menu and select \"View Data\". Enter the name of the county (_______ county) in the first \"Service Area\" column, adding the state in the 5th column may help direct you to the data.  If the designation type in the third column is \"medically underserved area\" enter \"Yes\" as the value. If the county generates a \"No data available in table\" enter \"No\" as the value.  A value of \"Unknown\" indicates that sufficient data was not available to look up the value.  If value is yes, complete the Medically_underserved_score d",
        "Number of days between the date used for index and the date of the patient's last follow-up appointment or contact. If not applicable please enter 'Not Applicable'",
        "The survival state of the person registered on the protocol.",
        "Synapse ID of entity",
        "Text term used to describe the patient's histologic diagnosis, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O).",
        "Country where the patient was born.",
        "Numeric value used to describe the maximum diameter or dimension of the primary tumor, measured in centimeters.",
        "Index of Medical Underservice (IMU) score, a number between 0 and 100, where 0 represents completely underserved and 100 represents best served or least underserved. Use patient zip code to find the county the patient lives in by going to https://www.unitedstateszipcodes.org/. Enter the zip code in the main text field and use the asociated county on the right side of the result field. Go to data.hrsa.gov website and select Query Data. Pick the Medically Underserved Areas/Populations (MUA/P) data source in the step 1 menu and select View Data. Enter the name of the county (______ county) in the first \"Service Area\" column, adding the state in the 5th column may help direct you to the data. Enter the Index of Medical Underservice Score in the fourth column to one decimal place as the value.",
        "Text designations that identify gender. Gender is described as the assemblage of properties that distinguish people on the basis of their societal roles. [Identification of gender is based upon self-report and may come from a form, questionnaire, interview, etc.]",
        "The text term used to describe the method used for molecular analysis. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Number of days between the date used for index and the date the patient's disease recurred. If not applicable please enter 'Not Applicable'",
        "HTAN ID associated with a patient based on HTAN ID SOP (eg HTANx_yyy )",
        "The text term used to describe a gene targeted or included in molecular analysis. For rearrangements, this is should be used to represent the reference gene. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Number of days from the date of birth (index date) to the date of an event (e.g. exposure to environmental factor, treatment start, etc.). If not applicable please enter 'Not Applicable'",
        "Numeric computed value to represent lifetime tobacco exposure defined as number of cigarettes smoked per day x number of years smoked divided by 20.",
        "The text term used to describe the anatomic site of origin, of the patient's malignant disease, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O).",
        "Time interval from the date of last follow up to the date of initial pathologic diagnosis, represented as a calculated number of days. If not applicable please enter 'Not Applicable'",
        "Unique identifier of entity e.g. a96059eb-81af-4b24-ae50-9242c0d8f819",
        "Highest level of education that the patient completed (direct patient-derived information)",
        "The cause of death",
        "Density of population in the county of residence, based on census data (updated last on 4/28/20). Use patient zip code to find the county the patient lives in by going to https://www.unitedstateszipcodes.org/. Enter the zip code in the main text field and use the associated county on the right side of the result field. Go to https://www2.census.gov/programs-surveys/acs/data/covid_19/Data_Profiles_for_HHS/050-County_By_State/. Select the dp02_XX.csv file where XX = the two letter abbreviation for the appropriate state. On row 166 find the total population for the appropriate county.  If the total population is <2,500 enter a value of \"Rural Population\"; if 2,500 - 50,000 enter a value of \"Urban Cluster\"; or if >50,000 enter \"Urban Population\"",
        "Name of HTAN Center e.g. HTAN HTAPP",
        "Synapse ID of manifest containing file annotation",
        "Latest version of metadata manifest"
    ],
    "sample_rows": [
        {
            "Days_to_Progression": null,
            "Last_Known_Disease_Status": "With tumor",
            "Days_to_Last_Known_Disease_Status": "388",
            "Year_of_Death": "2023.0",
            "Progression_or_Recurrence_Type": null,
            "Progression_or_Recurrence": "No",
            "Cancer_Incidence_Location": "Douglas, Colorado",
            "Morphology": "2244842",
            "Days_to_Progression_Free": null,
            "Timepoint_Label": "Baseline",
            "Component": "SRRSClinicalDataTier2",
            "Race": "white",
            "Site_of_Resection_or_Biopsy": "Lower lobe lung",
            "Stop_Days_from_Index": null,
            "NCI_Atlas_Cancer_Site": null,
            "Cancer_Incidence": "35.8",
            "Progression_or_Recurrence_Anatomic_Site": null,
            "Days_to_Death": "27251.0",
            "Age_at_Diagnosis": "26843",
            "Ethnicity": "not hispanic or latino",
            "Cause_of_Death_Source": null,
            "Treatment_Type": "Surgery, Chemotherapy",
            "Tumor_Grade": "Not Reported",
            "Test_Result": "Negative",
            "Years_Smoked": "15",
            "Medically_Underserved_Area": "Medically Underserved Area - No",
            "Days_to_Follow_Up": "27230",
            "Vital_Status": "Dead",
            "entityId": null,
            "Primary_Diagnosis": "Non-small cell carcinoma",
            "Country_of_Birth": null,
            "Tumor_Largest_Dimension_Diameter": "4.5cm",
            "Medically_Underserved_Score": "60.8",
            "Gender": "male",
            "Molecular_Analysis_Method": "IHC",
            "Days_to_Recurrence": "Not Applicable",
            "HTAN_Participant_ID": "HTA15_30007",
            "Gene_Symbol": "EGFR, KRAS, ALK",
            "Start_Days_from_Index": "26862",
            "Pack_Years_Smoked": "7.5",
            "Tissue_or_Organ_of_Origin": "Lower lobe lung",
            "Days_to_Last_Follow_up": "388",
            "Id": "0766b753-2390-4231-989c-3e161aff5dac",
            "Education_Level": "Data not available",
            "Cause_of_Death": "unknown",
            "Rural_vs_Urban": "Urban Population (population >50000)",
            "HTAN_Center": "HTAN SRRS",
            "Manifest_Id": "syn51607133",
            "Manifest_Version": 2
        },
        {
            "Days_to_Progression": null,
            "Last_Known_Disease_Status": "unknown tumor status",
            "Days_to_Last_Known_Disease_Status": "161",
            "Year_of_Death": "2023.0",
            "Progression_or_Recurrence_Type": "unknown",
            "Progression_or_Recurrence": "unknown",
            "Cancer_Incidence_Location": "Archuleta, Colorado",
            "Morphology": "2253973",
            "Days_to_Progression_Free": null,
            "Timepoint_Label": "Baseline",
            "Component": "SRRSClinicalDataTier2",
            "Race": "white",
            "Site_of_Resection_or_Biopsy": "Lower lobe lung",
            "Stop_Days_from_Index": null,
            "NCI_Atlas_Cancer_Site": null,
            "Cancer_Incidence": "31.9",
            "Progression_or_Recurrence_Anatomic_Site": "unknown",
            "Days_to_Death": "25108.0",
            "Age_at_Diagnosis": "23882",
            "Ethnicity": "not hispanic or latino",
            "Cause_of_Death_Source": null,
            "Treatment_Type": "Surgery",
            "Tumor_Grade": "G2",
            "Test_Result": "Not Applicable",
            "Years_Smoked": "50",
            "Medically_Underserved_Area": "Medically Underserved Area - Yes",
            "Days_to_Follow_Up": "24042",
            "Vital_Status": "Dead",
            "entityId": null,
            "Primary_Diagnosis": "Squamous cell carcinoma NOS",
            "Country_of_Birth": null,
            "Tumor_Largest_Dimension_Diameter": "3.4cm",
            "Medically_Underserved_Score": "50.1",
            "Gender": "male",
            "Molecular_Analysis_Method": "Not Applicable",
            "Days_to_Recurrence": "Not Applicable",
            "HTAN_Participant_ID": "HTA15_30001",
            "Gene_Symbol": "Not Applicable",
            "Start_Days_from_Index": "24028",
            "Pack_Years_Smoked": "100",
            "Tissue_or_Organ_of_Origin": "Lower lobe lung",
            "Days_to_Last_Follow_up": "161",
            "Id": "881485f9-4678-42d8-8e1b-f256372b9b8d",
            "Education_Level": "Data not available",
            "Cause_of_Death": "unknown",
            "Rural_vs_Urban": "Urban Cluster (population 2500 - 50000)",
            "HTAN_Center": "HTAN SRRS",
            "Manifest_Id": "syn51607133",
            "Manifest_Version": 2
        },
        {
            "Days_to_Progression": null,
            "Last_Known_Disease_Status": "Tumor free",
            "Days_to_Last_Known_Disease_Status": "659",
            "Year_of_Death": null,
            "Progression_or_Recurrence_Type": null,
            "Progression_or_Recurrence": "No",
            "Cancer_Incidence_Location": "Arapahoe, Colorado",
            "Morphology": "2253608",
            "Days_to_Progression_Free": null,
            "Timepoint_Label": "Baseline",
            "Component": "SRRSClinicalDataTier2",
            "Race": "black or african american",
            "Site_of_Resection_or_Biopsy": "Upper lobe lung",
            "Stop_Days_from_Index": null,
            "NCI_Atlas_Cancer_Site": null,
            "Cancer_Incidence": "45.1",
            "Progression_or_Recurrence_Anatomic_Site": null,
            "Days_to_Death": null,
            "Age_at_Diagnosis": "24639",
            "Ethnicity": "not hispanic or latino",
            "Cause_of_Death_Source": null,
            "Treatment_Type": "Surgery",
            "Tumor_Grade": "G1",
            "Test_Result": "Not Applicable",
            "Years_Smoked": "35",
            "Medically_Underserved_Area": "Medically Underserved Area - Yes",
            "Days_to_Follow_Up": "25297",
            "Vital_Status": "Alive",
            "entityId": null,
            "Primary_Diagnosis": "Squamous cell carcinoma NOS",
            "Country_of_Birth": null,
            "Tumor_Largest_Dimension_Diameter": "1.6cm",
            "Medically_Underserved_Score": "58.1",
            "Gender": "female",
            "Molecular_Analysis_Method": "Not Reported",
            "Days_to_Recurrence": "Not Applicable",
            "HTAN_Participant_ID": "HTA15_30002",
            "Gene_Symbol": "Not Applicable",
            "Start_Days_from_Index": "24685",
            "Pack_Years_Smoked": "17.5",
            "Tissue_or_Organ_of_Origin": "Upper lobe lung",
            "Days_to_Last_Follow_up": "659",
            "Id": "09f16c0f-b20a-48d7-8281-b48a1a45cd1e",
            "Education_Level": "Data not available",
            "Cause_of_Death": "Not Applicable",
            "Rural_vs_Urban": "Urban Population (population >50000)",
            "HTAN_Center": "HTAN SRRS",
            "Manifest_Id": "syn51607133",
            "Manifest_Version": 2
        },
        {
            "Days_to_Progression": null,
            "Last_Known_Disease_Status": "unknown tumor status",
            "Days_to_Last_Known_Disease_Status": "68",
            "Year_of_Death": null,
            "Progression_or_Recurrence_Type": "unknown",
            "Progression_or_Recurrence": "unknown",
            "Cancer_Incidence_Location": "Adams, Colorado",
            "Morphology": "2254339",
            "Days_to_Progression_Free": null,
            "Timepoint_Label": "Baseline",
            "Component": "SRRSClinicalDataTier2",
            "Race": "white",
            "Site_of_Resection_or_Biopsy": "Upper lobe lung",
            "Stop_Days_from_Index": null,
            "NCI_Atlas_Cancer_Site": null,
            "Cancer_Incidence": "51.5",
            "Progression_or_Recurrence_Anatomic_Site": "unknown",
            "Days_to_Death": null,
            "Age_at_Diagnosis": "21238",
            "Ethnicity": "not hispanic or latino",
            "Cause_of_Death_Source": null,
            "Treatment_Type": "Surgery",
            "Tumor_Grade": "G3",
            "Test_Result": "Positive",
            "Years_Smoked": "30",
            "Medically_Underserved_Area": "Medically Underserved Area - Yes",
            "Days_to_Follow_Up": "21305",
            "Vital_Status": "Alive",
            "entityId": null,
            "Primary_Diagnosis": "Squamous cell carcinoma NOS",
            "Country_of_Birth": null,
            "Tumor_Largest_Dimension_Diameter": "2.5cm",
            "Medically_Underserved_Score": "57.1",
            "Gender": "male",
            "Molecular_Analysis_Method": "IHC",
            "Days_to_Recurrence": "Not Applicable",
            "HTAN_Participant_ID": "HTA15_30005",
            "Gene_Symbol": "EGFR, KRAS, BRAF, ERBB2, MET, TP53",
            "Start_Days_from_Index": "21277",
            "Pack_Years_Smoked": "Not Reported",
            "Tissue_or_Organ_of_Origin": "Upper lobe lung",
            "Days_to_Last_Follow_up": "68",
            "Id": "672737a2-dcd1-4768-8cb6-822131c904b5",
            "Education_Level": "Data not available",
            "Cause_of_Death": "Not Applicable",
            "Rural_vs_Urban": "Urban Population (population >50000)",
            "HTAN_Center": "HTAN SRRS",
            "Manifest_Id": "syn51607133",
            "Manifest_Version": 2
        },
        {
            "Days_to_Progression": null,
            "Last_Known_Disease_Status": "With tumor",
            "Days_to_Last_Known_Disease_Status": "168",
            "Year_of_Death": null,
            "Progression_or_Recurrence_Type": null,
            "Progression_or_Recurrence": "No",
            "Cancer_Incidence_Location": "Middlesex, Massachusetts",
            "Morphology": "8140/3",
            "Days_to_Progression_Free": null,
            "Timepoint_Label": "Baseline",
            "Component": "SRRSClinicalDataTier2",
            "Race": "white",
            "Site_of_Resection_or_Biopsy": "Rectosigmoid junction",
            "Stop_Days_from_Index": null,
            "NCI_Atlas_Cancer_Site": null,
            "Cancer_Incidence": "34.6",
            "Progression_or_Recurrence_Anatomic_Site": null,
            "Days_to_Death": null,
            "Age_at_Diagnosis": "22199",
            "Ethnicity": "not hispanic or latino",
            "Cause_of_Death_Source": null,
            "Treatment_Type": "Surgery",
            "Tumor_Grade": "G2",
            "Test_Result": "Normal",
            "Years_Smoked": "0",
            "Medically_Underserved_Area": "Medically Underserved Area - Yes",
            "Days_to_Follow_Up": "22367",
            "Vital_Status": "Alive",
            "entityId": null,
            "Primary_Diagnosis": "Adenocarcinoma NOS",
            "Country_of_Birth": null,
            "Tumor_Largest_Dimension_Diameter": "6.2cm",
            "Medically_Underserved_Score": "61.9",
            "Gender": "male",
            "Molecular_Analysis_Method": "IHC",
            "Days_to_Recurrence": "0",
            "HTAN_Participant_ID": "HTA15_51833",
            "Gene_Symbol": "MLH1, MSH2, MSH6, PMS2",
            "Start_Days_from_Index": "22215",
            "Pack_Years_Smoked": "0",
            "Tissue_or_Organ_of_Origin": "Colon NOS",
            "Days_to_Last_Follow_up": "168",
            "Id": "a86d2eec-385e-4fab-9367-fb0fcc9bd251",
            "Education_Level": "Data not available",
            "Cause_of_Death": "Not Applicable",
            "Rural_vs_Urban": "Urban Population (population >50000)",
            "HTAN_Center": "HTAN SRRS",
            "Manifest_Id": "syn52799106",
            "Manifest_Version": 4
        }
    ]
}