{
    "sample_rows": [
        {
            "CONTRACT_AWARD_ID": "W911W6-22-P-0005",
            "CONTRACT_SOLICITATION_ID": "MZ-JandA22-1144",
            "AWARD_NAME": "Fortus 450MC Gen II System",
            "AWARD_DESCRIPTION": "Army Contract Command - Redstone Arsenal, Technology Development Directorate - Aviation, located in Fort Eustis, Virginia, intends to solicit orally and award a Firm Fixed Price purchase order on a sole source basis to TriMech Solutions, LLC, located at 4991 Lake Brook Dr Ste 300, Glen Allen, VA 23060-9293,  for a Stratasys 450 MC 3-D Printer purchase.  The anticipated award date is 31 May 2022.  This notice of intent is not a request for competitive quotes. All responsible sources may submit a bid, proposal or quotation, which shall be considered by the agency; however, a determination by the Government not to compete this proposed purchase order based upon responses to this notice is solely within the discretion of the Government. The Government intends to solicit and negotiate with only one source under the authority of FAR 13.106(b)(1) Soliciting from a Single Source. A justification to not compete this acquisition has been properly executed and is included with this notice. The justification addresses the requirements of FAR 5.207(c)(15), reason for lack of competition. The NAICS Code for this requirement is 333249 and the associated size standard is 500.  The PSC is 3695.  If your firm possesses the ability to meet this requirement, then you must respond by demonstrating your firm's technical capability to meet these requirements no later than 12:00 Noon EST on 31 May 2022 to Deanna Van Cleaf, email deanna.c.vancleaf.civ@army.mil and Bethany Rosser, email bethany.r.rosser.civ.army.mil.   Purchase Order was awarded on a sole source basis.",
            "AWARD_AMOUNT": 107975.0,
            "AWARD_DATE": "2022-05-31",
            "RECIPIENT": "Trimech Solutions, Llc Va  Usa",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        },
        {
            "CONTRACT_AWARD_ID": "W912DW-05-D-1027 TO 2164",
            "CONTRACT_SOLICITATION_ID": "W912DW05D1027TBD",
            "AWARD_NAME": "RECOVERY--Y--PROJECT NUMBER 32213, Flagship Construct Showers in Latrine Areas, 3-2 SBCT, 3651, BN Headquarters, PROJECT NUMBER 33051, Flagship Construct Showers in Latrine Areas, 3-2 SBCT, 3734, BN Headquarters",
            "AWARD_DESCRIPTION": "RECOVERY PER FAR 5.7 THIS NOTICE IS PROVIDED FOR INFORMATION PURPOSES ONLY; THEREFORE FAR 5.203 DOES NOT APPLY. THIS OPPORTUNITY IS AVAILABLE ONLY TO THE CONTRACTOR UNDER THE CURRENT CONTRACT NUMBER: Centennial Contractors Enterprises, Inc, W912DW-05-D-1027. Program Name: Job Order Contract in Support of Fort Lewis Public Works and Other Customers Supported by Seattle District Corps of Engineers RECOVERY -- PROJECT NUMBER 32213, Flagship Construct Showers in Latrine Areas, 3-2 SBCT, 3651 BN Headquarters and RECOVERY -- PROJECT NUMBER 33051, Flagship Construct Showers in Latrine Areas, 3-2 SBCT, 3734 BN Headquarters This is an order under an existing contract that was awarded using competitive procedures. Under this Task Order (for project number 32213), the contractor shall renovate Room 123 (mens restroom) and 126 (womens restroom), and the latrine area room C30 (womens restroom) and C27 (mens restroom), at Building 3651, Fort Lewis, Washington. The contractor shall construct one shower stall in the womens restroom (room 126) and three shower stalls in the mens restroom (room 123). The project scope consists of demolishing southern and western walls of Room 124 and demolishing two lavatories mounted on northern walls of the mens restroom. Any fire alarms, electrical and communication devices and their respective conduits will also need to be demolished. New installation includes: installing fiberglass shower stalls; shower heads; shower valves for each stall; new, recessed, wet location rated fixture above each shower stall; appropriately sized exhaust register above the new shower stall in room 126. A plumbing layout will need to be developed for the new shower stalls. The water heating system will need to be upgraded to support the maximum demand for hot water in building 3651. Restore all areas affected by the construction of the new shower stalls. This work will take place at building 3651, Fort Lewis, Washington. Under this Task Order (for project number 33051), the contractor shall renovate Room C27 (mens restroom) and C30 (womens restroom), at Building 3734, Fort Lewis, Washington. The contractor shall construct one shower stall in the womens restroom (room C30) by taking the area of the existing janitors closet (room C29) and three shower stalls in the mens restroom (room C27). The project scope consists of demolishing ceilings above the shower room located in room C27; demolishing lighting fixtures, shower head, shower faucet and floor drain in the existing shower room. Demolish existing western wall portions of the southern wall, door and all electrical devices/appurtenances in Room C29. New installation includes: shower head; shower valve; soap holder; towel hook and shower curtain for each of the stalls; and two new, surface mount, wet location rated fixture above the three shower stalls. A plumbing layout will need to be developed for the new shower stalls. The water heating system will need to be upgraded to support the maximum demand for hot water in building 3734. Restore all areas affected by the construction of the new shower stalls. This work will take place at building 3734, Fort Lewis, Washington. Magnitude of Construction for both projects is $25K - $100K and the completion period is estimated at 120 calendar days. The NAICS code for this project is 236220. One or more of the items under this acquisition is subject to the World Trade Organization Government Procurement Agreement and Free Trade Agreements. RECOVERY - PER FAR 5.7 THIS NOTICE IS PROVIDED FOR INFORMATION PURPOSES ONLY; THEREFORE FAR 5.203 DOES NOT APPLY. THIS OPPORTUNITY WAS AVAILABLE ONLY TO CONTRACTOR(S) UNDER THE CURRENT CONTRACT NUMBER(S): Centennial Contractors Enterprises, W912DW-05-D-1027 TO 2164 This award notice is for a task order that was issued under an existing Job Order Contract (JOC) Indefinite-Delivery Type Contract which was awarded using competitive procedures. The projects provide for renovations to construct showers in latrine areas at 3651 and 3734 BN Headquarters located on Ft. Lewis, Washington. The NAICS code for this requirement is 236220.",
            "AWARD_AMOUNT": 113723.33,
            "AWARD_DATE": "2010-03-05",
            "RECIPIENT": "Centennial Contractors Enterprises, Inc.  11111 Sunset Hills Rd, Ste 350 Reston, Va",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        },
        {
            "CONTRACT_AWARD_ID": "N00164-05-D-6412",
            "CONTRACT_SOLICITATION_ID": "N0016405R6412",
            "AWARD_NAME": "58--Inertial Navigation Units",
            "AWARD_DESCRIPTION": "N00164-05-R-6412 INERTIAL NAVIGATION UNITS -FSG 58 - NAICS 334511 Issue Date 24 May 2005 - Closing Date 07 June 2005 \u0096 2:00 PM EST This synopsis is being posted to both the Federal Business Opportunities (FBO) page located at http://www.eps.gov and the Navy Electronic Commerce on Line (NECO) site located at http://www.neco.navy.mil. While it is understood that FBO is the single point of entry for posting of synopsis and solicitations to the Internet, NECO is the alternative in case FBO is unavailable. Please feel free to use either site to access information posted by NSWC Crane. This is a combined synopsis/solicitation for commercial items prepared in accordance with the format in FAR 12.6, as supplemented with additional information included in this notice. This announcement constitutes the only solicitation; proposals are being requested and a written solicitation will not be issued. Solicitation Number N00164-05-R-6412 is hereby issued as a Request for Proposal (RFP). Incorporated provisions and clauses are those in effect through Federal Acquisition Circular 2001-27 as well as DCN 20050222. The North American Industry Classification System (NAICS) Code for this procurement is 334511 and the size standard is 750 employees. This procurement will utilize full & open competition. This requirement is for the following: CLIN 0001 \u0096 Base INU without integrated GPS (IAW attached salient characteristics), CLIN 0002 \u0096 Base INU with integrated GPS (IAW attached salient characteristics), CLIN 0003 \u0096 *Improved Azimuth Performance INU without integrated GPS (IAW attached salient characteristics), CLIN 0004 \u0096 *Improved Azimuth Performance INU with integrated GPS (IAW attached salient characteristics). *Note: Improved azimuth means that the maximum azimuth error is 2 mils instead of 5 mils. The minimum and maximum quantities for CLIN 0001 & CLIN 0002 combined are min = 1 each, max = 50 each. The minimum and maximum quantities for CLIN 0003 & CLIN 0004 combined are min = 0 each, max = 50 each. Offerors are required to propose any applicable quantity price breaks. Delivery is required F.O.B. destination (NSWC Crane, 47522). The Government required delivery date (RDD) for the first INU is 1 Aug 2005. For the remainder of the IDIQ contract, delivery for mate! rials shall be either 45 days after order (for small quantities of less than or equal to 5 units) or 180 days after order (for large quantities of greater than 5 units). Final inspection & acceptance will occur at NSWC Crane. Selection for award will be based on past performance and price. The offeror shall demonstrate past performance through completion of the \"Contractor Performance Data Sheet (Found at www.crane.navy.mil/supply/homepage.htm)\". The Contractor Performance Data Sheet shall be completed in its entirety. Additionally, offerors are urged to submit brief and concise responses, within the confines of the space allotted. Failure to submit the completed Contractor Performance Data Sheet (along with the proposal) shall be considered certification (by signature on the proposal) that the contractor has no past performance for like or similar items for the Government to evaluate. Offers that are non-compliant with any material requirement of this solicitation (i! ncluding technical conformance) may be rejected without further consideration for award. This will be an indefinite delivery-indefinite quantity (IDIQ) firm-fixed price contract and will be awarded utilizing Simplified Acquisition Procedures. The contractor shall extend to the Government the full coverage of commercial sale warranty provided such warranty is available at no additional cost to the Government. Clauses/provisions: 52.211-14 (DO); 52.211-15; 52.212-1; 52.212-3 Alt 1 [FILL-IN] (NOTE: paragraph (b) of 52.212-3 is not applicable; NOTE: This provision MUST be filled out completely and submitted with the offer); 52.212-4; 52-212-5 (incorporating 52.219-8; 52.219-9; 52.222-3; 52.222-19; 52.222-21; 52.222-26; 52.222-35; 52.222-36; 52.222-37; 52.225-13; 52.232-33); 52.215-05 (fax #812-854-3465); 52.242-15; 252.204-7004 Alt A; 252.212-7000 (NOTE: This provision MUST be filled out completely and submitted with the offer); 252.212-7001 (incorporating 52.203-3; 252.225-7001; 252.225-7012; 252.243-7002; 252.247-7023). The offeror shall provide its Commercial and Government Entity (CAGE) Code, Data Universal Numbering System (DUNS) number and Tax Identification Number (TINs). Addendum to 52.212-4(g): The Contractor shall include, as a minimum, the following information on each invoice: (1) Name and address of the Contractor; (2) Invoice number and date and shall be marked \u0093Origin! al Invoice\u0094; (3) Contract number, contract line item number and, if applicable, the order number; (4) Description, quantity, unit of measure, unit price and extended price of the items delivered or services performed and an invoice total; (5) Shipping number and date of shipment including the bill of lading number and weight of shipment if shipped on Government bill of lading; (6) Terms of any prompt payment discount offered; (7) Name and address of official to whom payment is to be sent; and (8) Name, title, and phone number of person to be notified in event of defective invoice. Invoices will be handled in accordance with the Prompt Payment Act (31 U.S.C. 3903) and Office of Management and Budget (OMB) Circular A 125, Prompt Payment. Contractors are encouraged to assign an identification number to each invoice. MAIL INVOICES TO: Vendor Pay, Code 00M, Bldg 3173, NSWC CRANE, 300 Highway 361, Crane IN 47522-5002. PAYMENT STATUS INQUIRIES-Status of invoice payments can be obta! ined from the following web site: www.dfas.mil/money/vendor If the payment is being made by DFAS-Columbus use the MOCAS Vendor Pay Inquiry System (VPIS) site listed on the above web site. It is recommended that the vendor download the \u0093MOCAS VPIS Help Guide\u0094 and \u0093Reason and Remark Code Document\u0094. You must then register by clicking on \u0093User Registration\u0094 under the subheading \u0093MOCAS Vendor Pay Inquiry System\u0094 before payment inquiries can be made. If payment is being made by other than DFAS-Columbus, status of invoice payment can be obtained through the Non-MOCAS System by cage code, contract number or DUNS number at the above listed web site. To determine which system to use see the following blocks of your contract document for payment offices designation: SF 26 Award/Contract-Blk 12; SF 33 Award/Contract-Blk 25; SF 1449 Solicitation/Contract/Order for Commercial Items-Blk 18a; DD1155 Order for Supplies or Services-Blk 15. ADDITIONAL MARKING INSTRUCTIONS-In addition to any o! ther marking instructions in this order, it is essential that all packages be accompanied by packing slips (preferably a DD 250) and all packing slips be located on the outside of the box or container and that all packages, shipping papers, and invoices be marked with the following information to permit effective receipt processing and timely payment: 1) Order Number; 2) Contract Line Item Numbers. The foregoing requirements must be passed on to any organization entity originating a shipment as a deliverable under this order. Caution: Any packages received, which are not marked in accordance with the above requirements, may be refused and returned to the contractor at the contractor's expense. BUSINESS HOURS-NSWC Crane allows flexible working hours for its employees. The normal eight hour shift may be worked between the hours of 6:30 AM and 5:30 PM EST. Many of our employees work 6:30 AM to 3:00 PM as a regular practice. The core time, when all employees are scheduled to wor! k, is 9:00 AM to 3:00 PM. All changes to the requirement that occur prior to the closing date will be posted to Crane web site, FedBizOpps and NECO. It is the responsibility of interested vendors to monitor the Crane web site, FedBizOpps and/or NECO for amendments that may be issued to this solicitation. For changes made after the closing date, only those offerors that provide a proposal will be provided any changes/amendments and considered for future discussions and/or award. All responsible sources may submit an offer, which will be considered by the agency. Offers may be faxed to 812-854-3465 or e-mailed to peter.riegler@navy.mil. All required information must be received on or before 07 June 2005 @ 2:00 PM Eastern Standard Time. Our mission is to provide quality and responsive acquisition services for this Command. In an effort to continue to improve our services, we are conducting a survey of our vendors. This survey may be found on the World Wide Web at: http://www.c! rane.navy.mil/supply/VendorSurvey.htm. Your comments will help us determine if we are accomplishing this and show us ways to improve our processes. Please consider taking the time to complete the survey. There is a new Federal Integrated Acquisition Environment (IAE) initiative called the Online Representations and Certifications Application (ORCA). ORCA is a web-based system that centralizes and standardizes the collection, storage and viewing of many of the representations and certifications required by the Federal Acquisition Regulations and previously found in solicitations. According to the language included in FAR Case 2001-026, vendors are required to use ORCA beginning 1 January 2005. Detailed information can be found in the FAR Case, as well as by visiting the Help section of the website at http://orca.bpn.gov. The help section includes ORCA background information, frequently asked questions (FAQ), the ORCA Handbook, and whom to call for assistance.",
            "AWARD_AMOUNT": 1212996.0,
            "AWARD_DATE": "2005-08-23",
            "RECIPIENT": "Smiths Aerospace, Inc.",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        },
        {
            "CONTRACT_AWARD_ID": "SPE7M018V5995",
            "CONTRACT_SOLICITATION_ID": "SPE7M518U0190",
            "AWARD_NAME": "59--EXTENDER CARD,ELECT",
            "AWARD_DESCRIPTION": "Proposed procurement for NSN 5998013841683 EXTENDER CARD,ELECT: Line 0001 Qty 23.00 UI EA Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0157 DAYS ADOApproved sources are 05584 A11630; 3B150 11469774; 54X10 11469774. The solicitation is an RFQ and will be available at the link provided in this notice. Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available. All responsible sources may submit a quote which, if timely received, shall be considered. Quotes may be submitted electronically.",
            "AWARD_AMOUNT": 44735.0,
            "AWARD_DATE": "2018-03-29",
            "RECIPIENT": "Autodyne Manufacturing Co., Inc. 200 N Strong Ave Lindenhurst  Us",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        },
        {
            "CONTRACT_AWARD_ID": "EE-133M-17-SE-0791",
            "CONTRACT_SOLICITATION_ID": "EE-133M-17-RQ-0468",
            "AWARD_NAME": "S--SECURITY GUARD / WATCHSTANDERS FOR THE NOAA SHIP RONALD BROWN",
            "AWARD_DESCRIPTION": "This is a combined synopsis/solicitation for commercial items prepared in accordance with the format in FAR Subpart 12.6, as supplemented with additional information included in this notice. The solicitation number is EE-133M-17-RQ-0468 and is issued as an invitation for bids (IFB), unless otherwise indicated herein. The solicitation document and incorporated provisions and clauses are those in effect through Federal Acquisition Circular 2005-95. The associated North American Industrial Classification System (NAICS) code for this procurement is 561612 with a small business size standard of $20.50M. This requirement is a [ Small Business ] set-aside and only qualified offerors may submit bids. The solicitation pricing on www.FedBid.com will start on the date this solicitation is posted and will end on 2017-06-08 17:00:00.0 Eastern Time or as otherwise displayed at www.FedBid.com. FOB Destination shall be in the Place of Performance. The National Oceanic & Atmospheric Administration requires the following items, Purchase Description Determined by Line Item, to the following: LI 001: PROVIDE SECURITY WATCHSTANDERS (232 HOURS) FOR THE NOAA SHIP RONALD BROWN WHILE AT THE NAVAL BASE IN KEY WEST, FL. (PLEASE SEE ATTACHED RFQ# EE-133M-17-RQ-0468) NOTE:**THE HOURLY RATE POSTED ON FEDBID WILL BE USED THROUGH OUT THE CONTRACT TO INCLUDE ANY ADDITIONAL HOURS THAT MAY BE REQUIRED.** PERIOD OF PERFORMANCE: 06 JULY - 18 JULY 2017 **PERIOD OF PERFORMANCE SUBJUECT TO CHANGE BASED ON THE SHIP SCHEDULE** PLACE OF PERFORMANCE: NOAA SHIP RONALD BROWN NAVAL BASE KEY WEST TRUMAN ANNEX / MOLE PIER KEY WEST, FL 33040 THIS IS A SECURED MILITARY BASE; BASE ACCESS IS REQUIRED. (PLEASE REFER TO SECURITY REQUIREMENTS ON RFQ#: EE-133M-17-RQ-0468), 232, HR; Solicitation and Buy Attachments ***Question Submission: Interested offerors must submit any questions concerning the solicitation at the earliest time possible to enable the Buyer to respond. Questions must be submitted by using the 'Submit a Question' feature at www.fedbid.com. Questions not received within a reasonable time prior to close of the solicitation may not be considered.*** For this solicitation, National Oceanic & Atmospheric Administration intends to conduct an online competitive reverse auction to be facilitated by the third-party reverse auction provider, FedBid, Inc. FedBid has developed an online, anonymous, browser based application to conduct the reverse auction. An Offeror may submit a series of pricing bids, which descend in price during the specified period of time for the aforementioned reverse auction. National Oceanic & Atmospheric Administration is taking this action in an effort to improve both vendor access and awareness of requests and the agency's ability to gather multiple, competed, real-time bids. All responsible Offerors that respond to this solicitation MUST submit the pricing portion of their bid using the online exchange located at www.FedBid.com. There is no cost to register, review procurement data or make a bid on www.FedBid.com. Offerors that are not currently registered to use www.FedBid.com should proceed to www.FedBid.com to complete their free registration. Offerors that require special considerations or assistance may contact the FedBid Helpdesk at 877-9FEDBID (877-933-3243) or via email at clientservices@fedbid.com. Offerors may not artificially manipulate the price of a transaction on www.FedBid.com by any means. It is unacceptable to place bad faith bids, to use decoys in the www.FedBid.com process or to collude with the intent or effect of hampering the competitive www.FedBid.com process. Should offerors require additional clarification, notify the point of contact or FedBid at 877-9FEDBID (877-933-3243) or clientservices@fedbid.com.Use of FedBid: Buyers and Sellers agree to conduct this transaction through FedBid in compliance with the FedBid Terms of Use. Failure to comply with the below terms and conditions may result in offer being determined as non-responsive. Contracting Officer's Authority. The Contracting Officer is the only person authorized to make or approve any changes in any of the requirements of this contract, and, notwithstanding any provisions contained elsewhere in this contract, the said authority remains solely in the Contracting Officer. In the event the contractor makes any changes at the direction of any person other than the Contracting Officer, the change will be considered to have been made without authority and no adjustment will be made in the contract terms and conditions, including price. Insert the clause 1352.209â\u0080\u009373, Compliance with the Laws, in all solicitations and contracts. As prescribed in 48 CFR 1309.507â\u0080\u00932(c), insert the following clause: Compliance With the Laws (APR 2010) The contractor shall comply with all applicable laws, rules and regulations which deal with or relate to performance in accord with the terms of the contract. As prescribed in 48 CFR 1309.507â\u0080\u00932(d), insert the following clause: Organizational Conflict of Interest (APR 2010) (a) Purpose. The purpose of this clause is to ensure that the contractor and its subcontractors: (1) Are not biased because of their financial, contractual, organizational, or other interests which relate to the work under this contract, and (2) Do not obtain any unfair competitive advantage over other parties by virtue of their performance of this contract. (b) Scope. The restrictions described herein shall apply to performance or participation by the contractor, its parents, affiliates, divisions and subsidiaries, and successors in interest (hereinafter collectively referred to as â\u0080\u009ccontractorâ\u0080?) in the activities covered by this clause as a prime contractor, subcontractor, co-sponsor, joint venturer, consultant, or in any similar capacity. For the purpose of this clause, affiliation occurs when a business concern is controlled by or has the power to control another or when a third party has the power to control both. (c) Warrant and Disclosure. The warrant and disclosure requirements of this paragraph apply with full force to both the contractor and all subcontractors. The contractor warrants that, to the best of the contractor's knowledge and belief, there are no relevant facts or circumstances which would give rise to an organizational conflict of interest, as defined in FAR Subpart 9.5, and that the contractor has disclosed all relevant information regarding any actual or potential conflict. The contractor agrees it shall make an immediate and full disclosure, in writing, to the Contracting Officer of any potential or actual organizational conflict of interest or the existence of any facts that may cause a reasonably prudent person to question the contractor's impartiality because of the appearance or existence of bias or an unfair competitive advantage. Such disclosure shall include a description of the actions the contractor has taken or proposes to take in order to avoid, neutralize, or mitigate any resulting conflict of interest. (d) Remedies. The Contracting Officer may terminate this contract for convenience, in whole or in part, if the Contracting Officer deems such termination necessary to avoid, neutralize or mitigate an actual or apparent organizational conflict of interest. If the contractor fails to disclose facts pertaining to the existence of a potential or actual organizational conflict of interest or misrepresents relevant information to the Contracting Officer, the Government may terminate the contract for default, suspend or debar the contractor from Government contracting, or pursue such other remedies as may be permitted by law or this contract. (e) Subcontracts. The contractor shall include a clause substantially similar to this clause, including paragraphs (f) and (g), in any subcontract or consultant agreement at any tier expected to exceed the simplified acquisition threshold. The terms â\u0080\u009ccontract,â\u0080? â\u0080\u009ccontractor,â\u0080? and â\u0080\u009cContracting Officerâ\u0080? shall be appropriately modified to preserve the Government's rights. (f) Prime Contractor Responsibilities. The contractor shall obtain from its subcontractors or consultants the disclosure required in FAR Part 9.507â\u0080\u00931, and shall determine in writing whether the interests disclosed present an actual, or significant potential for, an organizational conflict of interest. The contractor shall identify and avoid, neutralize, or mitigate any subcontractor organizational conflict prior to award of the contract to the satisfaction of the Contracting Officer. If the subcontractor's organizational conflict cannot be avoided, neutralized, or mitigated, the contractor must obtain the written approval of the Contracting Officer prior to entering into the subcontract. If the contractor becomes aware of a subcontractor's potential or actual organizational conflict of interest after contract award, the contractor agrees that the Contractor may be required to eliminate the subcontractor from its team, at the contractor's own risk. (g) Waiver. The parties recognize that this clause has potential effects which will survive the performance of this contract and that it is impossible to foresee each circumstance to which it might be applied in the future. Accordingly, the contractor may at any time seek a waiver from the Head of the Contracting Activity by submitting such waiver request to the Contracting Officer, including a full written description of the requested waiver and the reasons in support thereof. Insert a clause substantially similar to 1352.246â\u0080\u009370, Place of Acceptance, in contracts and solicitations to indicate where the acceptance of supplies and/or services will take place. As prescribed in 1346.503, insert the following clause: Place of Acceptance (APR 2010) (a) The Contracting Officer or the duly authorized representative will accept supplies and services to be provided under this contract. (b) The place of acceptance will be: PLEASE REFER TO LINE ITEM#: 001 PLEASE SEE ATTCHED RFQ#: EE-133M-17-RQ-0468 FOR ADDITIONAL TERMS AND CONDITIONS.",
            "AWARD_AMOUNT": 5735.04,
            "AWARD_DATE": "2017-06-20",
            "RECIPIENT": "Miller Private, Llc,224 Creekside Dr.,Leesburg Ga 31763",
            "PRIMARY_AWARDER_CONTACT_ID": null,
            "PRIMARY_AWARDER_CONTACT_NAME": null,
            "PRIMARY_AWARDER_CONTACT_TITLE": null,
            "PRIMARY_AWARDER_CONTACT_EMAIL": null,
            "PRIMARY_AWARDER_CONTACT_PHONE": null,
            "PRIMARY_AWARDER_CONTACT_FAX": null
        }
    ],
    "table_name": "GOVERNMENT_CONTRACT_AWARD_INDEX",
    "table_fullname": "GLOBAL_GOVERNMENT.CYBERSYN.GOVERNMENT_CONTRACT_AWARD_INDEX",
    "column_names": [
        "AWARD_NAME",
        "AWARD_AMOUNT",
        "PRIMARY_AWARDER_CONTACT_EMAIL",
        "CONTRACT_SOLICITATION_ID",
        "AWARD_DATE",
        "RECIPIENT",
        "CONTRACT_AWARD_ID",
        "PRIMARY_AWARDER_CONTACT_PHONE",
        "AWARD_DESCRIPTION",
        "PRIMARY_AWARDER_CONTACT_FAX",
        "PRIMARY_AWARDER_CONTACT_ID",
        "PRIMARY_AWARDER_CONTACT_NAME",
        "PRIMARY_AWARDER_CONTACT_TITLE"
    ],
    "column_types": [
        "TEXT",
        "FLOAT",
        "TEXT",
        "TEXT",
        "DATE",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "A short summary of the goods and services in the awarded contract",
        "The total amount of the awarded contract",
        "Email of the primary government contact at the office awarding the contract",
        "Unique solicitation number provided by the System for Award Management (sam.gov) for a specific contract.  Joinable to the GOVERNMENT_CONTRACT_INDEX table.",
        "The date the contract was awarded",
        "The name and address of the organization receiving the contract",
        "Award number provided by the System for Award Management (sam.gov) that is unique to each award for a given contract.",
        "Phone number of the primary government contact at the office awarding the contract",
        "A detailed statement of work and requirements of the services or products in the awarded contract",
        "Fax number of the primary government contact at the office awarding the contract",
        "Unique identifier for the primary government contact awarding the contract.",
        "Name of the primary government contact at the office awarding the contract",
        "Title of the primary government contact at the office awarding the contract"
    ]
}