{
    "table_name": "docs_24",
    "table_fullname": "bigquery-public-data.ebi_chembl.docs_24",
    "column_names": [
        "doc_id",
        "journal",
        "year",
        "volume",
        "issue",
        "first_page",
        "last_page",
        "pubmed_id",
        "doi",
        "chembl_id",
        "title",
        "doc_type",
        "authors",
        "abstract",
        "patent_id",
        "ridx",
        "src_id"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "doc_id",
        "journal",
        "year",
        "volume",
        "issue",
        "first_page",
        "last_page",
        "pubmed_id",
        "doi",
        "chembl_id",
        "title",
        "doc_type",
        "authors",
        "abstract",
        "patent_id",
        "ridx",
        "src_id"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "69727",
            "journal": "Chem Cent J",
            "year": "2012",
            "volume": "6",
            "issue": "28",
            "first_page": null,
            "last_page": null,
            "pubmed_id": "22483270",
            "doi": "10.1186/1752-153x-6-28",
            "chembl_id": "CHEMBL3046882",
            "title": "Synthesis and antibacterial activity against ralstonia solanacearum for novel hydrazone derivatives containing a pyridine moiety.",
            "doc_type": "PUBLICATION",
            "authors": "Wu J, Kang S, Song B, Hu D, He M, Jin L, Yang S.",
            "abstract": "BACKGROUND: Ralstonia solanacearum, one of the most important bacterial diseases on plants, is a devastating, soil-borne plant pathogen with a global distribution and an unusually wide host range. In order to discover new bioactive molecules and pesticides acting on tobacco bacterial wilt, we sought to combine the active structure of hydrazone and pyridine together to design and synthesize a series of novel hydrazone derivatives containing a pyridine moiety. RESULTS: A series of hydrazone derivatives containing a pyridine moiety were synthesized. Their structures were characterized by 1 H-NMR, 13 C-NMR, IR, and elemental analysis. The preliminary biological activity tests showed that compound 3e and 3g exhibited more than 80% activity against Ralstonia solanacearum at 500 mg/L, especially compound 3g displayed relatively good activity to reach 57.0% at 200 mg/L. CONCLUSION: A practical synthetic route to hydrazone derivatives containing a pyridine moiety by the reaction of intermediates 2 with different aldehydes in ethanol at room temperature using 2-chloronicotinic acid and 2-amino-5-chloro-3-methylbenzoic acid as start materials is presented. This study suggests that the hydrazone derivatives containing a substituted pyridine ring could inhibit the growth of Ralstonia solanacearum.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "59326",
            "journal": "Drug Discovery Today",
            "year": "2011",
            "volume": "16",
            "issue": "15-16",
            "first_page": "697",
            "last_page": "703",
            "pubmed_id": "21624500",
            "doi": "10.1016/j.drudis.2011.05.007",
            "chembl_id": "CHEMBL1909281",
            "title": "FDA-approved drug labeling for the study of drug-induced liver injury.",
            "doc_type": "PUBLICATION",
            "authors": "Chen M, Vijay V, Shi Q, Liu Z, Fang H, Tong W.",
            "abstract": "Drug-induced liver injury (DILI) is a leading cause of drugs failing during clinical trials and being withdrawn from the market. Comparative analysis of drugs based on their DILI potential is an effective approach to discover key DILI mechanisms and risk factors. However, assessing the DILI potential of a drug is a challenge with no existing consensus methods. We proposed a systematic classification scheme using FDA-approved drug labeling to assess the DILI potential of drugs, which yielded a benchmark dataset with 287 drugs representing a wide range of therapeutic categories and daily dosage amounts. The method is transparent and reproducible with a potential to serve as a common practice to study the DILI of marketed drugs for supporting drug discovery and biomarker development.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "77450",
            "journal": "Gastroenterol Clin Biol",
            "year": "2004",
            "volume": "28",
            "issue": "8-9",
            "first_page": "720",
            "last_page": "759",
            "pubmed_id": "15646539",
            "doi": "10.1016/s0399-8320(04)95062-2",
            "chembl_id": "CHEMBL3137667",
            "title": "[Drug-induced liver injury; fourteenth updated edition of the bibliographic database of liver injuries and related drugs].",
            "doc_type": "PUBLICATION",
            "authors": "Biour M, Ben Salem C, Chazouillères O, Grangé JD, Serfaty L, Poupon R.",
            "abstract": null,
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "11595",
            "journal": "J. Med. Chem.",
            "year": "1992",
            "volume": "35",
            "issue": "25",
            "first_page": "4651",
            "last_page": "4657",
            "pubmed_id": "1335080",
            "doi": "10.1021/jm00103a001",
            "chembl_id": "CHEMBL1126113",
            "title": "Para-substituted Phe3 deltorphin analogues: enhanced selectivity of halogenated derivatives for delta opioid receptor sites.",
            "doc_type": "PUBLICATION",
            "authors": "Salvadori S, Bianchi C, Lazarus LH, Scaranari V, Attila M, Tomatis R.",
            "abstract": "The delta-selective opioid peptide deltorphin C(H-Tyr-D-Ala-Phe-Asp-Val-Val-Gly-NH2) (DEL C) was modified by para-substitution of Phe3 with halogens (F, Cl, Br, I), amino, or nitro groups. The bioactive potencies in peripheral tissues and brain receptor selectivities of these analogues depended upon the particular substituent; peptides containing halogen substituents exhibited the least disruptive effect. In the mouse vas deferens (MVD) bioassay, [p-ClPhe3]DEL C displayed equivalent bioactivities to DEL C; in combination with the guinea pig ileum (GPI) bioassay, [p-ClPhe3]DEL C and [p-BrPhe3]DEL C exhibited marked preference for delta sites (IC50GPI/IC50MVD = 11,250 and 6,363, respectively), which are approximately 4- and 2-fold greater than DEL C. In a receptor binding assay, none of the halogenated analogues had delta affinities (Ki) exceeding that of DEL C; however, in terms of delta selectivity (Ki mu/Ki delta), [p-BrPhe3]DEL C was nearly twice as selective as DEL C, while [p-FPhe3]DEL C was equivalent, and [p-IPhe3]DEL C only 25% less selective. The only correlation evident with the halogenated derivatives occurred between IC50GPI and Ki mu (r = 0.814) rather than between delta receptor studies (MVD or Ki delta); interestingly, IC50GPI also correlated with K' (r = 0.982). The p-amino or p-nitro substituents of Phe3 in DEL C and DEL B (= [Glu4]DEL C) were deleterious for bioactivity (MVD) (losses ranged from 400- to approximately 8,000-fold) and in receptor binding assays, where delta affinities decreased 140- to 840-fold and delta selectivities by 34- to 380-fold. p-Nitro-Phe3 was the most detrimental substitution for all the parameters measured for both deltorphins: the loss in MVD activity, however, was less with DEL B than with DEL C, which was the opposite for delta receptor affinity.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "11596",
            "journal": "J. Med. Chem.",
            "year": "1992",
            "volume": "35",
            "issue": "25",
            "first_page": "4665",
            "last_page": "4675",
            "pubmed_id": "1469696",
            "doi": "10.1021/jm00103a003",
            "chembl_id": "CHEMBL1126114",
            "title": "A novel orally active inhibitor of IL-1 generation: synthesis and structure-activity relationships of 3-(4-hydroxy-1-naphthalenyl)-2-propenoic acid derivatives.",
            "doc_type": "PUBLICATION",
            "authors": "Tanaka M, Chiba K, Okita M, Kaneko T, Tagami K, Hibi S, Okamoto Y, Shirota H, Goto M, Obaishi H.",
            "abstract": "A new series of 3-(4-hydroxy-1-naphthalenyl)-2-propenoic acids was prepared and the inhibitory activities of its members on IL-1 generation were evaluated both by in vitro systems using human monocytes and/or rat exudated macrophages stimulated with LPS, and by an in vivo system using the rat CMC-LPS air-pouch model. Many compounds in this series were found to be potent inhibitors of IL-1 generation both in vitro and in vivo. Structure-activity relationships indicated that in the rat CMC-LPS air-pouch model by oral administration the (Z)-2-substituted propenoic acids with 3-alkoxy, 5-alkyl, and 4-hydroxy substituents on the naphthalene ring exhibit optimal inhibition. Among the compounds evaluated, (Z)-3-(5-ethyl-4-hydroxy-3-methoxy-1-naphthalenyl)-2-methyl-2-propeno ic acid (20a), which inhibited IL-1 generation from human monocytes with an IC50 value of 3.0 microM and had an IC50 value of 1.4 microM for rat exudated macrophages, showed the most potent inhibitory activity in the rat CMC-LPS model by oral administration. Compound 20a also showed antiinflammatory effects in animal models of inflammation.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        }
    ]
}