{
    "table_name": "docs_23",
    "table_fullname": "bigquery-public-data.ebi_chembl.docs_23",
    "column_names": [
        "doc_id",
        "journal",
        "year",
        "volume",
        "issue",
        "first_page",
        "last_page",
        "pubmed_id",
        "doi",
        "chembl_id",
        "title",
        "doc_type",
        "authors",
        "abstract",
        "patent_id"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "doc_id",
        "journal",
        "year",
        "volume",
        "issue",
        "first_page",
        "last_page",
        "pubmed_id",
        "doi",
        "chembl_id",
        "title",
        "doc_type",
        "authors",
        "abstract",
        "patent_id"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "45680",
            "journal": "Nature",
            "year": "2000",
            "volume": "405",
            "issue": "6789",
            "first_page": "962",
            "last_page": "966",
            "pubmed_id": "10879539",
            "doi": "10.1038/35016103",
            "chembl_id": "CHEMBL1143399",
            "title": "A small-molecule nitroimidazopyran drug candidate for the treatment of tuberculosis.",
            "doc_type": "PUBLICATION",
            "authors": "Stover CK, Warrener P, VanDevanter DR, Sherman DR, Arain TM, Langhorne MH, Anderson SW, Towell JA, Yuan Y, McMurray DN, Kreiswirth BN, Barry CE, Baker WR.",
            "abstract": "Mycobacterium tuberculosis, which causes tuberculosis, is the greatest single infectious cause of mortality worldwide, killing roughly two million people annually. Estimates indicate that one-third of the world population is infected with latent M. tuberculosis. The synergy between tuberculosis and the AIDS epidemic, and the surge of multidrug-resistant clinical isolates of M. tuberculosis have reaffirmed tuberculosis as a primary public health threat. However, new antitubercular drugs with new mechanisms of action have not been developed in over thirty years. Here we report a series of compounds containing a nitroimidazopyran nucleus that possess antitubercular activity. After activation by a mechanism dependent on M. tuberculosis F420 cofactor, nitroimidazopyrans inhibited the synthesis of protein and cell wall lipid. In contrast to current antitubercular drugs, nitroimidazopyrans exhibited bactericidal activity against both replicating and static M. tuberculosis. Lead compound PA-824 showed potent bactericidal activity against multidrugresistant M. tuberculosis and promising oral activity in animal infection models. We conclude that nitroimidazopyrans offer the practical qualities of a small molecule with the potential for the treatment of tuberculosis.",
            "patent_id": null
        },
        {
            "doc_id": "70539",
            "journal": "Biochemistry",
            "year": "2004",
            "volume": "43",
            "issue": "32",
            "first_page": "10414",
            "last_page": "10423",
            "pubmed_id": "15301540",
            "doi": "10.1021/bi049323o",
            "chembl_id": "CHEMBL3046924",
            "title": "Structural basis for herbicidal inhibitor selectivity revealed by comparison of crystal structures of plant and mammalian 4-hydroxyphenylpyruvate dioxygenases.",
            "doc_type": "PUBLICATION",
            "authors": "Yang C, Pflugrath JW, Camper DL, Foster ML, Pernich DJ, Walsh TA.",
            "abstract": "A high degree of selectivity toward the target site of the pest organism is a desirable attribute for new safer agrochemicals. To assist in the design of novel herbicides, we determined the crystal structures of the herbicidal target enzyme 4-hydroxyphenylpyruvate dioxygenase (HPPD; EC 1.13.11.27) from the plant Arabidopsis thaliana with and without an herbicidal benzoylpyrazole inhibitor that potently inhibits both plant and mammalian HPPDs. We also determined the structure of a mammalian (rat) HPPD in complex with the same nonselective inhibitor. From a screening campaign of over 1000 HPPD inhibitors, six highly plant-selective inhibitors were found. One of these had remarkable (>1600-fold) selectivity toward the plant enzyme and was cocrystallized with Arabidopsis HPPD. Detailed comparisons of the plant and mammalian HPPD-ligand structures suggest a structural basis for the high degree of plant selectivity of certain HPPD inhibitors and point to design strategies to obtain potent and selective inhibitors of plant HPPD as agrochemical leads.",
            "patent_id": null
        },
        {
            "doc_id": "70515",
            "journal": "J Agric Food Chem",
            "year": "2003",
            "volume": "51",
            "issue": "25",
            "first_page": "7271",
            "last_page": "7275",
            "pubmed_id": "14640569",
            "doi": "10.1021/jf0304223",
            "chembl_id": "CHEMBL3046748",
            "title": "Antifeedant effects of the limonoids from Entandrophragma candolei (Meliaceae) on the gram pod borer, Helicoverpa armigera (Lepidoptera: Noctuidae).",
            "doc_type": "PUBLICATION",
            "authors": "Koul O, Daniewski WM, Multani JS, Gumulka M, Singh G.",
            "abstract": "The biological activity of the limonoids prieurianin and epoxyprieurianin isolated from Entandrophragma candolei (Harms) (Meliaceae) and their respective acetates was assessed using the gram pod borer, Helicoverpa armigera (Hubner) (Lepidoptera: Noctuidae). The compounds exhibited strong antifeedant activity in a diet choice bioassay with epoxyprieurianin acetate being most effective with 48.3 ppm deterring feeding by 50% (DI50) and prieurianin the least effective (DI50 = 91.4 ppm). The effect on growth of larvae was concomitant with the reduced feeding by neonate and third instar larvae. In nutritional assays, all the compounds reduced growth and consumption when fed to larvae without any effect on efficiency of conversion of ingested food (ECI), suggesting antifeedant activity alone. No toxicity was observed nor was there any significant affect on nutritional indices following topical application, further suggesting that prieurianin-type limonoids act specifically as feeding deterrents.",
            "patent_id": null
        },
        {
            "doc_id": "69640",
            "journal": "J Agric Food Chem",
            "year": "2007",
            "volume": "55",
            "issue": "25",
            "first_page": "10323",
            "last_page": "10330",
            "pubmed_id": "18020407",
            "doi": "10.1021/jf071636d",
            "chembl_id": "CHEMBL3046326",
            "title": "Screening of dialkoxybenzenes and disubstituted cyclopentene derivatives against the cabbage looper, Trichoplusia ni, for the discovery of new feeding and oviposition deterrents.",
            "doc_type": "PUBLICATION",
            "authors": "Akhtar Y, Isman MB, Paduraru PM, Nagabandi S, Nair R, Plettner E.",
            "abstract": "The antifeedant, oviposition deterrent, and toxic effects of dialkoxybenzene minilibraries and of disubstituted cyclopentene minilibraries (i.e., consisting of four to five compounds) along with their pure constituent compounds were assessed against third instar larvae and adults of the cabbage looper, Trichoplusia ni, in laboratory bioassays in a search for new insect control agents. These compounds mimic naturally occurring bioactive odorants and tastants and are relatively easily prepared from commodity chemicals. Most of these libraries strongly deterred larval feeding, with some exhibiting strong toxic and oviposition deterrent effects as well. Our results suggest some structure-function relationships within these libraries. Replacement of a methyl group with larger alkyl substituents increased the feeding deterrent effects in most cases. The presence of a free hydroxyl group, irrespective of the carbon framework or alkyl substituent, served to reduce feeding deterrent effects in all series of compounds. Further, exceeding a certain group size also generally had a detrimental effect. This information will be useful in designing new insect control agents for agriculture. Some of these libraries and compounds may have potential for development as commercial insecticides.",
            "patent_id": null
        },
        {
            "doc_id": "69638",
            "journal": "J Agric Food Chem",
            "year": "2007",
            "volume": "55",
            "issue": "25",
            "first_page": "10331",
            "last_page": "10338",
            "pubmed_id": "18001038",
            "doi": "10.1021/jf072077d",
            "chembl_id": "CHEMBL3045616",
            "title": "Synthetic pyrazole derivatives as growth inhibitors of some phytopathogenic fungi.",
            "doc_type": "PUBLICATION",
            "authors": "Vicentini CB, Romagnoli C, Andreotti E, Andreotti E, Mares D.",
            "abstract": "The present study was carried out to investigate the antifungal activity of pyrazole/isoxazole-3-carboxamido-4-carboxylic acids, 4-oxo-5-substituted pyrazolo[3,4-d]pyrimidine-6-thiones, and N-alkyl/aryl-N'-(4-carbethoxy-3-pyrazolyl)thioureas against Pythium ultimum, Botrytis cinerea, and Magnaporthe grisea. The results on growth inhibition showed differences in the sensitivity of the three fungi to the tested substances, and in general P. ultimum was shown to be the most sensitive. On all phytopathogens the best results within the pyrazole/isoxazolecarboxamide series are given by the compounds with the carboxamide and carboxylic groups in positions 3 and 4; the presence of these groups seems to be critical for biological activity in this series of compounds. Among the pyrazolopyrimidines the derivative supplied with the benzylic group was the most active on the three fungi and in particular against P. ultimum. Several compounds belonging to the thiourea series are able to inhibit selectively M. grisea at 50 and 10 microg mL(-1), doses at which the reference commercial compound tricyclazole had low or no effect.",
            "patent_id": null
        }
    ]
}