{
    "table_name": "EBI_CHEMBL.DOCS",
    "table_fullname": "EBI_CHEMBL.EBI_CHEMBL.DOCS",
    "column_names": [
        "volume",
        "pubmed_id",
        "ridx",
        "chembl_id",
        "issue",
        "chembl_release_id",
        "title",
        "doc_id",
        "abstract",
        "doi",
        "last_page",
        "authors",
        "src_id",
        "year",
        "journal",
        "patent_id",
        "doc_type",
        "first_page"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "123098",
            "journal": "Bioorg Med Chem Lett",
            "year": "2022",
            "volume": "72",
            "issue": null,
            "first_page": "128871",
            "last_page": "128871",
            "pubmed_id": "35777718",
            "doi": "10.1016/j.bmcl.2022.128871",
            "chembl_id": "CHEMBL5113463",
            "title": "Discovery and preclinical evaluations of JBD0131, a novel nitrodihydro-imidazooxazole anti-tuberculosis agent.",
            "doc_type": "PUBLICATION",
            "authors": "Luo W, Huang Z, Xu D, Yang M, Zhu Y, Shen L, Chen S, Tao X, Bin W, Hu Y, Franzblau SG, Jiang N, Wei Y, Wei X, Ding CZ.",
            "abstract": "Multidrug-resistant pulmonary tuberculosis (MDR-TB) is a major health problem worldwide. The treatment for MDR-TB requires medications for a long duration (up to 20-24 months) with second-line drugs resulting in unfavorable outcomes. Nitroimidazoles are promising antimycobacterial agents known to inhibit both aerobic and anaerobic mycobacterial activity. Delamanid and pretomanid are two nitroimidazoles approved by the regulatory agencies for MDR-TB treatment. However, both agents possess unsatisfactory absorption and QTc prolongation. In our search for a safer nitroimidazole, we discovered JBD0131 (2). It exhibited excellent anti-mycobacterial activity against M. tuberculosis H37Rv in vitro and in vivo, improved PK and absorption, reduced QT prolongation potential of delamanid. JBD0131 is currently in clinical development in China for pulmonary tuberculosis (CTR20202308).",
            "patent_id": null,
            "ridx": "35777718",
            "src_id": "1",
            "chembl_release_id": "33"
        },
        {
            "doc_id": "123101",
            "journal": "Bioorg Med Chem Lett",
            "year": "2022",
            "volume": "72",
            "issue": null,
            "first_page": "128874",
            "last_page": "128874",
            "pubmed_id": "35779826",
            "doi": "10.1016/j.bmcl.2022.128874",
            "chembl_id": "CHEMBL5113466",
            "title": "Design, synthesis, and bioactivity evaluation of macrocyclic benzo[b]pyrido[4,3-e][1,4]oxazine derivatives as novel Pim-1 kinase inhibitors.",
            "doc_type": "PUBLICATION",
            "authors": "Xu J, Shen C, Xie Y, Qiu B, Ren X, Zhou Y, Li G, Zheng G, Huang N.",
            "abstract": "Pim-1 kinase is a serine/threonine kinase which is vital in many tumors. The Pim-1 inhibitor 10-DEBC and its derivatives discovered in our previous work were modified through macrocyclization strategy. A series of benzo[b]pyridine[4,3-e][1,4]oxazine macrocyclic compounds were designed, synthesized, and evaluated as novel Pim-1 kinase inhibitors. Among these compounds, compound H5 exhibited the highest activity with an IC<sub>50</sub> value of 35 nM. In addition, the crystal complex structure of Pim-1 kinase bound with compound H3 was determined, and the structure-activity relationship of these macrocyclic compounds was analyzed, which provides the structural basis of further optimization of novel macrocyclic Pim-1 kinase inhibitors..",
            "patent_id": null,
            "ridx": "35779826",
            "src_id": "1",
            "chembl_release_id": "33"
        },
        {
            "doc_id": "123102",
            "journal": "Bioorg Med Chem Lett",
            "year": "2022",
            "volume": "72",
            "issue": null,
            "first_page": "128873",
            "last_page": "128873",
            "pubmed_id": "35779827",
            "doi": "10.1016/j.bmcl.2022.128873",
            "chembl_id": "CHEMBL5113467",
            "title": "Design, synthesis and evaluation of 2-(2-oxoethyl)pyrimidine-5-carboxamide derivatives as acetylcholinesterase inhibitors.",
            "doc_type": "PUBLICATION",
            "authors": "Han C, Wei BB, Shang PP, Guo XY, Bai LG, Ma ZY.",
            "abstract": "A novel series of 2-(2- oxoethyl)pyrimidine-5-carboxamide derivatives were designed, synthesized and evaluated as acetylcholinesterase inhibitors (AChEIs) for the treatment of Alzheimer's disease (AD). Biological activity results demonstrated that compound 10q showed the best inhibitory activity against AChE (IC<sub>50</sub> = 0.88 ± 0.78 μM), which was better than that of Huperzine-A, and its inhibitory effect on BuChE was weak (IC<sub>50</sub> = 10.0 ± 1.30 μM), which indicated that compound 10q was a dominant AChE inhibitor. In addition, the result of molecular docking study displayed that 10q could simultaneously bind to CAS and PAS sites of AChE, which was consistent with the mixed inhibition mode shown by the enzymatic kinetics study of 10q. Furthermore, the molecular properties of the target compounds were predicted online using the molinspiration server and pkCSM, The results exhibited that compound 10q had drug-like properties that satisfied the Lipinski's rule of five. Based on the bioactivity and molecular properties, compound 10q for further development was valuable.",
            "patent_id": null,
            "ridx": "35779827",
            "src_id": "1",
            "chembl_release_id": "33"
        },
        {
            "doc_id": "123107",
            "journal": "Bioorg Med Chem Lett",
            "year": "2022",
            "volume": "72",
            "issue": null,
            "first_page": "128878",
            "last_page": "128878",
            "pubmed_id": "35788034",
            "doi": "10.1016/j.bmcl.2022.128878",
            "chembl_id": "CHEMBL5113472",
            "title": "Structure-activity relationship studies of [1,2,5]oxadiazolo[3,4-b]pyrazine-containing polymyxin-selective resistance-modifying agents.",
            "doc_type": "PUBLICATION",
            "authors": "Dutta S, Liu N, Gao Y, Beck L, Wang X.",
            "abstract": "Multidrug-resistant (MDR) Gram-negative bacteria are an urgent and rapidly spreading threat to human health with limited treatment options. Previously, we discovered a novel [1,2,5]oxadiazolo[3,4-b]pyrazine-containing compound (1) that selectively re-sensitized a variety of MDR Gram-negative bacteria to colistin, one of the last-resort antibiotic. Herein, we report the structure-activity relationship studies of compound 1 that led to the discovery of several more potent and/or less toxic resistance-modifying agents (RMAs). Further evaluation of these RMAs showed that they were effective in a wide range of MDR bacteria. These results demonstrated these compounds as a novel class of RMAs and may be further developed as therapeutic agents.",
            "patent_id": null,
            "ridx": "35788034",
            "src_id": "1",
            "chembl_release_id": "33"
        },
        {
            "doc_id": "123123",
            "journal": "Bioorg Med Chem Lett",
            "year": "2022",
            "volume": "72",
            "issue": null,
            "first_page": "128881",
            "last_page": "128881",
            "pubmed_id": "35810950",
            "doi": "10.1016/j.bmcl.2022.128881",
            "chembl_id": "CHEMBL5113488",
            "title": "Design, synthesis and antitumor activity study of a gemcitabine prodrug conjugated with a HDAC6 inhibitor.",
            "doc_type": "PUBLICATION",
            "authors": "Li Y, Liu Y, Chen Y, Wang K, Luan Y.",
            "abstract": "Gemcitabine, as a first-line antitumor drug, has attracted extensive attention. However the occurrence of drug resistance limits its clinical utilization. In this paper, a gemcitabine prodrug GZ was designed and synthesized by conjugation of gemcitabine with a newly reported HDAC6 selective inhibitor pentadecanoic acid. GZ displayed high cytotoxicity to nine cancer cell lines with IC<sub>50</sub> values in the low micromolar range. In vivo, GZ displayed superior antitumor activity to gemcitabine in a 4T1 tumor xenograft model without obvious pathological damage to important organs of mice. Our study showed that compound GZ is a potential gemcitabine prodrug, which is worthy of further antitumor activity exploration.",
            "patent_id": null,
            "ridx": "35810950",
            "src_id": "1",
            "chembl_release_id": "33"
        }
    ]
}