{
    "table_name": "EBI_CHEMBL.DOCS_26",
    "table_fullname": "EBI_CHEMBL.EBI_CHEMBL.DOCS_26",
    "column_names": [
        "year",
        "chembl_id",
        "src_id",
        "journal",
        "patent_id",
        "doc_type",
        "abstract",
        "last_page",
        "doi",
        "volume",
        "pubmed_id",
        "authors",
        "title",
        "ridx",
        "doc_id",
        "issue",
        "first_page"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "8781",
            "journal": "J. Med. Chem.",
            "year": "1986",
            "volume": "29",
            "issue": "11",
            "first_page": "2142",
            "last_page": "2148",
            "pubmed_id": "3783575",
            "doi": "10.1021/jm00161a003",
            "chembl_id": "CHEMBL1123260",
            "title": "Cardiotonic agents. 4. Synthesis and biological evaluation of N-substituted 2,4,4a,5-tetrahydro-3H-indeno[1,2-c]pyridazin-3-ones: rigid structures derived from CI-930 and analogues.",
            "doc_type": "PUBLICATION",
            "authors": "Sircar I, Duell BL, Cain MH, Burke SE, Bristol JA.",
            "abstract": "Several N-substituted 3H-indeno[1,2-c]pyridazinones (1-23) and a benzo[h]cinnolinone (24), which were designed as rigid structural modifications of 5-alkyl-4,5-dihydro-6-[4-N-substituted phenyl]-3(2H)-pyridazinones (ib-d), were synthesized and evaluated for positive inotropic activity. Most of these tricyclic pyridazinones (1-11, 14-15, 22-23) demonstrated potent positive inotropic activity comparable to the corresponding phenylpyridazinones related to I.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "8783",
            "journal": "J. Med. Chem.",
            "year": "1986",
            "volume": "29",
            "issue": "11",
            "first_page": "2164",
            "last_page": "2170",
            "pubmed_id": "3783577",
            "doi": "10.1021/jm00161a006",
            "chembl_id": "CHEMBL1123476",
            "title": "Synthesis of congeners and prodrugs of the benzene maleimide photoadduct mitindomide as potential antitumor agents. 2.",
            "doc_type": "PUBLICATION",
            "authors": "Deutsch HM, Gelbaum LT, McLaughlin M, Fleischmann TJ, Earnhart LL, Haugwitz RD, Zalkow LH.",
            "abstract": "Potential prodrugs of the highly insoluble, diimide antitumor agent mitindomide (1b) were synthesized by several different methods. The condensation reaction between mitindomide and formaldehyde cleanly gave the stable bis(hydroxymethyl) compound 7a, which was partially soluble in water (ca. 0.8%) and showed improved activity in the P-388 screen. When this compound was treated with secondary amines, good yields of Mannich bases could be isolated. The compound from N-methylpiperazine (7b) had excellent properties and is a candidate for clinical trials. Condensation with other aldehydes gave either no reaction or compounds with poor activity. A water-soluble ester was prepared from 7a and succinic anhydride, but had reduced potency and activity. Oxidation of the double bond of 1a with ozone gave an inactive diacid, whereas the dihydro compound was as active as the olefin. When other aromatics (anisole, p-xylene, mesitylene) were photolyzed with maleimide, the resulting photoproducts were found to be inactive. Diimides from other ring system were synthesized from the corresponding anhydrides and found to be inactive. However, the bis(hydroxymethyl) derivative of one of these (12a) was active in the P-388 screen.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "8784",
            "journal": "J. Med. Chem.",
            "year": "1986",
            "volume": "29",
            "issue": "11",
            "first_page": "2170",
            "last_page": "2174",
            "pubmed_id": "3097315",
            "doi": "10.1021/jm00161a007",
            "chembl_id": "CHEMBL1123261",
            "title": "Comparative antiaggregatory activity in human platelets of a benzopyranone aci-reductone, clofibric acid, and a 2,3-dihydrobenzofuran analogue.",
            "doc_type": "PUBLICATION",
            "authors": "Witiak DT, Kim SK, Romstedt K, Newman HA, Feller DR.",
            "abstract": "A synthetic method for the preparation of aci-reductone 6-chloro-3,4-dihydroxy-2H-1-benzopyran-2-one (3) from 5-chlorosalicylate is presented. In human platelets, the benzopyranone derivative 3, clofibric acid (1), and the 2,3-dihydrobenzofuran analogue 4 inhibited aggregation and serotonin secretory responses to adenosine diphosphate (ADP) with a rank order of potency 3 greater than or equal to 4 greater than 1. Only analogues 3 and 4 consistently blocked the aggregatory responses (greater than 50%) to arachidonic acid (AA) and U46619, a thromboxane A2 agonist. Further, the rank order of inhibitory potency against U46619-induced serotonin secretion was 4 greater than 3 greater than 1. Benzopyranone 3 is of interest since it was the most potent inhibitor of thrombin-induced [3H]AA release (3 much greater than 4 = 1) and more potent than 1 or 4 for the blockade of the ADP- or AA-mediated pathway of platelet aggregation.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "8785",
            "journal": "J. Med. Chem.",
            "year": "1986",
            "volume": "29",
            "issue": "11",
            "first_page": "2174",
            "last_page": "2183",
            "pubmed_id": "3783578",
            "doi": "10.1021/jm00161a008",
            "chembl_id": "CHEMBL1123262",
            "title": "Nonquaternary cholinesterase reactivators. 3. 3(5)-Substituted 1,2,4-oxadiazol-5(3)-aldoximes and 1,2,4-oxadiazole-5(3)-thiocarbohydroximates as reactivators of organophosphonate-inhibited eel and human acetylcholinesterase in vitro.",
            "doc_type": "PUBLICATION",
            "authors": "Bedford CD, Howd RA, Dailey OD, Miller A, Nolen HW, Kenley RA, Kern JR, Winterle JS.",
            "abstract": "As an extension of an earlier investigation (J. Med. Chem. 1984, 27, 1431), we prepared a series of 3-substituted 5-[(hydroxyimino)methyl]-1,2,4-oxadiazoles and the corresponding 5-thiocarbohydroximic acid 2-(N,N-dialkylamino)ethyl S-esters. The compounds were evaluated in vitro as reactivators of phosphonylated electric eel and human erythrocyte (RBC) acetylcholinesterases (AChE). The compounds were characterized with respect to (hydroxyimino)methyl acid dissociation constant, nucleophilicity, octanol/buffer partition coefficient, reversible AChE inhibition, and kinetics of reactivating ethyl methylphosphonylated AChE. One compound was also tested for effectiveness in preventing AChE phosphonylation. All of the tested compounds significantly reactivate ethyl methylphosphonylated AChE: the 3-n-octyl- and 3-(1-naphthyl)-substituted aldoximes are as reactive (within a factor of 5-10) toward the inhibited enzymes as the benchmark pyridinium reactivators, 2-PAM and HI-6. All of the substituted thiocarbohydroximic acid S-esters are powerful reversible inhibitors of AChE's: the 3-n-octyl- and 3-(1-naphthyl)-substituted thiocarbohydroximates inhibit eel AChE to 50% initial activity at concentrations less than 5 microM. When added to an eel AChE solution at concentrations between 5 and 50 microM, the 3-phenyl-substituted thiocarbohydroximate effectively antagonizes AChE inhibition by ethyl p-nitrophenyl methylphosphonate (EPMP), suggesting the potential utility of this compound for preventing anti-AChE-agent poisoning.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "8788",
            "journal": "J. Med. Chem.",
            "year": "1986",
            "volume": "29",
            "issue": "11",
            "first_page": "2194",
            "last_page": "2201",
            "pubmed_id": "3783581",
            "doi": "10.1021/jm00161a011",
            "chembl_id": "CHEMBL1123265",
            "title": "Synthesis and antihypertensive activity of 4-(cyclic amido)-2H-1-benzopyrans.",
            "doc_type": "PUBLICATION",
            "authors": "Ashwood VA, Buckingham RE, Cassidy F, Evans JM, Faruk EA, Hamilton TC, Nash DJ, Stemp G, Willcocks K.",
            "abstract": "The synthesis and antihypertensive activity of a series of novel 4-(cyclic amido)-2H-1-benzopyran-3-ols, administered orally to conscious spontaneously hypertensive rats, are described. The effects of lactam ring size, the presence of heteroatoms in the lactam ring, substitution at C(2) and C(3), relative stereochemistry at C(3) and C(4), and aromatic substitution pattern on the blood pressure lowering activity of this series have been determined. The key compound 2 from this work [BRL 34915; (+/-)-6-cyano-3,4-dihydro-2,2-dimethyl-trans-4-(2-oxopyrrolidin-1- yl)-2H-1-benzopyran-3-ol] has been resolved, and antihypertensive activity was found to reside primarily in the (-) enantiomer. The key step in the preparation of this class of compounds is the action of a cyclo amidic anion on an appropriate epoxide. Another approach, involving a cyclization step to the lactam was found to be more convenient in certain cases, particularly in forming the cis analogue of compound 2. Compound 2 has been shown to possess a novel mechanism of action, and it has been selected for progression to the clinic.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        }
    ]
}