{
    "table_name": "EBI_CHEMBL.DOCS_28",
    "table_fullname": "EBI_CHEMBL.EBI_CHEMBL.DOCS_28",
    "column_names": [
        "pubmed_id",
        "src_id",
        "authors",
        "doc_id",
        "doi",
        "title",
        "year",
        "doc_type",
        "abstract",
        "journal",
        "patent_id",
        "volume",
        "chembl_id",
        "first_page",
        "issue",
        "last_page",
        "ridx"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "52892",
            "journal": "Eur. J. Med. Chem.",
            "year": "2010",
            "volume": "45",
            "issue": "10",
            "first_page": "4622",
            "last_page": "4630",
            "pubmed_id": "20705371",
            "doi": "10.1016/j.ejmech.2010.07.027",
            "chembl_id": "CHEMBL1250504",
            "title": "Antihypertensive and antiarrhythmic properties of a para-hydroxy[bis(ortho-morpholinylmethyl)]phenyl-1,4-DHP compound: comparison with other compounds of the same kind and relationship with logP values.",
            "doc_type": "PUBLICATION",
            "authors": "Abrego VH, Martínez-Pérez B, Torres LA, Angeles E, Martínez L, Marroquín-Pascual JL, Moya-Hernández R, Amaro-Recillas HA, Rueda-Jackson JC, Rodríguez-Barrientos D, Rojas-Hernández A.",
            "abstract": "A new para-hydroxy[bis(ortho-morpholinylmethyl)]phenyl-1,4-DHP substituted compound, (4-(4-hydroxy-3,5-bis(morpholin-4-ylmethyl)phenyl)-2,6-dimethyl-1,4-dihydropyridine-3,5-dicarboxylic acid diethyl ester, LQM300), with antihypertensive and antiarrhythmic properties, has been synthesized. Four pKa values of this compound have been determined with the aid of the program SQUAD, at pseudo-physiological conditions (T = 37 degrees C and I = 0.15 M) by UV spectrophotometry and at T = 25 degrees C and I = 0.05 M by Capillary Zone Electrophoresis (CZE). The logP = 2.7 +/- 0.2 between n-octanol and water, has been estimated by UV spectrophotometry. The antihypertensive and antiarrhythmic efficacies as well as the logP values have been compared with other compounds of the same kind and related with their structure.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "53040",
            "journal": "Eur. J. Med. Chem.",
            "year": "2010",
            "volume": "45",
            "issue": "10",
            "first_page": "4479",
            "last_page": "4489",
            "pubmed_id": "20708306",
            "doi": "10.1016/j.ejmech.2010.07.008",
            "chembl_id": "CHEMBL1255505",
            "title": "Synthesis of new series of quinoxaline based MAO-inhibitors and docking studies.",
            "doc_type": "PUBLICATION",
            "authors": "Khattab SN, Hassan SY, Bekhit AA, El Massry AM, Langer V, Amer A.",
            "abstract": "A series of 2-benzyl-3-(2-arylidenehydrazinyl)quinoxalines 3, 4-benzyl-1-aryl-[1,2,4]triazolo[4,3-a]quinoxalines 4 and phenyl(1-aryl-[1,2,4]triazolo[4,3-a]quinoxalin-4-yl)methanones 5 analogues were synthesized and investigated for their monoamine oxidase (MAO) inhibitory property. The inhibition profile was found to be competitive for compounds 3k, 3m, 5f and 5n with MAO-A selectivity. Observation of the docked positions of these compounds revealed interactions with many residues previously reported to have an effect on the inhibition of the enzyme. The structural features of the new compounds have been determined from the microanalytical, IR, (1)H, (13)C NMR spectral studies and X-ray crystalography.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "16967",
            "journal": "J. Med. Chem.",
            "year": "2003",
            "volume": "46",
            "issue": "10",
            "first_page": "1799",
            "last_page": "1802",
            "pubmed_id": "12723942",
            "doi": "10.1021/jm025619l",
            "chembl_id": "CHEMBL1145027",
            "title": "Design and synthesis of statine-based cell-permeable peptidomimetic inhibitors of human beta-secretase.",
            "doc_type": "PUBLICATION",
            "authors": "Hom RK, Fang LY, Mamo S, Tung JS, Guinn AC, Walker DE, Davis DL, Gailunas AF, Thorsett ED, Sinha S, Knops JE, Jewett NE, Anderson JP, John V.",
            "abstract": "We describe the development of statine-based peptidomimetic inhibitors of human beta-secretase (BACE). The conversion of the peptide inhibitor 1 into cell-permeable peptidomimetic inhibitors of BACE was achieved through an iterative strategy of conceptually subdividing 1 into three regions: an N-terminal portion, a central statine-containing core, and a C-terminus. Replacement of the amino acid residues of 1 with moieties with less peptidic character was done with retention of BACE enzyme inhibitory activity. This approach led to the identification of the cell-permeable BACE inhibitor 38 that demonstrated BACE-mechanism-selective inhibition of Abeta secretion in human embryonic kidney cells.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "16968",
            "journal": "J. Med. Chem.",
            "year": "2003",
            "volume": "46",
            "issue": "10",
            "first_page": "1803",
            "last_page": "1806",
            "pubmed_id": "12723943",
            "doi": "10.1021/jm034020y",
            "chembl_id": "CHEMBL1144876",
            "title": "Benzodiazepines as potent and selective bradykinin B1 antagonists.",
            "doc_type": "PUBLICATION",
            "authors": "Wood MR, Kim JJ, Han W, Dorsey BD, Homnick CF, DiPardo RM, Kuduk SD, MacNeil T, Murphy KL, Lis EV, Ransom RW, Stump GL, Lynch JJ, O'Malley SS, Miller PJ, Chen TB, Harrell CM, Chang RS, Sandhu P, Ellis JD, Bondiskey PJ, Pettibone DJ, Freidinger RM, Bock MG.",
            "abstract": "Antagonism of the bradykinin B(1) receptor was demonstrated to be a potential treatment for chronic pain and inflammation. Novel benzodiazepines were designed that display subnanomolar affinity for the bradykinin B(1) receptor (K(i) = 0.59 nM) and high selectivity against the bradykinin B(2) receptor (K(i) > 10 microM). In vivo efficacy, comparable to morphine, was demonstrated for lead compounds in a rodent hyperalgesia model.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "16970",
            "journal": "J. Med. Chem.",
            "year": "2003",
            "volume": "46",
            "issue": "10",
            "first_page": "1811",
            "last_page": "1823",
            "pubmed_id": "12723945",
            "doi": "10.1021/jm020475w",
            "chembl_id": "CHEMBL1145029",
            "title": "Design, synthesis, and evaluation of benzothiadiazepine hydroxamates as selective tumor necrosis factor-alpha converting enzyme inhibitors.",
            "doc_type": "PUBLICATION",
            "authors": "Cherney RJ, Duan JJ, Voss ME, Chen L, Wang L, Meyer DT, Wasserman ZR, Hardman KD, Liu RQ, Covington MB, Qian M, Mandlekar S, Christ DD, Trzaskos JM, Newton RC, Magolda RL, Wexler RR, Decicco CP.",
            "abstract": "Elevated levels of tumor necrosis factor-alpha (TNF-alpha) have been associated with several inflammatory diseases, and therefore, strategies for its suppression have become important targets in drug discovery. Our efforts to suppress TNF-alpha have centered on the inhibition of TNF-alpha converting enzyme (TACE) through the use of hydroxamate inhibitors. Starting from broad-spectrum matrix metalloproteinase (MMP) inhibitors, we have designed and synthesized novel benzothiadiazepines as potent and selective TACE inhibitors. The benzothiadiazepines were synthesized with variation in P1 and P1' in order to effect potency and selectivity. The inhibitors were evaluated versus porcine TACE (pTACE), and the initial selectivity was assessed with counterscreens of MMP-1, -2, and -9. Several potent and selective inhibitors were discovered with compound 41 being the most active against pTACE (K(i) = 5 nM) while still maintaining good selectivity versus the MMP's (at least 75-fold). Most compounds were assessed in the human peripheral blood mononuclear cell assay (PBMC) and the human whole blood assay (WBA) to determine their ability to suppress TNF-alpha. Compound 32 was the most potent compound in the PBMC assay (IC(50) = 0.35 microM), while compound 62 was the most active in the WBA (IC(50) = 1.4 microM).",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        }
    ]
}