{
    "table_name": "EBI_CHEMBL.DOCS_29",
    "table_fullname": "EBI_CHEMBL.EBI_CHEMBL.DOCS_29",
    "column_names": [
        "doc_type",
        "title",
        "first_page",
        "src_id",
        "last_page",
        "journal",
        "volume",
        "chembl_id",
        "patent_id",
        "doc_id",
        "ridx",
        "abstract",
        "issue",
        "authors",
        "year",
        "doi",
        "pubmed_id"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "8084",
            "journal": "J. Med. Chem.",
            "year": "1984",
            "volume": "27",
            "issue": "10",
            "first_page": "1280",
            "last_page": "1286",
            "pubmed_id": "6481764",
            "doi": "10.1021/jm00376a009",
            "chembl_id": "CHEMBL1122610",
            "title": "Dichloro[1,2-bis(4-hydroxyphenyl)ethylenediamine]platinum(II) complexes: an approach to develop compounds with a specific effect on the hormone-dependent mammary carcinoma.",
            "doc_type": "PUBLICATION",
            "authors": "Wappes B, Jennerwein M, von Angerer E, Schönenberger H, Engel J, Berger M, Wrobel KH.",
            "abstract": "Stereoisomeric dichloro [1,2-bis(4-hydroxyphenyl)ethylenediamine]platinum(II) complexes (meso-3a, (+/-)-3b, (+)-3c, (-)-3d) and their N,N'-dibutyl derivatives (meso-4a, (+/-)-4b, (+)-4c, (-)-4d) were synthesized and tested on antitumor activity. The most active compound, 3d, shows a modest inhibition of the [3H]estradiol receptor interaction and causes a marked effect on the growth of the hormone-dependent human MCF 7 breast cancer cell line. It is also active on the hormone-independent human MDA-MB 231 breast cancer cell line, on the ADJ/PC6 plasmacytoma of the Balb/C mouse, and on the L 5222 leukemia of the BD IX rat. Apparently the inhibition of the MCF 7 cell line is not mediated by the estrogen receptor system. Histopathological studies on 3d revealed very low toxicity.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "8086",
            "journal": "J. Med. Chem.",
            "year": "1984",
            "volume": "27",
            "issue": "10",
            "first_page": "1291",
            "last_page": "1294",
            "pubmed_id": "6148422",
            "doi": "10.1021/jm00376a011",
            "chembl_id": "CHEMBL1122733",
            "title": "Synthesis and beta-adrenergic blocking activity of new aliphatic and alicyclic oxime ethers.",
            "doc_type": "PUBLICATION",
            "authors": "Bouzoubaa M, Leclerc G, Decker N, Schwartz J, Andermann G.",
            "abstract": "We describe the synthesis and pharmacological properties of two new series of aliphatic and alicyclic beta-adrenergic blockers, most of them containing a cyclopropyl ring. They belong either to 2-hydroxy-3-(tert-butylamino)propyl ether A or 2-hydroxy-3-tert-(butylamino)propyl ketoxime ether B derivatives. The O-[2-hydroxy-3-(tert-butylamino)propyl] dicyclopropyl ketoxime 5 exhibited a beta-adrenergic antagonist activity comparable to that of propranolol. It was found that ketoxime ethers B generally showed higher potency than the corresponding ethers A. We confirm that the presence of an aromatic nucleus is not crucial for the beta-adrenergic activity. Structure-activity relationships among these series are discussed.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "8088",
            "journal": "J. Med. Chem.",
            "year": "1984",
            "volume": "27",
            "issue": "10",
            "first_page": "1300",
            "last_page": "1305",
            "pubmed_id": "6090662",
            "doi": "10.1021/jm00376a013",
            "chembl_id": "CHEMBL1122612",
            "title": "7-(Ethoxycarbonyl)-6,8-dimethyl-2-phenyl-1(2H)-phthalazinone derivatives: synthesis and inhibitory effects on platelet aggregation.",
            "doc_type": "PUBLICATION",
            "authors": "Sugimoto A, Tanaka H, Eguchi Y, Ito S, Takashima Y, Ishikawa M.",
            "abstract": "7-(Ethoxycarbonyl)-6,8-dimethyl-2-phenyl-1(2H)-phthalazinone derivatives and several analogues were synthesized and their inhibitory effects on platelet aggregation were evaluated. Structure-activity relationships are discussed. All synthesized compounds showed no appreciable effect on platelet aggregation induced by adenosine diphosphate, but most of them inhibited effectively the arachidonic acid induced platelet aggregation. The parent compound, 2-phenyl derivatives, and ortho-substituted 2-phenyl derivatives show the most potent inhibition of all compounds.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "8089",
            "journal": "J. Med. Chem.",
            "year": "1984",
            "volume": "27",
            "issue": "10",
            "first_page": "1306",
            "last_page": "1312",
            "pubmed_id": "6481766",
            "doi": "10.1021/jm00376a014",
            "chembl_id": "CHEMBL1122613",
            "title": "A water-soluble cholesteryl-containing trisgalactoside: synthesis, properties, and use in directing lipid-containing particles to the liver.",
            "doc_type": "PUBLICATION",
            "authors": "Kempen HJ, Hoes C, van Boom JH, Spanjer HH, de Lange J, Langendoen A, van Berkel TJ.",
            "abstract": "The synthesis of a trisgalactoside-terminated cholesterol derivative is described. Tris(galactosyloxymethyl)-aminomethane is coupled to cholesterol by using glycyl and succinyl as intermediate hydrophilic spacer moieties. The resulting cholesteryl ester dissolves easily in water, forming monodisperse micelles. When added to dispersions of liposomes or plasma lipoproteins in water, the substance becomes incorporated rapidly into these structures, causing an increase of their buoyant density. Liposomes or low-density lipoproteins, preloaded with the substance, are rapidly cleared from the circulation and taken up by the liver after intravenous injection in rats. This uptake is inhibited by N-acetylgalactosamine but not by N-acetylglucosamine, indicating the specificity of this process.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "8090",
            "journal": "J. Med. Chem.",
            "year": "1984",
            "volume": "27",
            "issue": "10",
            "first_page": "1317",
            "last_page": "1321",
            "pubmed_id": "6481768",
            "doi": "10.1021/jm00376a016",
            "chembl_id": "CHEMBL1122614",
            "title": "Antiinflammatory activity of N-(2-benzoylphenyl)alanine derivatives.",
            "doc_type": "PUBLICATION",
            "authors": "Walsh DA, Sleevi MC, Sancilio LF.",
            "abstract": "A series of N-(2-benzoylphenyl)alanine derivatives were synthesized and tested for antiinflammatory activity in the Evans blue-carrageenan induced pleural effusion assay. The target compounds were envisioned to bind to a receptor site on the cyclooxygenase enzyme by a mechanism first proposed by Appleton and Brown. Of the 21 compounds prepared, two were found to be one-tenth as potent as indomethacin in the pleurisy model and one compound was tested and found to be weakly active in the adjuvant arthritis model.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        }
    ]
}