{
    "table_name": "EBI_CHEMBL.DOCS_25",
    "table_fullname": "EBI_CHEMBL.EBI_CHEMBL.DOCS_25",
    "column_names": [
        "first_page",
        "volume",
        "patent_id",
        "issue",
        "pubmed_id",
        "doc_id",
        "chembl_id",
        "abstract",
        "doc_type",
        "authors",
        "doi",
        "last_page",
        "ridx",
        "title",
        "src_id",
        "year",
        "journal"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "62217",
            "journal": "Bioorg. Med. Chem.",
            "year": "2012",
            "volume": "20",
            "issue": "12",
            "first_page": "3710",
            "last_page": "3718",
            "pubmed_id": "22607883",
            "doi": "10.1016/j.bmc.2012.04.049",
            "chembl_id": "CHEMBL2034823",
            "title": "Synthesis and antiviral activity of certain second generation methylenecyclopropane nucleosides.",
            "doc_type": "PUBLICATION",
            "authors": "Williams JD, Khan AR, Harden EA, Hartline CB, Jefferson GM, Keith KA, Prichard MN, Zemlicka J, Peet NP, Bowlin TL.",
            "abstract": "A second-generation series of substituted methylenecyclopropane nucleosides (MCPNs) has been synthesized and evaluated for antiviral activity against a panel of human herpesviruses, and for cytotoxicity. Although alkylated 2,6-diaminopurine analogs showed little antiviral activity, the compounds containing ether and thioether substituents at the 6-position of the purine did demonstrate potent and selective antiviral activity against several different human herpesviruses. In the 6-alkoxy series, antiviral activity depended on the length of the ether carbon chain, with the optimum chain length being about four carbon units long. For the corresponding thioethers, compounds containing secondary thioethers were more potent than those with primary thioethers.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "62220",
            "journal": "Bioorg. Med. Chem.",
            "year": "2012",
            "volume": "20",
            "issue": "12",
            "first_page": "3828",
            "last_page": "3836",
            "pubmed_id": "22608921",
            "doi": "10.1016/j.bmc.2012.04.034",
            "chembl_id": "CHEMBL2034825",
            "title": "Chemical syntheses and in vitro antibacterial activity of two desferrioxamine B-ciprofloxacin conjugates with potential esterase and phosphatase triggered drug release linkers.",
            "doc_type": "PUBLICATION",
            "authors": "Ji C, Miller MJ.",
            "abstract": "Two desferrioxamine B-ciprofloxacin conjugates with 'trimethyl-lock' based linkers that are designed to release the antibiotic after esterase or phosphatase-mediated hydrolysis were synthesized. The potential esterase-sensitive conjugate 13 displayed moderate to good antibacterial activities against selected ferrioxamine-utilizing bacteria, although the activities were lower than the parent drug ciprofloxacin. However, the potential phophatase-sensitive conjugate 23 was inactive against the same panel of organisms tested. These properties appeared to be related to the activating efficiency of the linker by the enzyme and to the outer membrane protein recognition of the chemically modified siderophore used in the conjugate.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "62800",
            "journal": "Bioorg. Med. Chem.",
            "year": "2012",
            "volume": "20",
            "issue": "12",
            "first_page": "3887",
            "last_page": "3897",
            "pubmed_id": "22575162",
            "doi": "10.1016/j.bmc.2012.04.025",
            "chembl_id": "CHEMBL2062379",
            "title": "Cleavage mechanism and anti-tumor activity of 3,6-epidioxy-1,10-bisaboladiene isolated from edible wild plants.",
            "doc_type": "PUBLICATION",
            "authors": "Kimura K, Sakamoto Y, Fujisawa N, Uesugi S, Aburai N, Kawada M, Ohba S, Yamori T, Tsuchiya E, Koshino H.",
            "abstract": "A bisabolane sesquiterpene endoperoxide compound, 3,6-epidioxy-1,10-bisaboladiene (EDBD), was isolated from edible wild plants grown in the northern area of Japan, Cacalia delphiniifolia and Cacalia hastata, using a mutant yeast (cdc2-1 rad9¿). It showed cytotoxicity at IC(50) = 3.4 ¿M and induced apoptosis against the human promyelocytic leukemia cell line HL60 through a new stable rearrangement product (1) when in the presence of FeSO(4). This conversion mechanism is different from another sesquiterpene endoperoxide lactone compound, dihydroartemisinin (DHA), which is an anti-malarial drug. The cytotoxicity of EDBD decreased in the presence of the ferrous ion chelating drug deferoxamine mesylate (DFOM), and this suggested that the structural change of the drug caused by Fe(2+) may be responsible for its biological activities. EDBD induced apoptosis via phosphorylation of p38 mitogen-activated protein kinase (MAPK) in HL60 cells, and was detected by Western blot. EDBD resulted in an immediate increase in DCF fluorescence intensity in HL60 cells using DCFH-DA (2',7'-dichlorofluorescin diacetate) assay. The in vitro reaction of EDBD with FeSO(4) also increased DCF fluorescence intensity in a dose dependent manner. These results showed that the biological activity of EDBD involves an unstable carbon-centered radical intermediate. Furthermore, there was no similarity between the JFCR39 fingerprints of EDBD and DHA (correlation coefficient on COMPARE Analysis ¿ = 0.158). EDBD showed anti-tumor effects against a xenograft of Lox-IMVI cells in vivo.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "82590",
            "journal": "J. Med. Chem.",
            "year": "1977",
            "volume": "20",
            "issue": "12",
            "first_page": "1572",
            "last_page": "1577",
            "pubmed_id": "592321",
            "doi": "10.1021/jm00222a007",
            "chembl_id": "CHEMBL3244035",
            "title": "Synthesis and hypoglycemic activity of 4-substituted 3-mercaptopicolinic acids.",
            "doc_type": "PUBLICATION",
            "authors": "Blank B, DiTullio NW, Deviney L, Roberts JT, Magnani A, Billig M, Saunders HL.",
            "abstract": "3-Mercapto-4-methylpicolinic acid one of very few compounds derived from 3-mercaptopicolinic acid (3-MPA) to have hypoglycemic activity. In an effort to find compounds with greater potency than 3-MPA, several 4-substituted 3-mercaptopicolinic acids (4-OMe, OC6H5, SMe, SH, Cl, NH2, Et; 1-7) were prepared and tested in 48-h fasted rats. None was hypoglycemic in this test system after oral dosing of 150 mg/kg.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "82591",
            "journal": "J. Med. Chem.",
            "year": "1977",
            "volume": "20",
            "issue": "12",
            "first_page": "1598",
            "last_page": "1607",
            "pubmed_id": "592325",
            "doi": "10.1021/jm00222a013",
            "chembl_id": "CHEMBL3244233",
            "title": "Synthesis and biological activities of some N6- and N9-carbamoyladenines and related ribonucleosides.",
            "doc_type": "PUBLICATION",
            "authors": "Dutta SP, Hong CI, Tritsch GL, Cox C, Parthasarthy R, Chheda GB.",
            "abstract": null,
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        }
    ]
}