{
    "table_name": "brf_sum_text_201708",
    "table_fullname": "patents-public-data.patentsview.brf_sum_text_201708",
    "column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "e11j4v0urppn1npvqdwid56p5",
            "patent_id": "4124616",
            "text": null
        },
        {
            "uuid": "i0pzeqf4cj0je54cxwhnzlwyi",
            "patent_id": "8819753",
            "text": "BACKGROUND 1. Field A multi-functional display device and a method for controlling the same are disclosed herein. 2. Background Multi-functional display devices and methods for controlling the same are known. However they suffer from various disadvantages."
        },
        {
            "uuid": "tu38pk69vq88sme8x6wij89zv",
            "patent_id": "9246494",
            "text": "FIELD The present disclosure is generally related to metering circuits, such as circuits configured to count signal peaks from a ringing signal to determine usage of a utility, for example. BACKGROUND Water and gas meters use a variety of measuring and sensing techniques. One method of sensing position and rotation of a metering apparatus uses inductor-capacitor (LC) sensing, which employs an LC resonant circuit. An LC meter interface may stimulate the LC resonant circuit and measure the response (a ringing waveform). SUMMARY In an embodiment, a method includes receiving a count corresponding to a number of peaks of a resonant signal that exceed a reference signal and comparing the count to a floating count window defined by a first count threshold and a second count threshold, the first count threshold is larger than the second count threshold. The method further includes selectively shifting the floating count window in a direction of the count when the count falls outside of the floating count window. In another embodiment, a metering circuit includes a first comparator including an input to receive a resonant signal, a second input to receive a reference signal, and an output. The metering circuit further includes a counter including an input coupled to the output and including an output to provide a count corresponding to a number of peaks of the resonant signal that exceed the reference signal. The metering circuit also includes a second comparator to compare the count to a floating count window defined by a first count threshold and a second count threshold and a controller coupled to an output of the comparator and configured to selectively shift the floating count window in a direction of the count. In still another embodiment, an apparatus includes a first comparator having a first input to receive an input signal, a second input to receive a reference signal, and an output. The apparatus further includes a counter having an input coupled to the output of the first comparator, and includes an output to provide a count. The apparatus also includes a count discriminator circuit to compare the count from the counter to a floating count window and to shift the floating count window to match the count when the count falls outside of the floating count window."
        },
        {
            "uuid": "wp35sa2vrxsnchhxxs5geh5m3",
            "patent_id": "4247980",
            "text": "The invention relates to apparatus for inserting an electrical contact into a through-cavity of a connector housing. The invention also relates to apparatus for feeding individual wires of a series of wires successively to spaced apart operating stations, for example, to a terminating station where the wires are stripped and terminated by electrical contacts and then to an insertion station where the terminated wires are inserted into respective cavities of a connector housing. According to one aspect of the invention, apparatus for inserting a contact terminating a wire into a housing through-cavity comprises means to locate the contact generally in alignment with the cavity and adjacent a rear face of the housing; a reciprocable contact guide of complementary shape to the contact mounted in alignment with the cavity adjacent a front face of the housing; and, means to insert the contact guide through the cavity from the front face into mating engagement with the contact and to insert the contact guided by the contact guide from the rear face into the cavity and to withdraw the contact guide from the cavity. According to another aspect of the invention, apparatus for feeding individual wires of a series of wires successively to spaced apart operating stations comprises a wire locating jig including an annulus or disc having a series of circumferentially closely spaced slots on one side for locating individual wires to extend radially in spaced relation from a wire bundle when located centrally of the jig, the jig being mounted for stepped rotation past a first operating station, a wire transfer mechanism comprising a plurality of widely circumferentially spaced wire gripping jaws mounted for stepped rotation in the same direction as the jig past the first and a second operating station, the jaws being movable axially of the jig from the other side of the jig to grip and remove a wire from a slot and transfer the wire from the first to the second operating station in synchronism with the jig movement. The invention includes apparatus for terminating wires with electrical contacts at a first operating station and inserting the contacts into respective through-cavities of a connector housing at a second operating station spaced apart from the first operating station."
        },
        {
            "uuid": "r889ol37ev9ywg19o7hvb5d4n",
            "patent_id": "9571521",
            "text": "CROSS-REFERENCE TO RELATED APPLICATION(S) This application claims the benefit under 35 U.S.C. &#xa7;119(a) of a Korean patent application filed on Apr. 17, 2014 in the Korean Intellectual Property Office and assigned Serial number 10-2014-0046041, the entire disclosure of which is hereby incorporated by reference. TECHNICAL FIELD The present disclosure relates to a method for processing received data in an electronic device and to an electronic device therefor. BACKGROUND When a message is received by an electronic device, a malicious application included in the electronic device may intercept and modify or delete the message. To prevent a message from being modified or deleted by a malicious application in an electronic device, some of services provided in the electronic device may not be used. The above information is presented as background information only to assist with an understanding of the present disclosure. No determination has been made, and no assertion is made, as to whether any of the above might be applicable as prior art with regard to the present disclosure. SUMMARY Aspects of the present disclosure are to address at least the above-mentioned problems and/or disadvantages and to provide at least the advantages described below. Accordingly, an aspect of the present disclosure is to provide a method for preventing a message from being modified or deleted by a malicious application when the message is received by an electronic device based on a service provided in the electronic device and an electronic device therefor. In accordance with an aspect of the present disclosure, a method for preventing a message from being modified is provided. The method includes successively transferring at least two received messages in a sequence filter, and determining whether data of the at least two received messages are identical to each other. In accordance with another aspect of the present disclosure, an electronic device is provided. The electronic device includes a communication interface configured to receive at least two messages, and a processor configured to control to successively transfer the at least two received messages in a sequence filter, and to determine whether data of the at least two received messages are identical to each other. Other aspects, advantages, and salient features of the disclosure will become apparent to those skilled in the art from the following detailed description, which, taken in conjunction with the annexed drawings, discloses various embodiments of the present disclosure."
        }
    ]
}