{
    "table_name": "brf_sum_text_201908",
    "table_fullname": "patents-public-data.patentsview.brf_sum_text_201908",
    "column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "bjojhdx379gof6rl10rxrrpri",
            "patent_id": "9165286",
            "text": "2. TECHNICAL FIELD This application relates to electronic collaboration tools and applications. In particular, this application relates to integration of collaboration tools and applications into electronic business applications. 3. BACKGROUND Business applications, such as those used to perform management consulting, banking, insurance etc. services, often use a complex set of resources and personnel to serve a client's needs. The resources and personnel needed to meet a client's needs may vary throughout a particular business process. With today's business and technology requirements, creating a cost-effective collaboration infrastructure that effectively identifies and leverages a business' best personnel and resources for a given task can be challenging."
        },
        {
            "uuid": "dkks4ytxy6xvgkaqagnctxgk1",
            "patent_id": "6720131",
            "text": "SUMMARY OF THE INVENTION The invention is specifically directed to the development of lithographic printing plates and comprises a novel system and method for applying the thin film of developer solution to each plate in a controlled manner using a jetting printhead (commonly referred to as an inkjet printer) as a coating device operating in a continuous mode as the plate is conveyed through the developer station. The developer solution is allowed to dwell on the plate as it is conveyed across a horizontal support structure for a sufficient time to allow for percolation into and/or dissolution of the soluble areas of the coating. The invention permits and includes the processing of plates passing side-by-side through the developer and at different intervals."
        },
        {
            "uuid": "zzef7z8ps7ahsozs71us5tk0h",
            "patent_id": "8143654",
            "text": "Embodiments of the present invention relate generally to the field of integrated circuits, and more particularly to a monolithic microwave integrated circuit with a diamond layer. BACKGROUND Monolithic microwave integrated circuits (MMICs) are integrated circuits designed to operate in millimeter-wave and microwave frequency ranges (e.g., 1 gigahertz (GHz) to 300 GHz). A gallium nitride (GaN)—based MMIC typically includes an active layer of aluminum gallium nitride/GaN (AlGaN/GaN) disposed on a suitable buffer layer. The buffer layer is, in turn, disposed on a silicon carbide (SiC) substrate. Active devices may be disposed on the AlGaN/GaN layer opposite the SiC substrate. After MMIC fabrication is completed, the SiC substrate must be thick enough, e.g., greater than approximately 50-75 micrometers (μm), to prevent unacceptable transmission losses in transmission lines coupled to the active devices. At such a thickness, the flexibility of employing different types of materials for the substrate is limited."
        },
        {
            "uuid": "z0uatei4noinrmxc9ughhhh6p",
            "patent_id": "7990950",
            "text": "An embodiment of the invention is directed to operating fax messaging services. Other embodiments are also described and claimed. BACKGROUND Fax messaging continues to be an important avenue for easy delivery of secure messages between individuals worldwide. Fax messaging continues to be important, despite the proliferation of data services that use the Internet. The send and receive fax messaging services operated by j2 Global Communications of Hollywood, Calif. are appropriate examples. With the j2 Send service, a fax message is transmitted through the public switch telephone network via fax protocol, on behalf of a subscriber to the service. Typically, a user that subscribes to the service is instructed to attach a document that is to be faxed to an email message, and address the email message to a j2 Global domain name, with the destination fax number as the prefix. This email is then sent, from the user's Internet connected computer, to the j2 Global internal network where it is converted and then transmitted as a fax transmission. This is also referred to as an outbound service. Fax messaging services may also include an inbound (or receive) service, such as j2 Receive, where a subscriber is assigned a unique, direct inward dial (DID) telephone number which the user distributes to others who may wish to send a fax to the user. This telephone number is in effect the user's individual fax number. When an incoming fax is received at a particular DID number, the j2 Global internal network converts the received fax transmission into a format that is compatible with an email protocol. An image file containing the received fax image is attached to an email that is then sent to the subscriber's email address. The subscriber may then access her email account, select the email that includes a received fax, detach the image file and display the file on her Internet connected computer to view the received fax transmission. The promotion of such fax messaging services have until now been quite limited in their approach."
        },
        {
            "uuid": "8aunvx5nmbna7q2yjkss3olly",
            "patent_id": "8156517",
            "text": "CROSS REFERENCE TO RELATED APPLICATIONS This application is related to U.S. patent application Ser. No. 12/346,416 entitled “Methods and Apparatus to Enforce a Power Off State of an Audience Measurement Device During Shipping,” and U.S. patent application Ser. No. 12/346,423 entitled “Methods and Apparatus to Enforce a Power Off State of an Audience Measurement Device During Shipping,” the contents of which are incorporated herein by reference in their entirety. FIELD OF THE DISCLOSURE The present disclosure relates generally to audience measurement and, more particularly, to methods and apparatus to enforce a power off state of an audience measurement device during shipping of the device. BACKGROUND Media-centric companies are often interested in tracking the number of times that audience members are exposed to various media compositions (e.g., television programs, motion pictures, internet videos, radio programs, etc.). In some instance, to track such exposures, companies generate audio and/or video signatures of media compositions (e.g., a representation of some, preferably unique, portion of the media composition or the signal used to transport the media composition) that can be used to determine when those media compositions are presented to audience members. The media compositions may be identified by comparing the signature to a database of reference signatures. Additionally or alternatively, companies transmit identification codes (e.g., watermarks) with media compositions to monitor presentations of those media compositions to audience members by comparing identification codes retrieved from media compositions presented to audience members with reference identification codes stored in a reference database. Like the reference signature, the reference codes are stored in association with information descriptive of the corresponding media compositions to enable identification of the media compositions. Media ratings and metering information are typically generated by collecting media exposure information from a group of statistically selected households. Each of the statistically selected households typically has a data logging and processing unit such as, for example, a stationary or portable media measurement device, commonly referred to as a “metering device” or “meter.” The meter typically includes sensors to gather data from the monitored media presentation devices (e.g., audio-video (AV) devices) at the selected site and deliver the gathered data to a centralized location for processing."
        }
    ]
}