{
    "table_name": "claim_201908",
    "table_fullname": "patents-public-data.patentsview.claim_201908",
    "column_names": [
        "uuid",
        "patent_id",
        "text",
        "dependent",
        "sequence",
        "exemplary"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "uuid",
        "patent_id",
        "text",
        "dependent",
        "sequence",
        "exemplary"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "psi5u0ko6d1oqhswca0rdifk7",
            "patent_id": "7200296",
            "text": "2. The monolithic photonic integrated circuit (PIC) chip of claim 1 wherein the first wavelength tuning elements are temperature changing elements, current and voltage changing elements or bandgap changing elements.",
            "dependent": "1",
            "sequence": "2",
            "exemplary": "FALSE"
        },
        {
            "uuid": "ties8ghnguogijj60u2i61vth",
            "patent_id": "8096905",
            "text": "2. The arrowhead of claim 1 further including a stop: a. protruding from at least a portion of the second section of the rearward body portion, and b. extending rearwardly from the rearward spring end.",
            "dependent": "1",
            "sequence": "2",
            "exemplary": "False"
        },
        {
            "uuid": "03eqxwg4mbczlax07rcgpompg",
            "patent_id": "7276921",
            "text": "2. The test device of claim 1 wherein the features for contacting a ground plane are associated with a secondary side of the device under test.",
            "dependent": "1",
            "sequence": "2",
            "exemplary": "False"
        },
        {
            "uuid": "7cykw85dr88a85hdmklhl3h8s",
            "patent_id": "9967187",
            "text": "2. The method of claim 1 , wherein: performing two or more hash operations includes performing N hash operations on the lookup key using N hash functions to compute N hashed lookup key segments, N being an integer greater than one; and querying a database includes querying a database distributed among N memory banks, each of the N memory banks corresponding to a different one of the N hash functions.",
            "dependent": "1",
            "sequence": "2",
            "exemplary": "False"
        },
        {
            "uuid": "er1cx5mq8d3pmipd2nca6ycvg",
            "patent_id": "10231175",
            "text": "2. The general sensor according to claim 1 , wherein said controller is further configured for: detecting a second access point through said short range communications interface; receiving operating instructions for said at least one sensor from said second access point; and determining whether at least one of said at least one sensors should operate according to said operating instructions, and, if so, causing said least one of said at least one sensor to operate according to said operating instructions.",
            "dependent": "1",
            "sequence": "2",
            "exemplary": "False"
        }
    ]
}