{
    "table_name": "claims_2021",
    "table_fullname": "patents-public-data.patentsview.claims_2021",
    "column_names": [
        "uuid",
        "patent_id",
        "text",
        "dependent",
        "sequence",
        "num",
        "exemplary"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "INT64"
    ],
    "nested_column_names": [
        "uuid",
        "patent_id",
        "text",
        "dependent",
        "sequence",
        "num",
        "exemplary"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "INT64"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "9105a4a1-974e-11eb-9615-121df0c29c1e",
            "patent_id": "D907419",
            "text": "The ornamental design for a combined pedestal base, support bracket, and height adjustment button for adjustable height table, as shown and described.",
            "dependent": null,
            "sequence": 0,
            "num": "00001",
            "exemplary": 0
        },
        {
            "uuid": "91061d8f-974e-11eb-9615-121df0c29c1e",
            "patent_id": "D907549",
            "text": "The ornamental design for a top piece spoiler, as shown and described.",
            "dependent": null,
            "sequence": 0,
            "num": "00001",
            "exemplary": 0
        },
        {
            "uuid": "910835ef-974e-11eb-9615-121df0c29c1e",
            "patent_id": "RE48393",
            "text": "21. The system of claim 20, wherein the controller is further configured to, using the communication device, transmit the stored milling rate information associated with geographical information from the position information to an off-board computer and the off-board computer is configured to transmit the stored milling rate information associated with geographical information from the position information to the second memory device.",
            "dependent": null,
            "sequence": 20,
            "num": "00021",
            "exemplary": 0
        },
        {
            "uuid": "91085008-974e-11eb-9615-121df0c29c1e",
            "patent_id": "RE48394",
            "text": "13. A thermal shield for inhibiting a transfer of heat between components on a vehicle, the thermal shield comprising: a outer shell layer formed from a solid and impermeable material having a first surface, a second surface a perimeter, and at least one curved portion, the outer shell layer forming a shape in three-dimensions; an insulation layer contacting the first surface and substantially conforming to the shape of the outer shell layer, the insulation layer being formed from at least one layer of dried fibrous insulation material; an inner shell layer formed from a solid and impermeable material coupled to the perimeter of the outer shell layer and covering an opposite surface of the insulation layer; wherein the insulation layer further comprises a first layer of dried fibrous insulation material formed from silica fibers and a second layer of dried fibrous insulation material formed from fiberglass fibers.",
            "dependent": null,
            "sequence": 12,
            "num": "00013",
            "exemplary": 0
        },
        {
            "uuid": "91088fb1-974e-11eb-9615-121df0c29c1e",
            "patent_id": "RE48396",
            "text": "30. An apparatus that is in a first hyper cell including a first plurality of base stations and in a second hyper cell including a second plurality of base stations, the apparatus comprising: at least one processor, wherein the at least one processor is configured to: receive, from a base station in a network system, a first synchronization channel associated with the first hyper cell in the first hyper cell; and receive, from the base station, a second synchronization channel associated with the second hyper cell in the second hyper cell, the first synchronization channel associated with the first hyper cell and the second synchronization channel associated with the second hyper cell being carried in a single frequency network by applying frequency division multiplexing (FDM), wherein the first plurality of base stations includes the base station, wherein the second plurality of base stations includes the base station, wherein the base station shares a first cell identifier (ID) with other base stations of the first plurality of base stations, and wherein the base station shares a second cell ID with other base stations of the second plurality of base stations.",
            "dependent": null,
            "sequence": 29,
            "num": "00030",
            "exemplary": 0
        }
    ]
}