{
    "table_name": "detail_desc_text_2021",
    "table_fullname": "patents-public-data.patentsview.detail_desc_text_2021",
    "column_names": [
        "patent_id",
        "text",
        "length"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "INT64"
    ],
    "nested_column_names": [
        "patent_id",
        "text",
        "length"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "INT64"
    ],
    "description": [
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "patent_id": "11012989",
            "text": "DETAILED DESCRIPTION OF THE PREFERRED EMBODIMENTS\n\nHereinafter, exemplary embodiments of the present invention will be described in detail with reference to the accompanying drawings, wherein like reference numerals are used to designate identical or similar elements, and redundant description thereof will be omitted. The suffix “part” and “node”, “axis” and “dimension”, “module” and “part”, “unit” and “part” for the components used in the following description are to be provided or mixed solely in consideration of ease in preparing the specification, and does not per se have a meaning or a role mutually distinguishable of one from the other.\n\nIn addition, in the following description of the embodiments of the present invention, a detailed description of related arts will be omitted when it is determined that the gist of the embodiments disclosed herein may be blurred. Also, it is to be understood that the accompanying drawings are merely to provide a further understanding of the embodiments disclosed in this specification, and the technical spirits disclosed in this specification shall not be limited by the accompanying drawings, and that all changes, equivalents, and alternatives falling within the spirit and technical scope of the present invention are included.\n\nIt is to be understood that terms including ordinals, such as first, second, etc., may be used to describe various elements, but the elements are not limited to these terms. The terms are used only for the purpose of distinguishing one element from the other.\n\nIt is also to be understood that, when an element is referred to as being “connected” or “coupled” to another element, it may be directly connected or coupled to the other element, and on the other hand, when an element is referred to as being “directly connected” or “directly coupled” to another element, it should be understood that there are no other elements in between.\n\nA singular expression includes plural expressions unless the context clearly dictates otherwise.\n\nIn the present application, the terms “comprises”, “having”, and the like are intended to specify the presence of stated features, numbers, steps, operations, elements, components, or combinations thereof, but do not preclude the presence or addition of one or more other features, numbers, steps, operations, elements, components, or combinations thereof.\n\nFurthermore, the phrase of “in the water” may be interchangeably used with a word of “underwater”.\n\nHereinafter, exemplary embodiments of the present invention will be described in detail with reference to the drawings. It will be apparent to those skilled in the art that the present invention may be embodied in other specific forms without departing from the spirit or essential characteristics thereof.\n\nFIG. 1is a schematic view illustrating a general underwater communication network used for underwater communication solely illustrated to help understand the present invention.\n\nAs shown inFIG. 1, the underwater communication network may include a plurality of sensor nodes (1), a sink node (5), and an intermediate node (3) serving as an information transferring function between the sensor node (1) and the sink node (5).\n\nThe transmission of underwater information in the underwater communication network constructed as described above may be performed as follows:\n\nThe underwater information detected from a plurality of sensor nodes (1) may be transmitted to the sink node (5) through the intermediate node (3) comprised of a transmission-desired sensor node (1) in several stages.\n\nHowever, the said underwater communication network suffers from disadvantages in that the transmission of underwater information detected from the sensor node (1) to the sink node (5) requires that several stages of intermediate nodes (3) must be passed. As a result, a complicated routing algorithm for transmitting the detected underwater information is required in order to transmit the detected underwater information in the underwater communication network connected from the sensor node (1) and the several-staged intermediate node (3) to the sink node (5).\n\nIn addition, when a transmission error occurs in the process of transmitting the underwater information from the sensor node (1) to the sink node (5), the above-mentioned underwater communication network may come to be inconvenient in re-transmission of the detected underwater information.\n\nFurthermore, when the problem occurs in the intermediate node for transmitting the underwater information due to the fact that the underwater communication network must pass through the intermediate nodes (3) at various stages, the underwater communication network undergoes a drawback in that the sensor node involved with the problem-generated intermediate node cannot be used.\n\nBecause of the said problems, the general underwater communication network shown inFIG. 1is inevitably deteriorated in use efficiency of equipment, including data transmission efficiency in the process of acquiring and transmitting various types of underwater information. Thus, the present invention is provided to implement a centrally-controlled (centralized control type) underwater communication network by improving the foregoing drawbacks.\n\nIn the following description of the present invention, “frequency band” and “frequency” may be interchangeably used in some cases. Since the “frequency” refers to a frequency included in the “frequency band”, and the frequency substantially carries the same signal in frequencies in a certain range of the frequency, the two expressions of “frequency band” and “frequency” may be used as having the same meaning.\n\nFIG. 2is a schematic conceptual view explaining a centrally controlled underwater communication network implemented to explain conceptually an underwater communication method according to an exemplary embodiment of the present invention.\n\nThe centralized control type underwater communication network according to an exemplary embodiment of the present invention may be configured by connecting sensor nodes in a centralized manner in an underwater environment.\n\nThe centralized control type underwater communication network may include at least one or more sensor nodes (10). The sensor node (10) may be installed in a fixed or movable manner in an underwater environment. The sensor node (10) may be installed as many number as possible in order to acquire lots of underwater information.\n\nThe centralized control type underwater communication network may include a central node (20) for collecting underwater information acquired from the plurality of sensor nodes (10). The central node (20) may function to transmit the underwater information collected by the plurality of sensor nodes (10) to a ground network (not shown).\n\nThe centralized control type underwater communication network configured as described above may be generally controlled as under:FIG. 3is a schematic view illustrating a process of dividing a frequency band for underwater communication within a limited frequency bandwidth according to an exemplary embodiment of the present invention.\n\nReferring toFIG. 3, the underwater communication conducted between the central node (20) and the plurality of sensor nodes (10) may be basically performed by ultrasonic waves. Furthermore, an entire frequency band useable by the central node (20) may be divided into a forward frequency band and a reverse frequency band. Here, the entire frequency band useable by the central node (20) means a frequency band included for underwater communication-enabled region between the central node (20) and the sensor node (10) installed at mutually different distances. That is, the entire frequency band useable by the central node (20) means a frequency band where a signal can be transmitted from a central node (20) to a sensor node (10) installed at an arbitrary position, and a signal transmitted from the censor node (10) can be received for use at the central node (20).\n\nThe forward frequency band may be used when a signal is transmitted from a central node (20) to a plurality of sensor nodes (10). The frequency band used at this time is set to be a lowest frequency band (f)) among the frequency bands useable by the central node (20).\n\nGenerally, the communication range increases as a frequency to be transmitted and received becomes lower in the underwater communication environment. Therefore, when a signal is transmitted from the central node (20) to the sensor node (10), the signal reception must be available for all sensor nodes regardless of distances. As a result, the frequency band (f0) having the lowest frequency may be determined to be a forward frequency band, which is then used for signal transmission from the central node (20) to the plurality of sensor nodes (10).\n\nMoreover, a reverse frequency band may be used for performance of signal transmission from each of the plurality of sensor nodes (10) to the central node (20). Here, all the remaining frequency bands except for the forward frequency band may be included in the reverse frequency band in all the useable frequency bands.\n\nThe reverse frequency band may be further divided into a plurality of small frequency bands. At this time, the division into small frequency bands may be performed in such manner that sensor nodes capable of transmitting and receiving signals in the same frequency band between a distance from the sensor node based on the central node may be grouped by a same region, and the grouped region may be divided into the number of small frequency bands (M numbers, described later) as many as the number of the divided regions.\n\nFurthermore, the respectively divided small frequency bands may be so allocated as to be used for signal transmission of the sensor node (10) respectively installed at different positions. For example, the frequency band (f1) may be allocated to a sensor node (10) located at the farthest distance from the central node (20). In addition, a frequency band (fM) may be allocated to a sensor node (10) located nearest to the central node (20).\n\nIn this case, a sensor node (10) located at the farthest distance from the center node (20) may be allocated to the lowest frequency band in the frequency bands included in the reverse frequency band based on the central node (20). Conversely, the highest frequency band in the frequency bands included in the reverse frequency band may be allocated to a sensor node (10) located closest to the center node (20). As briefly mentioned in the foregoing discussion, the frequency (f1) in the lower frequency band may be allocated to the longest distance communication frequency, because the communication range increases as the frequency to be transmitted and received becomes lower in the underwater communication environment. Moreover, the frequency (IM) in the highest frequency band may be allocated to the shortest communication frequency.\n\nFrequency bands for underwater communication may be allocated to the respective sensor nodes (10) through these processes, and thereafter, the underwater communication may be performed where the underwater information detected by the sensor node (10) is transmitted to the central node (20) using the frequency band allocated with the underwater information detected by the sensor node (10).\n\nNext,FIG. 4is a schematic view illustrating a process of allocating a same frequency band to a plurality of sensor nodes in response to a communication distance within a limited frequency bandwidth according to an exemplary embodiment of the present invention.\n\nUnderwater communications may be more affected by environmental factors compared to ground communications. Therefore, in the process of detecting underwater information using the underwater sensor in the sensor node (10), the loss of the sensor nodes (10) due to environmental influences cannot be avoided. Furthermore, even if an arbitrary sensor node (10) normally detects underwater information, the data transmission success rate cannot always be satisfied by 100% in the course of the detected underwater information being transmitted to the central node (20). Hence, as long as the condition of the underwater communication network is permitted, installation of as many sensor nodes (10) as possible may enable to obtain more accurate and more diversified underwater information.\n\nMeanwhile, as shown inFIG. 4, there may be available a region capable of transmitting a signal using the same frequency band between the central node (20) and the sensor node (10). That is, the sensor nodes existing on a region1included in the nearest distance based on the central node (20) may be equally allocated with the divided frequency band (Fm). Moreover, the sensor nodes existing on a region (M) included in the farthest distance based on the central node (20) may be equally allocated with the divided frequency band (f1).\n\nThe regional division to a same region or to different region between the central node (20) and the sensor node (10) may be realized within a signal transceivable range between the central node (20) and the sensor node (10). That is, sensor nodes capable of conducting the underwater communication using the same frequency band (fM) may be included in the region1. In addition, sensor nodes capable of conducting the underwater communication using the same frequency band (f1) may be included in the region M.\n\nThe reason the same frequency band is allocated to a plurality of sensor nodes is that the frequency band useable in the central node (20) is limited. For example, in order to acquire underwater information more accurately and more diversely, there is no way but to increase the number of sensor nodes. In this case, there may be generated an instance where the number of sensor nodes (10) installed in the entire frequency band useable by the central node (20) are greater than that of divided reverse frequency bands. At this time, as illustrated inFIG. 4, sensor nodes existing in the same region may be controlled in underwater communication by being allocated with the same frequency band.\n\nWhen the same frequency band is allocated to a plurality of sensor nodes as described above, a plurality of sensor nodes (10) in the same region allocated with the same frequency band can perform the communication with the central node20under the control of central node (20) using various multiple access schemes (frequency division multiple access scheme, a time division multiple access scheme, a code division multiple access scheme, a carrier sensing multiple access scheme, and the like). A detailed description of the known multiple access scheme will be omitted hereinafter.\n\nNext, a process of detecting distance information from a central node to a sensor node may be required in order to enable an adaptive communication in response to the distance between the central node and the sensor node in the underwater communication network according to the exemplary embodiment of the present invention. Prior to advancing to the explanation of said process, a schematic configuration for transmission and reception of underwater information between the central node and the sensor node according to the present invention will be described.\n\nFIG. 5is a conceptual view explaining an overall underwater communication method according to an exemplary embodiment of the present invention,FIG. 6is a conceptual view illustrating a schematic configuration of a sensor node in order to explain an underwater communication method according to an exemplary embodiment of the present invention, andFIG. 7is a conceptual view illustrating a schematic configuration of a central node in order to explain an underwater communication method according to an exemplary embodiment of the present invention.\n\nReferring toFIG. 5, a plurality of sensor nodes (10) collects underwater information and transmits the collected information to a central node (20).\n\nAt this time, underwater information is transmitted and received between the plurality of sensor nodes (10) and the central node (20) using the ultrasonic wave, which enables signal transmission in an underwater communication network (50) in light of characteristics of the medium.\n\nAt this time, a position data (information) of sensor node (10) may be also transmitted when signals are transmitted from the sensor nodes (10) to the central node (20). The position information of the sensor node (10) is preferably recorded and stored in the sensor node (10) at a time when the sensor node (10) is installed at an arbitrary position in the water. However, it is difficult for the sensor node (10) to be fixedly installed due to the characteristics of the underwater environment. Therefore, although the position data is described as the position information in the above-mentioned explanation, it is preferable that the position information be simply understood as sensor node (10) identification information.\n\nThe central node (20) may transmit the underwater information collected from the plurality of sensor nodes (10) to the ground. The central node (20) may transmit the underwater information acquired by a management node (64) of a terrestrial communication network (60). Accordingly, the central node (20) may perform underwater communication with a plurality of sensor nodes (10) in the underwater communication network (50) and may perform communication with the management node (64) on the ground. The management node (64) may conduct a function of connecting the underwater information transmitted through the central node (20) to the ground communication network (62) using a radio signal.\n\nReferring now toFIG. 6, the sensor node (10) may include one or more sensor units (30) for collecting necessary data from underwater, a data transmission unit (36) for modulating the data sensed by each sensor unit (30), converting the sensed data into ultrasonic waves, and transmitting the data to a central node (20), and a data receiving unit (38) for receiving and demodulating ultrasound signals transmitted from the central node (20).\n\nThe data transmission unit (36) and the data receiving unit (38) may be included in a transceiver unit (40), and a control unit (32) for performing the control between the sensor unit (30) and the transceiver unit (40) may be further included. Furthermore, the sensor node (10) may be configured by including a memory (34) and the like for storing various data and algorithms required for the overall operational control of the sensor node (10) and for storing the underwater information detected by the sensor unit (30).\n\nThe plurality of sensor units (30) may sense various kinds of underwater information including water temperature, dissolved oxygen amount, seismic wave in response to their purposes and output the sensed data to the control unit (32). The sensor unit (30) may be a digital sensor, but the sensor unit (30) may be so configured as to convert data detected in an analog signal into digital data and output the digital data. In this case, the sensor unit (30) may include an analog-to-digital converter for converting an analog signal into a digital signal. Furthermore, in all the configurations of the present invention, it should be appreciated that the signal-processed data is based on a digital signal.\n\nThe transceiver unit (40) may perform the function of transmitting or receiving data by using ultrasonic waves in the water. That is, the data transmission unit (36) may modulate the underwater information detected by the sensor unit (30), convert the detected underwater information into an ultrasonic signal, and transmit the ultrasonic signal to the central node (20). The data receiving unit (38) may receive and demodulate the ultrasound signals transmitted from the central node (20), and output the ultrasound signals to the control unit (32).\n\nThe illustrated sensor node (10) may receive the underwater information transmitted from the central node (20) via the data receiving unit (38). At this time, in order to enable reception of the signal transmitted from the central node (20), the data receiving unit (38) may set the frequency to a frequency included in the forward frequency band. Furthermore, the data transmission unit (36) may be set to a specific frequency included in the frequency band allocated to itself, and transmit information to be transmitted to the central node (20) via the previously set specific frequency. Therefore, the transceiver unit (40) may include a configuration in which the frequency is set wider a control of the control unit (32). Such a configuration is implemented by a known art, and therefore, further explanation thereto is to be omitted. The control may be implemented in such a manner that, in an initial setting process in which frequency of each sensor node (10) is not set, the frequency is set at the forward frequency band at the time of receiving the signal from the central node (20), and the frequency is set at the lowest frequency band among the divided reverse frequency bands when the signal is transmitted to the central node (20) before the initial setting.\n\nFurthermore, although the sensor node (10) in the present invention may be fixedly installed at a specific position in an underwater environment, it should be inevitable to allow the sensor node (10) to be moved only within a certain region because of the influence of ocean currents. Since the sensor node (10) tends to be moved in this way, it is preferable that the distance measurement with the central node20be performed in real time when the underwater information measurement is performed. However, if the real-time control is unreasonable, it may be preferable to repeatedly measure at intervals avoiding a time when underwater communication is performed. Since a use frequency against distance may be changed, the sensor node (10) may require a real-time variable control of the useable frequency band for the underwater communication with the central node (20).\n\nUnder this circumstance, it is preferable that the transceiver unit (40) of the sensor node (10) be so configured as to enable a variable control of the set frequency. That is, a frequency for transmitting the information may be variably controlled in response to a current position of the sensor node (10) to allow the to-be-transmitted information to be transmitted to the central node (20). Furthermore, it is preferable that the movement position of the sensor node (10) be limited only to within a certain radius in which signals can be transmitted and received to and from the central node (20), whereby the risk of the sensor node (10) is prevented from being lost.\n\nThe control unit (32) may perform a control of storing various kinds of underwater information detected by the sensor unit (30) in the memory (34) or may control the transmission and reception of underwater information performed through the transceiver unit (40).\n\nIn addition, the control unit (32) may perform a control of detecting a distance between the sensor node (10) and the central node (20). Toward this end, the control unit (32) may include a configuration in which a reference signal transmitted from the central node (20) for distance detection is received by the data receiving unit (38) and magnitude of the received power is detected. The power intensity of the reception signal may be detected by a simple calculation process by directly detecting the power of the reception signal or detecting the current, voltage, and the like. The received power magnitude detection configuration is applicable to various techniques including a well-known power detector. The current magnitude can be easily detected by providing a current detecting resistor in the receiving unit. Since these detection processes utilize the known technique, the detailed description thereof will be omitted. A distance estimation using the detected power intensity of the reception signal may be implemented by using a ‘distance versus power intensity value’ pre-stored in the memory (34).\n\nMoreover, as another method for distance detection, the control unit (32) may detect a delay time, which is a time taken to reach the sensor node (10), after a signal is transmitted from the central node (20). The delay time may be detected, for example, by comparing a difference between time information at which the signal transmission starts at the central node (20) and time information at which the signal arrives. In order to detect the arrival time information, it is preferable that the control unit (32) include a time counting function and the like. In the distance estimation using the detected delay time, it is possible to estimate the distance using a ‘delay time verses distance value’s; pre-stored in the memory (34).\n\nThe memory (34) may be used or needed by the sensor node (10) and may be used for storing various kinds of information. The detected information by the sensor unit (30) may be also stored in the memory (34). Particularly, when the distance is directly detected by the sensor node (10), the memory (34) may store various types of information to be used for distance detection. For example, the memory (34) may store information for determining the strength of the received power, information for detecting the delay time, information for determining the distance between the central node (20) and the sensor node (10) using the received power, frequency band information capable of underwater communication according to the estimated distance information, and the like. The controller (32) may perform the processes for distance estimation, a specific frequency band request, and the like, using the various types of information stored in the memory (34).\n\nReferring toFIG. 7, the central node (20) may include a first transceiver unit (22) for transmitting and receiving underwater signals to and from the sensor node (10), and a second transceiver unit (21) for transmitting and receiving underwater signals to and from the management node (64). The central node (20) may include a control unit (28) for controlling the first and second transceiver units and for controlling information storage, and a memory (29) for storing various types of information. It is preferable that the second transceiver unit (21) be so configured as to enable to transmit ultrasonic waves based on whether the position of the central node (20) is above the water surface or below the water surface, or to transmit with a radio signal.\n\nIn addition, the central node (20) may include a frequency divider (27) for dividing the entire usable frequency band into a forward frequency band and a reverse frequency band, and further dividing the reverse frequency band into small frequency bands. The frequency divider (27) may be included in the first transceiver unit (22) because the frequency divider (27) may be used when transmitting and receiving the underwater information with the sensor node (10).\n\nThe frequency divider (27) may be so configured as to enable to divide the entire frequency band available in the central node (20) into frequency bands as small as the number of regions (M), as shown inFIG. 4. Therefore, the control unit (28) may control the frequency division of the frequency divider (27), and control the frequency divider (27) to divide the frequency of the frequency divider (27) into a relevant frequency when transmitting/receiving signals to/from an arbitrary sensor node (10) so that transmission and reception of signals can be normally performed.\n\nA data transmission unit (26) in the first transceiver unit (22) may be set to a forward frequency band (f0) to allow signal transmission to all the sensor nodes. A data receiving unit (24) in the first transceiver unit (22) may be set to all the reverse frequencies existing within a frequency band allocated to an arbitrary sensor node which is to perform the underwater communication. However, in the initial setting process in which no frequency is set in each sensor node (20), the data receiving unit (24) is set to the lowest frequency band among the divided reverse frequencies. This is because the sensor node (10) can receive a signal transmitted from a sensor node existing at all distances before frequency setting is performed.\n\nTo this end, a frequency division may be performed through the frequency divider (27) under a control of the control unit (28), and a series of processes of setting the frequency of the data receiving unit (24) may be controlled by the divided frequency. The frequency dividing operation of the frequency divider may be preferably performed in a digital manner. In addition, the data receiving unit (24) may include a frequency variable control structure to enable normal signal reception during signal transmission/reception with all the sensor nodes.\n\nIn addition, the control unit (28) may perform the control of distance detection between the sensor node (10) and the central node (20) in accordance with power management and traffic control for each sensor node (10) and multiple accesses control and necessity relative to the sensor nodes (10) existing at a similar distance with traffic control.\n\nIn the present invention, although it is possible for the control unit (32) of the sensor node (10) to perform the distance detection process, the control unit (28) of the central node (20) may also perform the distance detection process.\n\nTherefore, the control unit (28) may include a configuration in which the reference signal transmitted from the sensor node10for distance detection is received by the data receiving unit (24) at the initial setup process where the frequency of the sensor node is not set, and the size of received power is detected. The power intensity of the reception signal may be detected by directly detecting the power of the reception signal or by a simple calculation process through detection of the current, voltage, and the like. The received power magnitude detection configuration may be applicable by various techniques including a known power detector. It is also possible for the received power magnitude detection to be performed by the sensor node and to receive only the detected information. The current magnitude can be easily detected by providing a current detecting resistor in the receiving unit. Likewise, it is also possible for the current magnitude detection to be performed by the sensor node and to receive only the detected information. Since these detection processes utilize a known technique, detailed description thereof will be omitted. The distance estimation using the power intensity of the detected reception signal may allow estimating the distance using the ‘distance versus power intensity value’ pre-stored in the memory (29).\n\nIn addition, as another method for distance detection, the control unit (28) may detect and use a delay time which is a time taken to reach the central node (20) after a signal is transmitted by the sensor node (10). The delay time can be detected, for example, by comparing a difference between the time information at which the signal transmission starts from the sensor node (10) and the time information at which the signal arrives at the central node (20). In order to detect the arrival time information, it is preferable for the control unit (28) to include a time counting function or the like. In the distance estimation using the detected delay time, it is possible to estimate the distance using the distance value compared with the delay time pre-stored in the memory (29).\n\nThe memory (29) may be used for storing various types of information to be used, required or detected by the sensor node (10). Particularly, when the distance is detected by the central node (20), the memory (29) may store various types of information to be used for distance detection. For example, the memory (29) may store the strength of received power supplied from the sensor node (10), information for determining the distance between the central node (20) and the sensor node (10) using a delay time, frequency band information capable of allocating underwater communication in response to the estimated distance information. The control unit (28) may estimate a distance by using the various types of thus-acquired information stored in the memory (29), and select a specific frequency band to be allocated to an arbitrary sensor node. The memory (29) may also include control information for frequency division, and may further store relevant information such as divided frequency bands and sensor nodes set thereon. Moreover, the memory (29) may also store underwater information collected from the sensor nodes.\n\nNext,FIG. 8is a control flowchart illustrating an operational flow of an underwater communication method according to an exemplary embodiment of the present invention.FIG. 8illustrates an operational procedure based on a first control method to be used when a specific frequency is allocated to a sensor node (10) at the central node (20).\n\nThe distance information between a central node (20) and a sensor node (10) must be detected in the underwater communication network according to the present invention. Furthermore, a specific frequency band is allocated to the sensor node (10) in response to the detected distance information. That is, it is necessary to adaptively allocate a specific frequency according to the detected distance information.\n\nFirst, the control unit (28) of the central node (20) may identify the entire usable frequency band and divide the usable entire frequency band into the forward frequency band and the reverse frequency band as shown inFIG. 3(step200).\n\nIn addition, the control unit (28) may perform a controlling process of dividing the reverse frequency band into small frequency bands as many as the number of regions (M number) as shown inFIG. 4(step205). It is preferable that the steps200and205be controlled so as to be pre-set in response to performances of the central node. That is, when the central node (20) transmits and receives a signal in an underwater environment, frequencies that can be transmitted to the farthest point may be included in the forward frequency band, and these frequencies may be made to be pre-stored. When the central node (20) transmits and receives a signal in an underwater environment, the distances (regions) in which each operating frequency can transmit a signal may be pre-classified, and these distances may be pre-stored. It is preferable that the distance values and frequency values thus pre-set be preferably stored in the memory (29) of the central node (20) and the memory (34) of the sensor node (10), and thereafter used in the frequency-setting process.\n\nSubsequently, a reference signal to be used for detecting the pre-stored distance information may be read out from the memory (29). The reference signal may be carried on the forward frequency band and converted into an ultrasonic signal through the data transmission unit (26), and transmitted to all sensor nodes (10) included in the entire usable frequency band of the central node (20), where the receiving unit (38) of the sensor node (10) may receive the reference signal (step210).\n\nThe sensor nodes (10) having received the reference signal in the step210may detect the power of the reception signal and the time delay used in the signal transmission, and may estimate a distance to the central node (20) using the detected signal (step220). The distance between the sensor node (10) and the central node (20) may be estimated by using the power intensity of the reception signal.\n\nAfter the distance is estimated at the step220, the sensor node (10) requests the central node (20) to allocate a frequency band relevant to the estimated distance to its frequency band (step230). In the process of requesting the specific frequency band at the step230, and in light of the fact that this process is prior to allocation of frequency band to the relevant sensor node, a frequency band request signal is transmitted using the frequency band set as the lowest frequency band in the reverse frequency bands. Furthermore, the frequency band relevant to the distance estimated at the step230may be pre-set based on the stored value of the memory (34), where selection may be realized.\n\nThereafter, the central node (20) may collect the frequency band information requested from a plurality of sensor nodes (10), allocate a frequency band suitable for each sensor node (10), and transmit the allocated frequency information to a side of the sensor node (10) (step240). Therefore, up to the step240, the data receiving unit (24) of the central node (20) may be also set as the forward frequency band.\n\nThereafter, the sensor node (10) may receive, from the central node (20), an ultrasonic signal transmitted in the frequency band (f0) allocated to the forward frequency band at the time of transmitting/receiving underwater information with the central node (20), and may transmit an ultrasound signal to the central node (20) with the underwater information carried in the frequency band allocated to itself within the reverse frequency band.\n\nThrough this process, an appropriate frequency band may be adaptively allocated between the central node (20) and the plurality of sensor nodes (10) in response to the distance information between the central node (20) and the sensor node (10). Therefore, unusable sensor nodes may not be generated by the unreasonable allocation frequency, because the appropriate frequency is allocated to each of the plurality of sensor nodes (10) within a limited frequency band according to the respective distances. That is, the underwater communication between the plurality of sensor nodes (10) and the central node (20) can be efficiently performed.\n\nNest,FIG. 9is a flowchart illustrating an operational flow of an underwater communication method according to an exemplary embodiment of the present invention.\n\nFIG. 9shows an operational procedure according to a second control method used when a specific frequency is allocated to the sensor node (10) at the central node (20). The illustrated exemplary embodiment is a control process for estimating a distance to each sensor node (10) under its own judgment at the central node (20) and allocating the frequency to each sensor node (10) according to the estimated distance.\n\nFirst, the control unit (28) of the central node (20) may identify an entire usable frequency band and divide the usable entire frequency band into the forward frequency band and the reverse frequency band, as shown inFIG. 3(step300).\n\nFurthermore, the control unit (28) may perform the controlling operation of dividing the reverse frequency band into small frequency bands as many as the number of regions (M number), as shown inFIG. 4(step305). It is preferable that the steps300and305be so controlled as to allow being pre-set in response to performances of the central node (20). That is, when the central node (20) transmits and receives a signal in an underwater environment, frequencies that can be transmitted to the farthest point may be included in the forward frequency band, and these frequencies are pre-stored. When the central node (20) transmits and receives a signal in an underwater environment, the distances (regions) in which each operating frequency can transmit a signal may be pre-classified, and pre-stored. It is preferable that the distances and frequency values thus set be stored in the memory (29) of the central node (20) and the memory (34) of the sensor node (10) and thereafter used in the frequency-setting process.\n\nThen, a reference signal to be used for detecting the distance information pre-stored may be read out from the memory. The reference signal may be carried on the forward frequency band, and converted into an ultrasonic signal, whereby the transmission operation from all the sensor nodes (10) to the central node (20) can be controlled. The central node (20) having received the reference signal transmitted from the plurality of sensor nodes (10) through the data receiving unit (24) may detect the power intensity of the reception signal from each sensor node, the delay time used for the transmission time. The signal transmission/reception process for detecting the above-described detection signal is a state before the frequency band is allocated to the relevant sensor node. Thus, the data transmission unit (36) of the sensor node (10) and the data receiving unit (24) of the central node (20) may transmit and receive signals using the frequency band set to the lowest frequency band in the reverse frequency bands (step310). On the other hand, it is also possible for the sensor node (10) to directly perform the signal detection operation for later use in the distance estimation by inputting the detection control information to the central node (20).\n\nThe central node20having detected a signal for distance estimation at step310may estimate a distance between the central node and each sensor node using the power intensity of the reception signal from the each sensor node and time delay used in signal transmission (step320). At this time, the distance can be estimated by using a ‘distance versus power intensity value’ pre-stored in the memory (29). It is also possible to estimate the distance by using a ‘time delay versus distance value’ pre-stored in the memory (29).\n\nSubsequently, the central node (20) may adaptively allocate a frequency band suitable for each sensor node (10) in response to the estimated distance, and transmit the allocated frequency information to the side of relevant sensor node (steps330,340).\n\nThereafter, during reception and transmission of the underwater information with the central node (20), the sensor node (10) may receive from the central node (20) an ultrasonic signal carried in the frequency band (f0) allocated to the forward frequency band, and transmit, to the central node (20), the ultrasonic signal with the underwater information carried in the frequency band allocated to itself within the reverse frequency band.\n\nThrough this process, an appropriate frequency band may be adaptively allocated between the central node (20) and a plurality of sensor nodes (10) in response to the distance information between the central node (20) and the sensor node (10), whereby the underwater information communication can be implemented. Therefore, the present invention enables efficient communication of the plurality of sensor nodes (10) and the central node (20) in the water within a limited frequency band.\n\nNext,FIG. 10is a flowchart illustrating an operational flow of an underwater communication method according to an exemplary embodiment of the present invention.\n\nThe illustratedFIG. 10shows an operational procedure according to a third control method used when a specific frequency is allocated to the sensor node (10) from the central node (20). In the illustrated exemplary embodiment, a process diagram is used to show that the same frequency band can be set on a plurality of sensor nodes.\n\nThe control unit (28) of the central node (20) may identify an entire usable frequency band and divide the usable entire frequency band into the forward frequency band and the reverse frequency band, as shown inFIG. 3(step400).\n\nMoreover, the control unit (28) may perform the controlling operation of dividing the reverse frequency band into small frequency bands as many as the number of regions (M number), as shown inFIG. 4(step405). It is preferable that the steps400and405be so controlled as to allow being pre-set according to the performance of the central node. That is, when the central node (20) performs transmission and reception of signals in the underwater environment, the center node (20) may pre-store frequencies transmittable to the farthest point in the forward frequency band. When the central node (20) transmits and receives a signal in an underwater environment, the distance (region) transmittable of signal by each use frequency may be pre-classified and pre-stored. It is preferable that thus-set distances and frequency values may be stored in the memory (29) of the central node (20) and in the memory (34) of the sensor node (10), and then used for the frequency-setting process.\n\nThen, the reference signal to be used for detecting the pre-stored distance information may be read out from the memory (29). The reference signal may be carried on with the forward frequency band, converted into an ultrasonic signal through the data transmission unit (26), and transmitted to all the sensor nodes (10) contained in the entire usable frequency band of the central node (20) (step410).\n\nThe sensor nodes (10) having received the reference signal transmitted at step410through the data receiving unit (38) may detect the power intensity of the reception signal and/or the time delay used in signal transmission, where the detected signal may be transmitted to the central node (20). In the detection signal transmission process, the detected signal may be transmitted to the central node (20) using the lowest frequency band in the reverse frequency bands, since the frequency band is not allocated to the relevant sensor node in this case.\n\nThe control unit (28) of the central node (20) which has received the detected signals may estimate a distance between the central node and each sensor node by using the power of the reception signal inputted from each sensor node and/or the time delay used in signal transmission (step420). In this case, the distance can be estimated by using the ‘distance versus power intensity value’ pre-stored in the memory (29). It may be also possible to estimate the distance using the ‘time delay versus distance value’ pre-stored in the memory (29).\n\nThereafter, the central node (20) may adaptively allocate a frequency band suitable for each sensor node (10) in response to the estimated distance (step430). When a frequency is allocated to the sensor node (10) at step430, as shown inFIG. 4, the same frequency band may be allocated to the sensor nodes at the same or similar distance. At this time, the central node (20) may bind sensor nodes capable of transmitting and receiving signals in the same frequency band based on the central node (20). In addition, the same frequency band may be allocated to the same region.\n\nFurthermore, the frequency band information allocated at the step430based on each region may be transmitted to a plurality of sensor nodes (step440).\n\nThereafter, while receiving and transmitting underwater information with the central node (20), the sensor node (10) may receive, from the central node (20), an ultrasonic signal carried with the frequency band (f0) allocated to the forward frequency band, and transmit, to the central node (20), an ultrasonic signal with the underwater information carried in the frequency band allocated to itself within the reverse frequency band.\n\nMeanwhile, sensor nodes existing within the said same region may implement the underwater transmission with the same frequency band. Therefore, in this case, it is necessary for the control unit (28) in the central node (20) to appropriately control the underwater communication with a plurality of sensor nodes existing in the same area. In this case, as explained before, the underwater communication control in response to the multiple access method may be implemented (step450).\n\nThe reason the same frequency is allocated to a plurality of sensor nodes is because there is a limit in the frequency band useable by the central node (20). For example, in order to acquire underwater information more accurately and diversely, there is no way but to increase the number of sensor nodes. Under this circumstance, there may be generated cases where the number of sensor nodes (10) available at the central node (20) installed within the entire frequency band are greater than the number of divided reverse frequency bands. At this time, as shown inFIG. 4, the same frequency band may be allocated to the sensor nodes existing in the same region whereby the underwater communication can be controlled.\n\nAccording to the exemplary embodiment ofFIG. 10, the underwater communication of the present invention can be controlled in such a manner that the same frequency band is allocated to a plurality of sensor nodes (10) within the limited frequency band, and a plurality of sensor nodes is efficiently controlled by the control of the multiple access method of the central node (20). Therefore, the underwater communication control can be efficiently implemented even for the greater number of sensor nodes than that of divided frequency bands.\n\nMeanwhile, the forward frequency band described in the foregoing explanation has been exemplified when used during a signal being transmitted from the central node (20) to the plurality of sensor nodes10. Moreover, the foregoing explanation has also described that the frequency band used at that time had been set at the lowest frequency band (f0) in the frequency bands useable by the central node20.\n\nFurthermore, the description has been made that the reverse frequency band had been used when performing the signal transmission from each of the plurality of sensor nodes (10) to the central node (20). At this time, the description has been made that all the available frequency bands except for the forward frequency band are included in the reverse frequency band. The description has been also made that the reverse frequency band had been divided into a plurality of small frequency bands, and used by being allocated to each sensor node.\n\nThe said configuration has been given as an example in which the central node and the plurality of sensor nodes constitute a centralized underwater communication network system. Accordingly, the central node may be expressed as an underwater base station, the plurality of sensor nodes may be expressed as a plurality of reception nodes, and the explanation may be also given as a plurality of reception nodes being provided around the underwater base station to implement a centralized underwater communication network system.\n\nMeanwhile, the to-be-used forward frequency band is set at a band capable of receiving signals from all plural sensor nodes under the management of the central node, when transmitting signals from the central node to a plurality of sensor nodes.\n\nTherefore, all the plural sensor nodes under the management of the central node are placed under a state of being receivable of signals transmitted from the central node, when the central node transmits a signal. In other words, all the plural sensor nodes receive signals.\n\nWhen all the plurality of sensor nodes receives signals as noted above, all the plural sensor nodes implements a process of checking whether the reception signal is its own signal by demodulating the reception signal. That is, all the plural sensor nodes perform an operation of demodulating the reception signal. Although there are cases where the central node sends signals to all plural sensor nodes, the underwater communication, however, in most cases, is performed by way of a centralized network method between a certain sensor node and a central node through a process of transmitting signals to only some sensor nodes. Therefore, even despite the fact that it suffices for only a portion of sensor nodes requiring signal reception to perform the demodulation operation, all the sensor nodes are made to perform the demodulation operation to thereby result in generation of power consumption caused by unnecessary operation. Hence, in order to solve the said problems, the present invention constitutes a frame signal where the demodulation operation of the reception signal is limited to a minimum for other sensor nodes than some sensor nodes which must receive a signal, when forward communication is performed between a central node and a plurality of sensor nodes.\n\nHereinafter, as described above, an operation will be described where a centralized underwater communication network is implemented between one central node and a plurality of sensor nodes within a limited frequency band, and a low-power control is realized when performing a forward underwater communication.\n\nA frequency (or a frequency band or a small frequency band) to be used between the central node (20) and an arbitrary sensor node (10) has been allocated in the previous process. Thereafter, the aforementioned allocated frequency is to be used in transmitting a signal between the central node (20) and the arbitrary sensor node (10). Furthermore, the forward frequency band is to be used when transmitting signals from the central node (20) to the sensor node (10).\n\nIn the centralized underwater communication network in which frequency bands are allocated and used, preamble data are used for synchronization, and all nodes perform a process of detecting a preamble of forward link for synchronization between physical layers.\n\nThe underwater communication according to the present invention may use the OFDM, FBMC, and FMT methods are used in which data is transmitted via a plurality of carriers.\n\nIn the following description, a process of performing underwater communication will be explained by applying the OFDM communication method as one example of the centralized underwater communication of the present invention.\n\nFIG. 11illustrates one frame data used in the OFDM communication method. In other words, encoded data may be mapped by a plurality of OFDM (Orthogonal Frequency Division Multiplexing) symbols in order to generate one frame data, as illustrated inFIG. 11, and the above frame data may be modulated by using the OFDM method to constitute a transmission signal, and transmitted via mutually separated N number of subcarrier waves.\n\nThe frame data of the physical layer may include a preamble sharable by all nodes in the cell, because information between the central node and the reception node cannot be mutually known. That is, the frame data used for the OFDM communication may include preamble data at a front end of all transmission data. The purpose of the preamble transmitted by the preamble data is to indicate the transmission type and the basic transmission parameter of the frame. Therefore, the preamble may be utilized for time and frequency synchronization, channel estimation, cell selection, equalization, and channel decoding. In addition, the present invention may be so configured that the preamble data includes information on the general physical channel and information on a reception node to demodulate the relevant physical channel signal.\n\nThat is, the present invention may be so configured, as shown inFIG. 1I, that the reception node can check whether the physical channel information and the physical channel data are the data transmitted to itself through acquisition and combination of ID (or value or data) of the preamble. That is, the reception node can prevent unnecessary power consumption causable by unnecessary operations by omitting a subsequent demodulation of physical channel data, when it is presumed through detection of the preamble ID that the physical channel data is not a data relevant to itself.\n\nThe preamble data of the present invention may be configured in the form shown inFIG. 12, as one of the exemplary embodiments. That is, the preamble data (IDC) may indicate physical channel information, where the physical channel information may be configured by including information on a broadcasting channel, a control channel, and a data channel.\n\nIn addition, the preamble data (IDG) may indicate reception node group information, where the reception node group information may be configured by including information on all reception node groups and four mutually different reception node groups. Furthermore, the preamble data (IDM) may indicate the reception node information, where the reception node information may be configured by including information on all the reception nodes within relevant receiving group and nine mutually different reception nodes. The preamble data thus constructed may constitute the preamble data for transmission by being respectively inserted into the preamble positions shown inFIG. 11. Therefore, necessary reception node indication information may be obtained when the physical channel information, the reception node group information, and the reception node information are combined.\n\nAs an example, when there are a total of NCnumber of mutually different physical channels, and there are a total of NGnumber of reception node groups and a total of NMnumber of reception nodes in each reception node group, the total number of reception nodes will be in the number of NG*NM.\n\nIn this case, the total required number of preamble IDs will be in the number of NC*(NG+1)*(NM+1). Here, the reason for considering (NG+1) and (NM+1) instead of NGand NGis to indicate all groups and all reception nodes in each group.\n\nThus, the preamble IDPmay be configured by a combination of IDC, which is a physical channel ID, IDG, which is a reception node group ID, and IDM, which is a reception node ID. In case where there is no reception node group, the preamble IDPmay be configured by a combination of IDC, which is a physical channel ID, and IDM, which is a reception node ID.\n\nFurthermore, the preamble must select a preamble that satisfies the following condition when there are a total of K preambles and the number of IDs that can be provided for each preamble is M1, M2, . . . , Mk.\nM1*M2* . . . *Mk≥NC*(NG+1)*(NM+1)\n\nThe following equation may be applied in order to generate a preamble IDPaccording to an exemplary embodiment of the present invention.\nIDP=IDM*(NG+1)*NC+IDG*(NC)+IDC.\n\nwhere IDPmay be determined as under by IDM, IDG, and IDC, when NG=5, NC=3, and NM=10.\n\nA preamble ID may be generated by being set as IDP=IDM*18+IDG*3+IDC.\n\nAt this time, assuming that K=3, M1=2, M2=3, and M3=33 for selecting the preamble, each preamble ID has a value that satisfies the following condition, in the case of ni={0, 1, . . . , M1−1}.\nIDP=n1*M2*M3+n2*M3+n3\n=n1*99+n2*33+n3\n\nTherefore, each preamble ID generation and selection shown inFIG. 13may be controlled through the following exemplary embodiment.\n\nThe broadcasting channel may be such that a preamble ID of IDP=0 is generated by the formula IDP=IDM*18+IDG*3+IDCwhen IDC=0, IDG=0 and IDM=0, and when this is applied to the formula of IDP=n1*99+n2*33+n3, the preamble ID of n1=0, n2=0 and n3=0 may be selected.\n\nThrough the above process and formulae, the control channel transmitted to all the reception nodes of the reception node group where the group ID of 2 may be such that IDP=7, when IDG=2, IDM=0 and I IDC=1, and n1=0, n2=0, n3=7.\n\nThe data channel transmitted to the reception node, where, reception node whose group ID is 3, and reception node whose reception node ID is 8, may be such that IDP=155, when IDG=3, IDM=8 and IDC=2, and n1=1, n2=1, n3=23.\n\nIn the case of a control channel transmitted to a reception node having a reception node ID of 4 in all reception node groups, IDP=73 when IDG=0, IDM=4, IDC=1, and n1=0, n2=2, and n3=11.\n\nAccordingly, it becomes possible to generate and select a preamble ID when a plurality of physical channel information, a plurality of reception node groups, and a plurality of reception nodes are combined through a predetermined algorithm.\n\nFIG. 12is a block diagram of a portion of a transmission side for transmitting physical channel information configured by including a physical channel information and reception node information to demodulate the physical channel signal in a preamble in the underwater communication according to the present invention.\n\nThe present invention may include a physical channel determination unit (500) for determining a physical channel for transmission in a plurality of physical channels used for underwater communication, a reception node group determination unit (501) for determining a relevant reception node group from among a plurality of reception node groups, and a reception node determination unit (502) for determining a relevant reception node in a plurality of reception nodes. A signal (value) determined by and outputted from the said unit may be inputted into a preamble ID generator (504), and the preamble ID may be generated through an algorithm stored in the preamble ID generator (504). Furthermore, the ID of generated preamble may be provided to a preamble selection unit (506). The preamble selection unit (506) may select and output a preamble through the pre-set algorithm using the preamble ID value.\n\nMeanwhile, when the reception node is determined and a physical channel for transmission is determined, a signal based on the physical channel determined by a physical channel signal generation unit (503) may be generated. Furthermore, the selected preamble may be inserted into the physical channel signal at the preamble insertion unit (503). Through this process, a preamble may be inserted into the physical channel signal to form a frame data mapped as the OFDM symbol, and the frame data thus constructed may be transmitted according to the OFDM method.\n\nIn other words,FIG. 13shows a configuration in which a preamble ID is generated using a plurality of physical channels, a plurality of reception node groups, and a plurality of reception nodes. At this time, the control of the physical channel determination unit (500), the reception node group determination unit (501), and the reception node determination unit (502) may be implemented through control of a control unit (not shown), and the control of the control unit may be implemented by a to-be-transmitted signal, a reception node to receive the to-be-transmitted signal, and a control algorithm. The control unit may use a control unit included in the central node or may additionally include a separate control unit.\n\nAlthough the preamble ID generator (504) may be exemplarily implemented by the foregoing exemplary embodiment, it should be apparent that the preamble ID generator (504) may be variably generated using physical channel information, reception node group information, and reception node information through other algorithms. Likewise, although the preamble selection unit (506) may be exemplarily implemented by the foregoing exemplary embodiment, the preamble selection unit (506) may be variably generated by other algorithms.\n\nThat is, some configurations in the transmission side shown inFIG. 13may be included in the node used as the transmission side for the forward communication in the centralized network underwater communication such as the central node or the underwater base station. Moreover, configurations for control and configuration of the preamble data of present invention, and control for signal processing according to the OFDM method may be included in the transmission side. Similarly, control structures for controlling and demodulating the preamble data and for signal processing according to the OFDM method may be also included in the node of receiving side. For example, the transmission side and the receiving side must have a rule for generating a common preamble ID. The transmission side and the receiving side must have a rule for selecting a common preamble. These rules are naturally formed to decode a signal transmitted from the transmission side to an original signal. These controls, necessary control algorithms or storage of rules may be realized using the control unit and the memory included in the respective transmission side notes and reception node sides.\n\nNext, when a transmission signal including physical channel information is transmitted from a central node through forward communication through the above process, a signal may be received by a plurality of reception node sides.FIG. 14illustrates an operational configuration diagram implemented by the receiving side according to the present invention.\n\nWhen the underwater communication starts, a preamble may be detected in the centralized network underwater communication from the reception signal where all the reception nodes are received from the forward communication through the transceiver unit (40) for synchronization in the physical layers (600).\n\nMoreover, the controller (32) may acquire a preamble ID from the detected preamble (601), and obtain, from the obtained preamble ID, a physical channel ID, a reception node group ID, and a reception node ID (602,603,604).\n\nIn the case where the physical channel information is a broadcasting channel, all the reception nodes perform a process of demodulating the physical channel signal because of the data being sent to all the reception nodes collectively (605,606).\n\nHowever, in the case where the physical channel information is not a broadcasting channel, a process of demodulating operation of the physical channel signal may be implemented only by the reception node where the thus-obtained reception node group ID and reception node ID are identical (607,608).\n\nFurthermore, a plurality of reception nodes having different reception node IDs may omit a process of demodulating operation for the subsequent physical channel signals (609). Subsequent to608and609, when the reception signal is received and demodulating operation is continuously performed, the process may be returned to600, and the process may be terminated when all operations are completed.\n\nThe foregoing detailed description should not be construed in any way as being restrictive and should be considered as examples. The scope of the present invention should be determined by rational interpretation of the appended claims, and all changes within the scope of equivalents of the present invention are included in the scope of the present invention.\n\n[Description of Reference Numerals]10: sensor node20: central node21, 22, 40: transceiver unit23, 26, 36: data transmission unit24, 25, 38: data receiving unit27: frequency divider28, 32: controller29, 34: memory50: underwater communication62: ground communication networknetwork64: management node\n\n",
            "length": 66304
        },
        {
            "patent_id": "11011900",
            "text": "DESCRIPTION OF A PREFERRED EMBODIMENT\n\nReferring now to the drawings, the invention will be described in more detail. An electrical receptacle installation kit10includes a pair of brackets12and an electrical receptacle14having a face plate16and a pair of outlets18, as shown inFIG. 1. A pair of screws20extend through holes in the faceplate, and in a preferred embodiment, the holes are positioned adjacent diagonally opposed corners thereof (for example, one hole in the top left corner of the face plate16, and the other hole in the bottom right corner). Each screw includes a pivoting finger22secured to a distal end of the screw behind the faceplate16, so that the finger22is disposed at a generally right angle with respect to the longitudinal direction of the screw20. As the screw20is rotated, the pivoting finger22rotates, as well. The pivoting fingers22are positioned so that they may be tucked in behind the faceplate16for insertion of the receptacle14into the wall, and then may be rotated to secure the receptacle14to the wall. Other embodiments may include more or less screws20having pivoting fingers22, and the screws20and pivoting fingers22may be positioned in any desirable location behind the faceplate16or with respect to the receptacle14, so long as the pivoting fingers22may be rotated to a low profile position for placement in a hole in a wall, and then may be rotated to affix the receptacle14to the wall.\n\nA pair of brackets12are provided, and each bracket includes a rear plate24, a horizontal support26, and a front lip28. The brackets12are configured to attach to an edge of an opening in the sheetrock so that the rear plate24extends vertically behind the sheetrock. The rear plate24and the front lip28are generally parallel to one another, and are disposed at a generally right angle with respect to the horizontal support26. In one preferred embodiment, the front lip28and/or the rear plate24may be slightly bent inwardly, so that the front lip28and rear plate24may ‘clip’ to the wall, so that an installer does not need to hold the brackets12in place while the receptacle14is being installed therebetween. The slight inward bend provides a frictional engagement between the front lip28and the rear plate24, so that the sheetrock is pinched therebetween.\n\nIn use, a user or electrician places the brackets12in the hole provided for the receptacle14, so that the rear plate24is positioned against the backside of the sheet rock, and the front lip28is positioned against the front side of the wall. After the wiring has been connected to the rear portion of the receptacle14, the receptacle14is then positioned between the brackets12, so that one bracket12is above the receptacle14, and one bracket12is below the receptacle14. Then, the screws20are turned so that the fingers22rotate until they engage the rear plate24, so that the receptacle is secured within the wall.\n\nIn this arrangement, the brackets12prevent the fingers22from pulling through the walls when excessive force is used to pull a plug out of one of the outlets18. The rear plate24of each bracket12is positioned between the fingers22and the sheetrock, so that the pressure applied to remove a plug from the outlet18is spread out across the rear plate24, rather than focused or concentrated on a small portion of the sheetrock that otherwise would be in contact with the rotating or pivoting fingers22.\n\nIt should be understood that brackets12of different sizes may be used to accommodate walls, panels, or the like that have different thicknesses. In a preferred embodiment, the brackets12are made from a plastic or metal, although they may be made from any suitable material. The face plate16may be integrally formed with the receptacle14, or may be detachable, as desired. It should also be understood that other mechanisms may be used to secure the receptacle14to the wall rather than rotating fingers22, particularly including the various mechanisms described in the documents that are incorporated herein by reference, as set forth above. It is contemplated that the electrical receptacle14may have any desired number of electrical outlets18affixed thereto or formed therein, as desired, without departing from the spirit or scope of the present invention.\n\nAlthough the present invention has been described in considerable detail with reference to certain preferred versions thereof, other versions are possible. Therefore, the spirit and scope of the appended claims should not be limited to the description of the preferred versions contained herein. All features disclosed in this specification may be replaced by alternative features serving the same, equivalent or similar purpose, unless expressly stated otherwise. Thus, unless expressly stated otherwise, each feature disclosed is one example only of a generic series of equivalent or similar features.\n\n",
            "length": 4864
        },
        {
            "patent_id": "11014135",
            "text": "DETAILED DESCRIPTION OF THE INVENTION\n\nA variety of industries, such as the aerospace industry, require formed metal beams that are produced through a number of bending processes. As described above, the aerospace industry uses stringers, which are metal beams that support wing surfaces and must take on the contour of the wing surfaces. Many stringer cross-sections are unsymmetrical. However, certain aircraft stringers may have a Z-shaped cross-section, an I-shaped cross-section, a J-shaped cross-section, or a channel (U-shaped) cross-section. Because of the lack of symmetry, when a forming load is applied to a metal beam the shape may deflect out of plane (seeFIG. 1). This out of plane deformation must be either controlled, as in the device of the invention, or it must be corrected to return to the part to a straight condition. When the manual forming methods described above are used, the part is rotated into the press on its side, and the out of plane deformation is corrected.\n\nThe applied forming loads can also distort the flanges of the part leaving permanent deformations or “kinks” in them. The flanges can also bend and cause the angle between the flange and web to change. These permanent deformations must be prevented or taken out of the finished part using hand tools.\n\nWhen bending a metal beam, the cross-section of the beam can determine whether an applied force may result in out of plane bending or twisting (torsion) of the metal beam. In order to prevent out of plane bending and twisting, a bending method and device must account for the shear center and principal axes of the metal beam during forming processes.\n\nTo avoid twisting of the metal beam during the application of force, the plane of bending must pass through the shear center of the metal beam cross-section. As used herein, the term “shear center” describes a point associated with the cross-section of a metal beam through which the plane of an external force can act without introducing torsional loads, and a resulting twist, to the metal beam during forming processes. Accordingly, a bending force applied through the shear center of a metal beam will result in bending without torsion.\n\nTo avoid out of plane bending of a metal beam during the application of force, the plane of force must be provided along a principal axis of the metal beam cross-section. As used herein, the term “principal axis” describes an axis for which the product of inertia for a cross-section is zero. Therefore, if an applied load does not coincide with a principal axis of a metal beam cross-section, bending will take place in a plane that is different from the plane of the principal axis (i.e., out of plane bending). Accordingly, a bending force applied along a principal axis of a metal beam will result in bending that is limited to the principal axis.\n\nDue to the varying cross-sections of the metal beams formed by the devices and processes of the invention, such metal beams may display varying principal axes and shear centers. For example, Z-shaped metal beams are unsymmetrical and have two principal axes (y and x) (seeFIG. 1).\n\nThe devices and methods of the invention are designed to provide bending forces to the metal beams while accounting for the shear center and the various principal axes. In preferred aspects of the invention, the devices described herein may provide bending forces with two actuators (first and second actuators). As bending forces are applied to a metal beam, the devices and methods of the invention (1) adjust the angle at which a first force is applied from the first actuator to control twisting by ensuring that the plane of force is applied through the shear center of the metal beam; and (2) providing a second force that combines with the first to produce a net force that acts along a principal axis of the metal beam.\n\nReferring now to the figures, wherein like elements are numbered alike throughout,FIGS. 2 and 3provide an apparatus1for forming or otherwise bending a metal beam50. The apparatus1may include a platform10and a perpendicular support structure20that supports the various bending and forming elements of the apparatus (e.g., the bending clamp member40). The apparatus1may include (1) a fixed clamp member30that may be connected to the platform10; and (2) a bending clamp member40that may be connected to the platform10and which may be adjacent to the fixed clamp member30. The bending clamp member40may also be attached to the perpendicular support structure20. Furthermore, the apparatus1may include a metal beam cradle51that may support a portion of the metal beam50during the forming processes. The metal beam cradle51may also advance the metal beam50into the fixed clamp member30and bending clamp member40.\n\nIn other aspects, the apparatus1may include a control system60for controlling the apparatus1and communicating with and/or operating the fixed clamp member30, the bending clamp member40, and the metal beam cradle51. The apparatus1may also include an actuator supply unit70configured to power the various actuators disposed on the apparatus1. As shown inFIG. 2, the actuator supply unit70may be in fluid communication with the various actuators of the invention through supply lines70A. The supply lines70A may be pneumatic supply lines, hydraulic supply lines, or a combination thereof.\n\nAdditionally, the apparatus1may include a contour inspection system80that measures the contour of the formed or bended metal beam to determine if the metal beam is within tolerances after forming.\n\nThe metal beams50formed by the apparatus1may be symmetrical or unsymmetrical. However, various metal beams may be formed by the devices and processes of the invention including, but not limited to, metal beams having an I-shaped cross-section, a Z-shaped cross-section, a J-shaped cross-section, a T-shaped cross-section, an L-shaped cross-section, a U-shaped cross-section, or a combination thereof. In certain embodiments, the metal beams formed by the devices and processes of the invention are metal beams having Z-shaped cross-sections. In addition, the metal beams of the invention may be aircraft stringers. Exemplary apparatus1ofFIGS. 2-7is configured to form a metal beam having a Z-shaped cross-section.\n\nThe apparatus and methods of the invention may be used to form any beam, for example metal beam50, that includes a metal alloy or other material that exhibits plastic deformation when loaded above its proportional limit. The proportional limit may be defined as the maximum stress for which stress remains proportional to strain and permanent deformation may begin to occur. For example, the metal alloys of the invention (e.g., those alloys used in metal beam50) may be selected from the group consisting of an aluminum alloy, a titanium alloy, a magnesium alloy, a steel alloy, and a combination thereof.\n\nRegarding the specific bending components of the invention, apparatus1includes a fixed clamp30that may be connected to the platform10. As shown inFIG. 4, fixed clamp30may include a first locking clamp31that is contained within a housing32. The housing32may also be connected to one or two face plates33that enclose the components of the first locking clamp31and provide mounting surfaces for the various components within the fixed clamp member30. Housing32and face plates33may provide an enclosure, which may be mounted to bracket36. Bracket36may be one or more plates that connect the fixed clamp member30to the platform10.\n\nThe first locking clamp31allows the fixed clamp member30to secure a portion of the metal beam that is to be formed by the apparatus1. A variety of different locking systems may be used in accordance with the invention to secure a first portion of a metal beam in the fixed clamp member30. Preferably, the locking clamps of the invention are configured to lock a portion of the metal beam (e.g., two or more surfaces of the metal beam) in frictional engagement. As described herein, the locking clamps of the invention may include one or more fastening devices that secure the metal beam at the fixed clamp member30(or bending clamp member40) to prevent movement or separation during forming processes through the application of pressure on the metal beam between at least two opposing surfaces of the locking clamp. The locking clamps of the invention may include hand powered clamps or vices. However, in preferred aspects, the locking clamps of the invention include clamps that are powered by one or more actuators.\n\nFor example, the actuators of the invention may include pneumatic actuators, screw driven actuators, electrical actuators, manual (e.g., hand turned) actuators, spring actuators, hydraulic actuators, or a combination thereof. In a particularly preferred embodiment of the invention, the locking clamps are driven by combination pneumatic/hydraulic actuators (e.g., air over oil actuators). Each of the actuators described herein may be connected to the control system60(either through a wireless or wired connection) with a transceiver that is programmed to (1) receive commands from the control system60; and (2) transmit status information to the control system60regarding the status of the actuator.\n\nThe first locking clamp31may include a first aperture35, which is a space in which the metal beam may pass when the locking clamp31is in its open configuration. As a point of reference, first locking clamp31ofFIG. 4is shown in its open configuration.\n\nIn certain embodiments of the invention, first locking clamp31may include two or more locking shoe assemblies for locking the position of a portion of the metal beam. Each locking shoe assembly may include (1) a shoe that abuts a surface of the metal beam and includes a deformable or nondeformable surface (e.g., a nondeformable metal surface); (2) an actuator; and (3) a driving member that translates force from the actuator to the shoe, which may be: a rod, a wedge and rolling block, a wedge and sliding block, or a combination thereof. Specifically, the first locking clamp31may include two opposing shoes and/or shoe assemblies. In another embodiment, the first locking clamp31may include three opposing shoes and/or shoe assemblies. Preferably, the first locking clamp31includes four opposing shoes and/or shoe assemblies.\n\nAs shown inFIG. 4, an exemplary locking clamp31may include two locking clamps (i.e., locking clamp31A and locking clamp31B) where each locking clamp31A,31B includes four shoe assemblies. Two or more locking clamps may be used for locking clamp31where the metal beam does not include a uniform shape along its length. Accordingly, using two locking clamps31A,31B allow the device to account for small variances in metal beam shape to ensure that the necessary frictional engagement is formed at the fixed clamp member30. However, for the purposes ofFIG. 4, the components of locking clamps31A and31B are identical. Therefore, a locking clamp component labeled “31A” will have an identical component for locking clamp31B, and vice versa, for the embodiment of the invention set forth inFIG. 4.\n\nSpecifically, locking clamp31A ofFIG. 4includes shoes31A-1,31A-2,31A-3, and31A-4, which are connected to driving members (i.e., sliding blocks31A-5,31A-6,31A-7, and31A-8, and wedges31A-9,31A-10,31A-11, and31A-12) powered by actuators31A-13,31A-14,31A-15, and31A-16. The configuration for the above referenced components of locking clamp31for the fixed clamp member30are configured to accommodate a metal beam having a Z-shaped cross-section. However, it is understood that a person having ordinary skill in the art could reconfigure locking clamp31, in view of the present specification, to accommodate metal beams having an I-shaped cross-section, a Z-shaped cross-section, a J-shaped cross-section, a T-shaped cross-section, an L-shaped cross-section, or a U-shaped cross-section.\n\nShoe31A-1is connected to rolling block31A-5. Rolling block31A-5is slidably connected to a track on the housing32and also includes a wheel for engaging with a wedge31A-9. Wedge31A-9is connected to actuator31A-13via a piston of the actuator31A-13. When the actuator31A-13extends its piston, wedge31A-9also extends, which drives the rolling block31A-5and shoe31A-1into frictional engagement with a surface of the metal beam in the aperture35.\n\nShoe31A-2is connected to support structure31-18, which is fixed to the housing32. Accordingly, shoe31A-2may function as an anvil upon which other shoes (i.e.,31A-3, and31A-4) may act.\n\nShoe31A-3is connected to rolling block31A-6. Rolling block31A-6is slidably connected to a track on the face plate33and also includes a wheel for engaging with a wedge31A-10. Wedge31A-10is connected to actuator31A-14via a piston of the actuator31A-14. When the actuator31A-14extends its piston, wedge31A-10also extends, which drives the rolling block31A-6and shoe31A-3into frictional engagement with a surface of the metal beam in the aperture35.\n\nShoe31A-4is connected to rolling blocks31A-7and31A-8. Shoes31A-1and31A-3each provide a one dimensional line of force and move in opposite directions. However, shoe31A-4is configured to provide a two dimensional line of force and may move diagonally as compared to the movement of shoes31A-1and31A-3. Rolling block31A-7is slidably connected to a track on housing32and also includes a wheel for engaging with a wedge31A-11. Wedge31A-11is connected to actuator31A-15via a piston of the actuator31A-15. When the actuator31A-15extends its piston, wedge31A-11also extends, which drives the rolling block31A-7and shoe31A-4into frictional engagement with a surface of the metal beam in the aperture35on a first axis. Rolling block31A-8is slidably connected to a track on the face plate33and also includes a wheel for engaging with a wedge31A-12. Wedge31A-12is connected to actuator31A-16via a piston of the actuator31A-16. When the actuator31A-16extends its piston, wedge31A-12also extends, which drives the rolling block31A-8and shoe31A-4into frictional engagement with a surface of the metal beam in the aperture35on a second axis.\n\nThe shoes and/or shoe assemblies of the first locking clamp31may be extended simultaneously or sequentially. The shoes and/or shoe assemblies of the first locking clamp31may have the ability to apply a restraining load on a portion of the metal beam to simulate hand pressure. The loading range may be from 1 to 100 lbs. The specific loading may be programmable and controlled at the control system60through the user interface61. The purpose of the loading is to simulate hand pressure and take out minimal amounts of warp from the metal beam to provide a more reliable displacement reading both during and after bending.\n\nFurthermore, where a device of the invention utilizes a wedge and rolling block or wedge and sliding block component, minimal restraining loads may be provided to the metal beam while maintaining large amounts of resistance to prevent “backing out” of the shoes during forming. Moreover, the use of wedge and rolling block or wedge and sliding block components minimizes the loads placed on the various actuators described above when clamping the metal beam.\n\nThe locking clamp31may also include several springs31-20placed between the supports31-18or32-2, for example, and a rolling block in order to provide a retracting force for the rolling blocks when the clamp is unlocked.\n\nRegarding the housing32, the housing may include a locking knob32-1for fixing the position of the housing32on the bracket36. Indeed, in certain embodiments of the invention, the housing32may include a pivot point that allows the housing32to be rotated about the bracket36.\n\nThe housing32may include supports32-2for mounting and/or supporting various components of the first locking clamp31, including: wedges31A-10and31A-12; and actuators31A-14,31A-15, and31A-16. In addition, housing32may have one or more tracks for guiding and supporting wedges31A-9and31A-11\n\nAdditionally, the fixed clamp member30may include one or two follower assemblies34-1. The follower assemblies may be placed proximate to the aperture35and may include a follower arm that may abut a surface of the metal beam. The follower measures one plane of deflection of the metal beam during forming. The follower may include a sensor that measures the amount of metal beam deflection during bending in the plane of deflection and converts that measurement into an analog or digital signal. The sensor may be connected to the control system60(either through a wireless or wired connection) and may send the digital signal that is representative of the metal beam deflection to the control system60. In preferred embodiments of the invention, the fixed clamp member includes two followers34-1that are placed in the input and output sides of the fixed clamp member30, proximate to the aperture35.\n\nFixed clamp member30may also include a displacement sensor assembly34-2that may be connected to the bracket36. Displacement sensor assembly34-2may include one or more lasers that may be connected to the control system60and may be targeted at the metal beam50, at a reflective target placed on the metal beam50, or on a follower that abuts the metal beam50. The one or more lasers may measure the displacement of metal beam50during bending processes and transmit sensor data to the control system60that may be indicative of the amount of displacement in the metal beam50during and after bending. For example, the displacement sensor assembly34-2may measure lateral displacement of the metal beam50during and after bending of the metal beam50. In preferred embodiments of the invention, the displacement sensor assembly34-2may include a laser that is targeted at a follower that abuts the metal beam50where the follower allows a measurement to be made from a stand-off distance or offset to provide clearance for the laser to have an unobstructed view of the target on the follower.\n\nThe underside of the fixed clamp member30is shown inFIG. 5. Attached to the underside of bracket36are a set of guide rail assemblies36-1, which also connect to platform10. The position of fixed clamp member30may be adjusted, with respect to platform10by adjusting screw38. Screw38is fixed to the platform10at bracket38-3and includes an adjustment knob38-1and threaded shaft38-2. Accordingly, rotation of knob38-1allows the position of fixed clamp member to be varied with respect to both the platform10and the bending clamp member40. Furthermore, the bracket36may include a locking actuator39that locks bracket36in position after any adjustment or positioning with respect to the platform10and bending clamp member40.\n\nDepending upon the type of bends or hits required by the apparatus1, the distance between the fixed clamp member30and bending clamp member40may require adjustment. For example, in certain aspects of the invention, the distance between the fixed clamp member30and the bending clamp member40may be about 1 to 24 inches. However, in a preferred embodiment, the distance between the fixed clamp member30and the bending clamp member40may be about 4 to 22 inches.\n\nThe bracket36may include a drift member37. The drift member37may include a pair of actuators (e.g., solenoids) with a rod interposed between the pair of actuators that is connected to the housing32. The drift member37allows the fixed clamp member30to drift, while providing some resistance, toward or away from the bending clamp member40during bending processes. It is understood that the application of bending forces at the bending clamp member40may result in a pulling force on the metal beam. The drift member37relieves the stress that might otherwise be caused by this pulling force by allowing the fixed clamp member to drift. Indeed, the drift member37allows for compliance in the fixed clamp member30and provides one degree of freedom to keep the metal beam50from “thinning” as it is bent with an apparatus of the invention. In other embodiments, the drift member37may be a set of springs or a piece of elastic material (e.g., a rubber pad).\n\nAn exemplary bending clamp member40is shown inFIG. 6. The bending clamp member40is provided to (1) lock a portion of the metal beam at a locking clamp; and (2) bend the metal beam with two or more bend actuators. The bending clamp member40may include a support structure41and a first bend actuator42, second bend actuator43, and linkage assembly49connected to the support structure41. The bending clamp member40may also include a rotatable bending frame44.\n\nBoth the first bend actuator42and the second bend actuator43may be connected to the rotatable bending frame44and may provide bending forces to the rotatable bending frame44that may be substantially perpendicular to each other. In addition, the linkage assembly49may be interposed between the first bend actuator42and the rotatable bending frame44. The linkage assembly49may translate a first bending force from the first bend actuator42to the rotatable bending frame44. Moreover, the linkage assembly49may modulate the angle at which the first bending force is applied to the rotatable bending frame44.\n\nThe rotatable bending frame44may be connected to a gimbal45, which has a second locking clamp46disposed therein for locking a portion of the metal beam during bending processes.\n\nRegarding the components of the bending clamp member40more particularly, the first bend actuator42and second bend actuator43may be described as a horizontal bend actuator and vertical bend actuator, respectively, as compared to the ground. However, a person having ordinary skill in the art would recognize, in view of this specification, that a variety of orientations for the first bend actuator42may be used. In certain embodiments, the first bend actuator42may be provided on an axis that is substantially perpendicular to the axis of the second bend actuator43.\n\nThe first bend actuator42provides a first bending force to the rotatable bending frame44and, therefore, provides a force to the metal beam that is locked in the second locking clamp46, which is mounted in the gimbal45. As would be understood by a person having ordinary skill in the art, the first bend actuator42may include: an electric screw actuator, a hydraulic actuator, a pneumatic actuator, or a combination thereof. Indeed, a variety of actuators may be used to provide a first bending force to the rotatable bending frame44in accordance with the invention.\n\nIn a specific embodiment, the first bend actuator42may include an actuator421, a spacer422, a mounting bracket423, and a rod424(e.g., a threaded rod). The actuator421is an electric motor and servo for turning rod424, which is preferably a threaded rod, to provide a first bending force. For example, actuator421and rod424may encompass a ball screw drive. The first bend actuator42is connected to the rotatable bending frame44via a linkage assembly49. Linkage assembly49is mounted to support structure41through auxiliary support411.\n\nThe linkage assembly49may include an actuator, a traveler, and a shaft connecting the actuator and the traveler. The traveler of the linkage assembly49may connect the first bending clamp42to the rotatable bending frame44. As described above, a metal beam will twist if the bending force is not applied in a plane that passes through the shear center. When applying a bending force in accordance with the present invention from the first bend actuator42, the rotatable bending frame44is allowed to freely rotate as the metal beam begins to twist. This rotation may be sensed by one or more sensors on the device, which may then trigger the activation of the linkage assembly49through the control system60. Indeed, upon twisting, the linkage assembly automatically raises or lowers the traveler with the actuator to adjust the angle of the bending force from the first bend actuator42. The linkage assembly49may continue to adjust the bending force until no further twisting is detected in the rotatable bending frame. Accordingly, when no further twisting is detected during the application of the first bending force, it is understood that the line of force applied through the first bend actuator42is passing through the shear center of the metal beam.\n\nIn a specific embodiment, linkage assembly49may include an actuator491, a spacer492, a mounting bracket493, a rod495, and a traveler496. As would be understood by a person having ordinary skill in the art, the linkage assembly49may include: an electric screw actuator, a hydraulic actuator, a pneumatic actuator, or a combination thereof. In a preferred embodiment, the actuator492is an electric motor and servo for turning rod495, which is preferably a threaded rod, to adjust the position of the traveler496with respect to the axis of the first bend actuator42.\n\nThe traveler496may include wheels496-1and496-2, which are placed at either end of the traveler496. Wheel496-1may connect with channel497, which is located on movable plate412. Moreover, the rod424may connect to movable plate412, as shown inFIG. 6. Movable plate412is slidably connected to support structure41through a set of tracks. The tracks of support structure41and movable plate412allow the movable plate412to move with the rod424and thus translate the first bending force to the channel497. Wheel496-2may connect with channel498, which is located on the rotatable bending frame44. Accordingly, movement of the movable plate412may be translated to the rotatable bending frame44through the traveler496and channels497and498.\n\nThe linkage assembly49may include rotation sensor497. Specifically, rotation sensor497may include a laser sensor that directs a laser on a target that is fixed to the rotatable bending frame44(not shown). As the rotatable bending frame44rotates, the rotation sensor497provides a signal to the control system60that is representative of such rotation. As described above, the control system60then activates the linkage assembly49to adjust the angle of the first bending force to provide a line of force that traverses the shear center of the metal beam. This angle is identified when the metal beam stops twisting.\n\nThe second bend actuator43provides a second bending force to the rotatable bending frame44and, therefore, provides a force to the metal beam that is locked in the second locking clamp46, which is mounted in the gimbal45. As would be understood by a person having ordinary skill in the art, the second bend actuator43may include: an electric screw actuator, a hydraulic actuator, a pneumatic actuator, or a combination thereof. Indeed, a variety of actuators may be used to provide a second bending force to the rotatable bending frame44in accordance with the invention. In preferred aspects, the first bending force and second bending force may be provided in a 2:1 ratio.\n\nThe second bend actuator43may include an actuator431, a spacer432, a mounting bracket433, and a rod434. The actuator431may be an electric motor and servo for turning rod434, which is preferably a threaded rod, to provide a second bending force. The second bend actuator43may be mounted on support plate413, which is connected to support structure41through a set of tracks. For example, the set of tracks connecting support plate413to support structure41allows for horizontal movement of the second bend actuator43. As would be understood by a person having ordinary skill in the art, the position of the support plate413may be locked through a fastener, such as a screw, or may be allowed to drift during bending processes upon the application of force from the first bend actuator42.\n\nThe present invention also includes a movable bracket435, which is connected to rod434. Movable bracket435is located on movable plate414, which is slidably connected to support plate413through a set of tracks. The tracks of support plate413and movable plate414allow the movable plate414to move with the rod434and thus translate the second bending force to the rotatable bending frame44. The movable bracket435may be connected to the rotatable bending frame44through pivot assembly441.\n\nPivot assembly441includes a boss and a crescent channel where the boss may fit and slide within the crescent channel. For example, movable bracket435may include the boss and the rotatable bending frame44may include the crescent channel. The crescent channel may be configured to allow the rotatable bending frame44to rotate clockwise or counter clockwise, depending upon the rotation of the gimbal45. The boss may be a metal protrusion or a wheel fixed to the movable bracket435or the rotatable bending frame44. Preferably, the boss is fixed to the movable bracket435.\n\nThe rotatable bending frame44is connected to the gimbal45at pivot points451and452. Moreover, channel498is also connected to rotatable bending frame44at pivot point451. As described herein, the rotatable bending frame44is provided to receive the first and second bending forces and translate those forces to the gimbal45.\n\nGimbal45, in conjunction with its connection to rotatable bending frame44, allows the second locking clamp46to rotate about three axes of rotation. Specifically, the gimbal45is provided to allow a metal beam to rotate or bend freely during formation. Free movement may prevent additional stresses on the metal beam from out of plane bending forces or torsional forces produced during bending processes.\n\nThe locking clamp46may include one or more face plates46A, which are provided to protect and support the internal components of the second locking clamp46. Furthermore, the locking components of the locking clamp46define a second aperture47through which the metal beam may pass.\n\nThe gimbal45may also have a pneumatic or hydraulic cylinder48connected at a pivot point to provide pneumatic or hydraulic pressure, as necessary, to any pneumatic and/or hydraulic actuators in the second locking clamp46.\n\nThe gimbal45may also be connected to one or more counter balance actuators, such as actuator455, which may be provided to offset the weight and inertia of the gimbal45. The one or more counter balances may allow the gimbal45and/or the rotatable bending frame44to move in response to either twisting or bending of the metal beam during bending processes.\n\nThe second locking clamp46is shown in greater detail inFIG. 7. The second locking clamp46may be rotatably connected to the gimbal45at pivot points453and454.\n\nThe second locking clamp46may include two or more locking shoe assemblies for locking the position of a portion of the metal beam. Each locking shoe assembly may include (1) a shoe that abuts a surface of the metal beam and includes a deformable or nondeformable surface (e.g., a nondeformable metal surface); (2) an actuator; and (3) a driving member that translates force from the actuator to the shoe, which may be: a rod, a wedge and rolling block, a wedge and sliding block, or a combination thereof. Specifically, the second locking clamp46may include two opposing shoes or shoe assemblies.\n\nIn another embodiment, the second locking clamp46may include three opposing shoes or shoe assemblies. Preferably, the second locking clamp46includes four opposing shoes or shoe assemblies. Furthermore, the second locking clamp46may include two locking clamps. However, in certain embodiments, the second locking clamp46is a single locking clamp having four shoe assemblies. The second locking clamp46ofFIG. 7is shown in its closed configuration.\n\nSpecifically, the second locking clamp46ofFIG. 7includes shoes46-1,46-2,46-3, and46-4. The components of locking clamp46in the bending clamp member40are configured to accommodate a metal beam having a Z-shaped cross-section. However, it is understood that a person having ordinary skill in the art could reconfigure locking clamp46, in view of the present specification, to accommodate metal beams having an I-shaped cross-section, a Z-shaped cross-section, a J-shaped cross-section, a T-shaped cross-section, an L-shaped cross-section, or a U-shaped cross-section.\n\nShoe46-1may be connected to support structure46-12, which is fixed through a pivot454to cylinder48. Moreover, support structure46-12is rotatably connected to the gimbal45through the pivot45-4. Shoe46-1may function as an anvil upon which other shoes (i.e.,46-6and46-7) may act.\n\nShoe46-2is connected to sliding block and wedge assembly46-6. The sliding block and wedge assembly is connected to a sliding track on support structure46-13. As shown inFIG. 7, and as used herein, the “sliding block and wedge assembly” includes (1) a sliding block having a surface that abuts or is otherwise connected to the shoe and an angled surface; and (2) a wedge that is connected to a piston of an actuator, wherein the wedge is placed in contact with the angled surface of the sliding block and movement of the wedge results in movement of the sliding block. The wedge of the sliding block and wedge assembly46-6is connected to actuator46-9via a piston of the actuator46-9. When the actuator46-9extends its piston, the sliding block and wedge assembly46-6disengages, which retracts the shoe46-2. When the actuator46-9retracts its piston, the sliding block and wedge assembly46-6engages, which drives the shoe46-2into frictional engagement with a surface of the metal beam in the aperture47.\n\nShoe46-3is connected to sliding block and wedge assembly46-7. More specifically, shoe46-3is part of the sliding block in sliding block and wedge assembly46-7. The sliding block and wedge assembly46-7is connected to a track on the support structure46-14. The wedge of the sliding block and wedge assembly46-7is connected to actuator46-10via a piston of the actuator46-10. When the actuator46-10extends its piston, the sliding block and wedge assembly engages, thereby frictionally engaging the shoe46-3with a surface of the metal beam in the aperture47. When the actuator46-10retracts its piston, the sliding block and wedge assembly46-7disengages, thereby disengaging the shoe46-3.\n\nShoe46-4is connected to an actuator46-11via a piston of the actuator46-11. Furthermore, shoe46-4is connected to friction lock46-5. Friction lock46-5is provided to fix the position of shoe46-4and prevent disengagement during bending processes. Friction lock46-5is composed of alternating plates (e.g., 15 alternating plates). Every other plate from the friction lock46-5is connected to the shoe46-4. All the alternating plates are connected to actuator46-8via a piston of actuator46-8. In one embodiment, when the actuator46-8activates to compress the plates together, the resulting friction between the plates locks the position of the shoe46-4. For example, the actuator46-8could retract its piston, thereby compressing the alternating plates of the friction lock46-5where the piston passing through the plates terminates in a stopper at the distal end of the piston. As shown inFIG. 7, the actuators46-8and46-9are mounted to support structure46-12. The piston of actuator46-8passes through support structure46-12and shoe46-4in order to attach to friction lock46-5. Moreover, shoe46-4is slidably mounted to a track on support structure46-12.\n\nThe shoes and/or shoe assemblies of the second locking clamp46may be extended simultaneously or sequentially. The shoes and/or shoe assemblies of the second locking clamp46may have the ability to apply a restraining load on a portion of the metal beam to simulate hand pressure. The loading range may be from 1 to 100 lbs. The specific loading may be programmable and controlled from the control system60through the user interface61. The purpose of the loading is to simulate hand pressure and take out minimal amounts of warp from the metal beam to provide a more reliable displacement reading both during and after bending.\n\nThe locking clamp46may also include several springs46-15placed between the supports (e.g., support structure46-12) and shoes (e.g., shoe46-2) described herein in order to provide an opposing force for the shoe assemblies blocks to return them to their open configuration after an actuator is retracted.\n\nRegarding the actuators of second locking clamp46(i.e., actuators46-8,46-9,46-10, and46-11), each actuator may be in fluid communication with the supply cylinder48through one or more tubes that connect with the supply cylinder48through pivot point45-4and any intervening support structures (e.g., support structure46-12).\n\nAs shown inFIGS. 2 and 3, the apparatus1may include a metal beam cradle51having a metal beam feed mechanism52, retractable metal beam supports53, a metal beam advancing member54connected to feed mechanism52, and an advancing take up actuator55connected to the advancing member54. The apparatus1may also include a sensor, such as a laser sensor, that measures the length of the metal beam to be advanced into the fixed clamp member30and bending clamp member40.\n\nThe metal beam cradle51may include a track upon which the advancing member54may be placed. The feed mechanism52may include an electric motor having a belt or cable connected to the advancing member54such that the advancing member may be moved along the metal beam cradle51by operation of the feed mechanism. A metal beam50to be fed into the fixed clamp member30and bending clamp member40by the metal beam cradle51at its proximal end may have a distal end that is connected to the advancing member54. Additionally, the metal beam50may be placed in the retractable metal beam supports53. The feed mechanism may be connected (either wirelessly or through a wired connection) to the control system60.\n\nUpon activation of the feed mechanism52, the metal beam50may be advanced along the metal beam cradle51by moving the advancing member54. Furthermore, as the advancing member54proceeds along the track of the metal beam cradle51, the retractable beam supports53(which include an actuator and switch) may be retracted by the advancing take up actuator55which uses a retractable wheel, connected to a pneumatic actuator, to contact a switch on each of the retractable metal beam supports53. By retracting the metal beam supports53, the apparatus1prevents a collision between the supports53and the advancing member54. In certain embodiments of the invention, retractable beam support spacing (i.e., the distance between each retractable beam support53) may be, for example, about 5 to 25 inches.\n\nThe apparatus1may further include a control system60that is provided to monitor the various components of the apparatus, provide commands or instructions to the various components of the apparatus, and record data associated with the bending processes of the apparatus1. The control system60may be connected to and/or communicate with one or more of the components of the apparatus including, for example, the fixed clamp member30, the bending clamp member40, the metal beam cradle51, the actuator supply unit70, and the part scanner80. Additionally, the control system60may further communicate with a remote server100.\n\nThe terms “communicate,” “communication,” and “communicatively coupled” are defined herein, unless more specifically indicated (e.g, fluidic communication, mechanical communication), as a general state in which two or more components of the system1(e.g., and actuator of the fixed clamp member30and the control system60) are connected such that communication signals are able to be exchanged (directly or indirectly) between the components on a unidirectional or bidirectional (or multi-directional) manner, either wirelessly, through a wired connection, or a combination of both as would be understood by a person having ordinary skill in the art. As shown inFIG. 2, certain components of the apparatus1(e.g., the control system60, remote server100) may communicate with other components of the apparatus1through electrical connections120, which may be wired or wireless lines of communication, as would be understood by a person having ordinary skill in the art.\n\nThe control system60may include a processor, one or more transceivers or ports for communicating with connected components and sensors, and a user interface61. The term “processor” as used herein is a broad term and, unless more specifically indicated, is to be given its ordinary and customary meaning to a person of ordinary skill in the art, and furthermore refers without limitation to a computer system, state machine, and the like that performs arithmetic and logic operations using logic circuitry that respond to and process the basic instructions that drive a computer. The control system60of the invention may also include data storage devices that include non-transitory media, such as floppy disks and diskettes, compact disk (CD)-ROMs (whether or not writeable), DVD digital disks, RAM and ROM memories, computer hard drives and back-up drives, external hard drives, “thumb” drives, and any other storage medium readable by a computer for the storage of electronic data, in any form, as described herein.\n\nThe user interface61of control system60may include at least one of textual, graphical, audio, video, animation, and/or haptic elements. A textual element may be provided, for example, by a printer, monitor, display, projector, etc. A graphical element may be provided, for example, through a monitor, display, projector, and/or visual indication device, such as a light, flag, beacon, etc. An audio element may be provided, for example, through a speaker, microphone, and/or other sound generating and/or receiving device. A video element or animation element may be provided, for example, through a monitor, display, projector, and/or other visual device. A haptic element may be provided, for example, via a very low frequency speaker, vibrator, tactile stimulator, tactile pad, simulator, keyboard, keypad, mouse, trackball, joystick, game pad, wheel, touch pad, touch panel, pointing device, and/or other haptic device, etc.\n\nThe user interface61may include a part scanner (e.g., a wand, bar code reader, and the like) that may be used to scan a code associated with a metal beam50to be subject to a bending operation and download or otherwise retrieve metal beam related information from a look up table stored at the control system60or on a remote server100. For example, the metal beam related information may include part parameters, bending instructions, or other requirements necessary to provide a bending operation on a specific metal beam. Accordingly, in certain embodiments of the invention, the apparatus1may incorporate a bar code reader or scanner that is used to read the part number and work order number into the control software.\n\nReferring to the control system60more broadly, control of the system may be performed by the control system60with the user interface61. The user interface61may display all operating conditions including ram or mechanical forming element displacement or location, part displacement (including if the part is not initially straight before forming), the required amount of deflection being formed, the difference between required deflection and what is currently in the part, the load being applied by the ram (in psi or lbf), and the status of the pumps, valves, safety systems, inspection systems, critical operating components, alarm conditions, and the current mode of operation (e.g., manual or automatic). The control system60may also be programmed to monitor and record apparatus and part operating parameters and alarm conditions and keep historical records of machine runs by part number and work order, for example. All data generated by the apparatus1, and recorded at the control system60, may be transferred to a remote server100having a remote user interface110.\n\nThe control system60may be programmed to execute part number specific programs for a forming cycle. Operation of apparatus1may be conducted using the user interface61with a program download function and serial interface with an additional computer, such as a laptop. All apparatus operations may be conducted at the user interface61.\n\nWhen part numbers are scanned in at the user interface61, the apparatus1may automatically configure itself to the part number that may be scanned in (e.g., wanded in), and may notify an operator if the part number is invalid or a part program does not exist. The control system60may also allow the part number and work order number to be entered manually at the user interface61, or selected at the user interface61from a table or menu of available part numbers. A user may upload a new part number, and associated program at the user interface61.\n\nFor example, when a part number is entered into the control system61, the user interface61may display part specific information to aid a user when loading the metal beam into the device. The part specific information may include, for instance, pictorial representations to assist a user in identifying that the correct end of the metal beam is loaded in to the device, or it may be other part specific information that is important to the correct operation of the machine, such as operations instructions.\n\nControl of the apparatus1may be accomplished by monitoring and adjusting the mechanical forming elements (e.g., bending clamp member40and fixed clamp member30) according to the readings of an inspection system that measures part displacement in the device and compares the readings to the required displacement for the given part number at the location indicated.\n\nThe control system60may control the components of the apparatus1to produce the required bends in the metal beams, with incremental feedback for adjusting the fixed clamp member30and the bending clamp member40to compensate for differences in metal beam spring back or incoming part flatness that require additional bends or “hits” to achieve the desired forming tolerance. The control system60may be able to correct overform conditions when too much contour has been formed into a part. The control system60may then display actual part displacement relative to the required displacement at the user interface61to guide the user. In certain embodiments, the actuators of the invention may be prepared to provide a force of up to about 1 to 50 tons, as needed, to bend the metal beams or other materials by the apparatus and methods of the invention. For example, the actuators of the invention (e.g., actuators42and43) may provide a bending force of about 12,000 pounds (i.e., about 6 tons).\n\nThe control system61may be configured to operate the components of the apparatus1(e.g., fixed clamp member30, bending clamp member40, and metal beam cradle51) in either automatic mode or manual mode.\n\nIn manual mode, all apparatus components are controlled by user input at the user interface61. The control system60allows for fully manual operation of all controls upon demand.\n\nWhen a part program or spring back model exists for the metal beam being formed, and the manual mode is selected, the control software at the control system60may display on-screen prompts at the user interface61for what the apparatus settings should be at the fixed clamp member30and bending clamp member40to achieve the desired amount of form in the metal beam50to achieve a certain contour. The on-screen prompts at the user interface61may be based on pre-programmed values for the metal beam being formed.\n\nIn the automatic mode, all apparatus components of the invention are controlled by a program that is tied to a specific part number for a metal beam50. In the event that the part displacement is not achieved by the programmed setting, the user may be given the option to let the system incrementally form the piece to the desired tolerance using a saved adjustment routine, or override the incremental adjustment routine with specific user defined manual inputs.\n\nThe control system60may have logic to permit decisions to be made, such as adjusting the forming element displacement when part displacement readings fall outside of specified limits or an overform condition occurs.\n\nThe control system60may generate alarms when predetermined conditions are met, such as the hydraulic fluid is over or under a predetermined operating temperature, hydraulic level is low, a travel limiter has been tripped, an over pressure has occurred, a safety feature has been activated, or a system fault has occurred. The alarm conditions may be identified by a text message at the user interface61and stored in an alarms log, along with the date and time of occurrence. Alarm messages may be written in a form that is easy for the user to understand without having to refer to a manual or error register.\n\nA user interface61at the control system60may be used to record the part number, part work order number, part inspection records, alarm conditions, date, time, and other essential operating parameters. Historical data generated by device runs shall be collected and stored. The control system60shall automatically assign data files to the work order number of the metal beam for later retrieval.\n\nThe control system60may be programmed to generate text reports on each part by specific work order numbers. The control system60may also be programmed to provide a contour inspection report for each individual work order number that describes the displacement requirement at each station formed, the actual metal beam displacement at that location, the difference between required and actual, and a PASS/FAIL assessment based on the forming tolerance. The inspection report may list the part number, work order number, date, time, and forming routine used, along with other pertinent information. The control system60may be programmed to generate a text report of alarm conditions experienced by the device that detail the specific alarm, the component or member that generated the alarm, and the data and time of the alarm.\n\nPart specific programming may be accomplished from a laptop or portable computer (PC) connected to the user interface61at the control system60; or by using a remote server100connected via the Internet to the control system60.\n\nFurthermore, the control system60may be programmed to generate a calibration report upon demand for records keeping. The report may include the date, time, and readings from each of the measuring devices relative to the measurement standard. The report may indicate PASS or FAIL based upon the difference between the standard and actual reading against a pre-defined tolerance. The report may be electronically stored as part of the calibration records. The report may reference governing specifications or standards for the calibration. For example, when applying a bend, a passing displacement may have a pre-defined tolerance of about +/−0.020 inches. Thus, in certain embodiments, a passing displacement at a bend may be defined as being a displacement that is within 0.020 inches of a predetermined displacement for a given bend location along a metal beam.\n\nThe apparatus1may include an actuator supply unit70, which may be a reservoir and/or pumping system to provide a positive pressure source for the actuators described herein. Indeed, each actuator described herein, unless more specifically defined (i.e., the actuators of second locking clamp46), may have one or more hoses connected to the actuator supply unit70. Moreover, the actuator supply unit70may be connected to or in communication with control system60. The control system60may monitor the operability of the actuator supply unit70and provide commands or instructions to the actuator supply unit70as necessary to operate the actuators described herein. In certain embodiments, the actuator supply unit70may include a pneumatic pressure source or reservoir, a hydraulic pressure source or reservoir, or a combination thereof. Preferably, the actuator supply unit70includes a pneumatic-hydraulic pressure source and reservoir (e.g., an air over oil pressure source).\n\nThe apparatus1may further include a contour inspection system80. The contour inspection system80may be connected to the platform10and may receive the metal beam50after it exits from the bending clamp member40. The contour inspection system80may include one or more sensors that measure the contour of the formed metal beam as it exits the bending clamp member40. Alternatively, the contour inspection system80may be located proximate to the bending clamp member40and may include at least one sensor that measures the displacement of the metal bream after the bending clamp member40releases the metal beam50and returns to a neutral position. If, after the bending clamp member40returns to a neutral position, the contour inspection system80finds that the bend and/or contour is within pre-defined tolerances (e.g., about +/−0.020 inches) the metal beam50may be advanced to the next bend location. For example, the sensors may include one or more followers or lasers that map and/or measure the contour of the formed metal beam. The sensors at the contour inspection system may be transmitted in real time to the control system60to allow a user to monitor the forming process or prepare a report. The purpose of the contour inspection system80is to eliminate the need for contour check templates that require removal of the part from the apparatus1. At the conclusion of the forming operation, the invention may include the preparation of a machine generated inspection report by the control system60that verifies compliance to a contour requirement.\n\nFurthermore, the apparatus1may include one or more sensors (e.g., followers) that may measure and record the amount of travel of the part into the machine for positive location, the initial part displacement, the amount of travel or displacement of the mechanical forming elements, the location of the machine elements that support or clamp the work piece, and the resulting part displacement following bending. These measurements may be recorded at the control system60and displayed at the user interface61. Travel of the metal beam50may be limited by the control system60to prevent part overload and damage. The travel limits may be predetermined in a technique sheet that applies to a specific forming operation.\n\nBased on the foregoing, the apparatus1may provide a variety of additional features. For example, the apparatus1may control, prevent, or correct out of plane deformations in the flanges or web of the metal beams being formed by using the bending clamp member40. The apparatus1may also maintain the angle between the flanges and web of the part being formed through the use of fixed clamp member30and bending clamp member40.\n\nThe apparatus1may also control, prevent, or correct overform, where too much displacement is formed into a metal beam and the part must be formed in the reverse direction to achieve the desired contour tolerance. The apparatus of the invention may impart positive and negative curvature for contour reversals or perform contour corrections for overform conditions with the bending clamp member40. In other aspects, the apparatus1may compensate for warped material, where the warp may be removed with minimal loading (e.g., 10 lbs) that represents hand pressure on the material.\n\nThe apparatus1may also include a metal beam support90that cradles or supports the metal beam50after it exits the bending clamp member40and/or the contour inspection system80. The metal beam support90may be a tray or table. Securing the output of the apparatus1may become important during the forming process to prevent injury or damage to the metal beam as the metal beam is advanced through the apparatus1. When a forming load is applied to a part or metal beam, the free ends of the part may react by flexing in the opposite direction of the loading. For example, if a downward load is applied vertically to the part, the free ends will spring vertically upward. If the load is applied horizontally to the part, the free ends will likewise flex horizontally in a direction that is opposite to the loading. As described herein, the forming components of the apparatus1may be designed to control or compensate for the free end reactions to the forming load to prevent the part from being damaged or to protect an operator or bystanders. In addition, the metal beam cradle51and the metal beam support90may combine to support the total length of the part throughout the forming of the part in the apparatus1at all times. Accordingly, the apparatus1includes components that may support the metal beam50before, during, and/or after the forming process to prevent damage to the metal beam and prevent injury to bystanders.\n\nAdditionally, the apparatus1may include a power source (e.g., an AC power source) for powering the various components therein.\n\nThe present invention also includes a method of bending a metal beam that has a shear center and at least one principal axis with a bending apparatus (e.g., apparatus1) to produce a deflected metal beam. In preferred aspects, the bending apparatus has a fixed clamp member (i.e., fixed clamp member30) and bending clamp member (i.e., bending clamp member40), as described herein.\n\nBroadly, the method of the invention may include the steps of inserting a metal beam into the fixed clamp member and the bending clamp member and clamping a first portion of the metal beam in the fixed clamp member and clamping a second portion of the metal beam in the bending clamp member. The methods of the invention may further include bending the metal beam through its shear center and along at least one principal axis by: (1) applying a first bending force to the metal beam with a first bend actuator; (2) detecting twisting of the metal beam and, if twisting is detected, modulating the angle at which the first bending force is applied with a linkage assembly until no twisting is detected; and (3) applying a second bending force to the metal beam with a second bend actuator, wherein the first bending force and the second bending force combine to bend the metal beam along the at least one principal axis. For example, the first bending force may be applied with a force of about 2,000 to 8,000 pounds and the second bending force may be applied with a force of about 2,000 to 8,000 pounds, where the first and second bending forces are applied in about a 2:1 ratio, respectively. Finally, the methods of the invention may include receiving the deflected metal beam from the apparatus of the invention.\n\nThe present invention provides a bending method1000inFIG. 8. In a first step of the method1000, a user of the apparatus1may scan a reference for a metal beam to be deflected (step1010). Upon scanning the metal beam reference, the user may access and receive at a user interface the bending routine and bending instructions for the metal beam (step1020). The bending routine and instructions may include either a bending program for an automated process or a list of bends, and where such bends should occur on the metal beam, for a manual bending process. Both the automated process and the manual process will include an index that defines where all the deflections should occur on the metal beam with associated magnitudes of the deflections to provide a specific contour for the metal beam.\n\nAfter processing the bending routine and bending instructions for the metal beam, the user may load the metal beam into the metal beam forming device (i.e., apparatus1) (step1030). Loading the metal beam may include ensuring that a first bending location is aligned with the bending clamp and fixed clamp of the apparatus1.\n\nThe metal beams formed by the methods of the invention may be symmetrical or unsymmetrical. However, various metal beams may be formed by methods of the invention including, but not limited to, metal beams having an I shaped cross-section, a Z-shaped cross-section, a J-shaped cross-section, a T-shaped cross-section, an L-shaped cross-section, a U-shaped cross-section, or a combination thereof. In certain embodiments of the invention, the metal beams formed by the methods of the invention are Z-shaped metal beams. In addition, the metal beams of the invention may be aircraft stringers.\n\nThe methods of the invention may be used to form any beam, for example metal beam, which includes a metal alloy or any other material that exhibits plastic deformation where the other material is loaded above its proportional limit. The proportional limit may be defined as the maximum stress for which the stress remains proportional to strain and permanent deformation may begin to occur. For example, the metal alloys of the invention (e.g., those alloys used in a metal beam) may be selected from the group consisting of an aluminum alloy, a titanium alloy, a magnesium alloy, a steel alloy, and a combination thereof.\n\nUpon loading the metal beam, the metal beam is locked at a first portion and second portion in the forming device at a bend location that is provided according to the index (step1040). The user may then confirm that the metal beam is locked to ensure that the bend may occur at the correct bend location.\n\nAfter locking, the metal beam may be deflected at the bend location by applying a first bending force to the metal beam (e.g., a horizontal bending force) with a first bend actuator (step1050). During the application of the first bending force, a sensor is used to determine if any twisting in the metal beam is detected due to the first bending force not being applied through the shear center of the metal beam (step1070).\n\nIf twisting of the metal beam is detected, the line of force is adjusted by varying the angle at which the first bending force is applied to the metal beam (step1080). The line of force is adjusted until twisting of the metal beam stops. When the twisting stops, the angle of the line of force is maintained and it is presumed that the line of force from the first bending force is in a plane that passes through the shear center of the metal beam.\n\nThe method then includes a determination of whether out of plane displacement of the metal beam has occurred during the bending process (step1090). If out of plane bending has occurred or is occurring, a second bending force is applied in a direction substantially perpendicular to the first bending force to correct the displacement of the metal beam (step1100). However, as a person having ordinary skill in the art may appreciate, the first and second bending forces need not be substantially perpendicular provided that they combine to yield a line of force along a principal axis of the metal beam. Indeed, in preferred embodiments of the invention the first bending force and the second bending force combine to provide a line of force along a principal axis of the metal beam. Moreover, the first bending force and second bending force may be provided in a ratio of about 2:1, respectively.\n\nAfter deflection of the metal beam, and providing any corrections to adjust for twisting of the metal beam (step1080) or out of plane bending (step1100), the bending components of the apparatus1are returned to their neutral position and the deflection of the metal beam may be measured to determine if the bend required for the bend location matches the measured magnitude of displacement (step1120). For example, the forming tolerance may be about +/−0.020 inches for each bend or deflection.\n\nIf the metal beam deflections are not within predetermined tolerances, the apparatus1is then activated to again deflect the beam at the bend location (step1050). If the metal beam deflections are within predetermined tolerances, the apparatus1(automatic mode) or the user (manual mode) determines if the last bend location has been reached according to the bend index for the specific metal beam (step1140). If the last bend location has not been reached, the metal beam is unlocked from the fixed clamp and bending clamp of the apparatus1and the metal beam is advanced through the apparatus1to the next bend location according to the bend index (step1150). The next bend location is then located at the fixed clamp member and the bending clamp member and the metal beam is then locked as described above at step1040. Steps1050to1120are then repeated for the next bend location to shape the metal beam to the appropriate contour.\n\nHowever, if the last bend location has been reached according to step1140, the completed metal beam is inspected by either the user with a contour template or the metal beam is inspected automatically with a contour inspection system of the apparatus1(step1160).\n\nUpon completion of the inspection, the control system of the apparatus1may prepare an inspection report that may be displayed at the user interface of the control system (step1170).\n\nAfter completion of the inspection report, the deflected metal beam may be removed from the forming apparatus1(step1180). The apparatus1may then be reset to receive the next metal beam.\n\nRegarding the deflection steps of the methods of the invention, and related apparatus components, the present invention provides automatic forming to achieve a desired metal beam contour. The desired contour for a formed metal beam may be provided using a look up table (i.e., a bending table or index that lists the preferred displacement at a plurality of bend locations along a metal beam) or may be prepared during forming with the control system60based on a three-dimensional model of a curved metal beam having the desired contour. Indeed, the control system60may be programmed to receive the three-dimensional model of the curved metal beam having the desired contour and may map out the bend locations along the metal beam to provide the desired contour.\n\nA spring back model may be used in accordance with the invention to compensate for multiple hits and the hysteresis as described by a material stress strain diagram when plasticity occurs during repeated loading and unloading. The spring back model may be developed with the use of material simulations including, for example, finite element modeling, material modeling, or other material simulation methods known in the art. When deflecting or bending metal beams, the apparatus and methods of the invention may account for the spring back of the metal beams by providing an overform deflection as set forth in a pre-determined look up table. Alternatively, the overform deflection may be applied with the aid of a spring back model as described herein.\n\nSpring back of a particular metal beam is affected by alloy and temper, cross-section, heat lot variations, and warp. In preferred methods of the invention, all of the metal beams will be of the same alloy and temper. However, certain metal beams formed by the methods and apparatus of the invention may have varied cross-sections. For example, when forming aircraft stringers, the cross-sections may vary along the length of the metal beam, as part height tapers from inboard to outboard end and part thickness changes. There may also be variations in heat lot and warp from part to part of the same part number.\n\nThe machine control system of the invention may be programmed to self-adjust or compensate when the spring back specific data does not produce the desired result. There are a number of methods to accomplish this self-adjustment feature. One is to monitor the running error between the applied deflection and the resulting part deflection and factor that error compensation into subsequent applied deflections. Another method is to “creep” up onto the required deflection in the part with multiple bends or “hits.” However, the number of hits allowed, for certain methods of the present invention, may be limited depending upon the specification for a metal beam. For example, limitations may include providing only three hits in one direction at any single location on the part plus one reverse hit for correcting overform. The metal beam may be indexed by 1-inch inboard or outboard to allow additional hits to bring a particular station into contour tolerance.\n\nIn certain embodiments of the invention, a spring back model may be used to develop system settings. The spring back model may encompass processing material specific data like stress strain curve data, computer simulation data, finite element model data, or data developed from simple bending tests.\n\nThe apparatus and methods of the invention may also include forming metal beams at elevated temperatures. For example, apparatus1may include a heater configured to heat the metal beam before bending. In addition, the methods of the invention may include receiving a heated metal beam before loading the metal beam into the forming apparatus at step1030of the method1000.\n\nOne exemplary use of the methods of the invention is for forming aircraft stringers, such as aluminum wing stringers, at room temperature. Indeed, the apparatus of the invention may mechanically form aircraft stringers that are less than about 60 feet in length, with structure on either side of the forming elements to support the pieces being formed as they are advanced through the device.\n\nFor certain aircraft, there are 44 stringers of 4 different configurations that require forming per wing, seeFIG. 9. There are right and left hand variants of each part, which are not necessarily symmetrical, making a total of 88 parts to be formed per aircraft. The most common configuration is the Z cross-sectioned stringer. There are also vent stringers of a channel or hat shape, splice stringers of a “J” shape, and coaming stringers, which are a Z with a wider attachment flange. Preferably, the device and methods of the invention may be used to form Z stringers because the upper and lower Z stringers make up 82 out of 88 stringers on the aircraft.\n\nAll stringer dimensions are subject to change from the inboard end of the part to the outboard end. The formed shapes vary of from a simple bow or “U” shape, with all the deflection in one direction, to “U” shapes with reversals, to “S” shapes with multiple contour reversals.\n\nIn aircraft forming applications, the apparatus of the invention may form permanent deformations in wing stringers that are machined from aluminum lithium alloy 2099-T83, but may also be adapted to form other aluminum alloys including those in the 2000, 6000, and 7000 series, such as alloys 2024, 2124, 2324, 7075, 7449, and 7055.\n\nThe present methods of the invention can be embodied as a computer implemented process or processes and/or apparatus for performing such computer-implemented process or processes, and can also be embodied in the form of a tangible storage medium containing a computer program or other machine-readable instructions (herein “computer program”), wherein when the computer program is loaded into a computer or other processor (herein “computer”) and/or is executed by the computer, the computer becomes an apparatus for practicing the process or processes. Storage media for containing such computer programs include, for example, floppy disks and diskettes, compact disk (CD)-ROMs (whether or not writeable), DVD digital disks, RAM and ROM memories, computer hard drives and back-up drives, external hard drives, “thumb” drives, and any other storage medium readable by a computer. The process or processes can also be embodied in the form of a computer program, for example, whether stored in a storage medium or transmitted over a transmission medium such as electrical conductors, fiber optics or other light conductors, or by electromagnetic radiation, wherein when the computer program is loaded into a computer and/or is executed by the computer, the computer becomes an apparatus for practicing the process or processes. The process or processes may be implemented on a general purpose microprocessor or on a digital processor specifically configured to practice the process or processes. When a general-purpose microprocessor is employed, the computer program code configures the circuitry of the microprocessor to create specific logic circuit arrangements. Storage medium readable by a computer includes medium being readable by a computer per se or by another machine that reads the computer instructions for providing those instructions to a computer for controlling its operation. Such machines may include, for example, a punched card reader, a magnetic tape reader, a magnetic card reader, a memory card reader, an optical scanner, as well as machines for reading the storage media mentioned above.\n\nIt is noted that various sensor values and alarm values produced by the sensors or control system of the invention may represent actual physical conditions of different places and/or different equipment and/or different parts of the apparatus or other place, e.g., generally local conditions, that are transformed by the apparatus and methods described herein to provide a representation of the overall state and/or condition of the apparatus, a beam being bent, or place, e.g., a representation of a status at the sensor. That representation may be transformative of a representation of a nominal overall state and/or condition thereof, e.g., in a prior or different condition and/or time, to a representation of an actual overall state and/or condition thereof, e.g., in a present or more recent or otherwise different condition and/or time. In accordance with the foregoing, the apparatus described herein may include one or more general purpose and/or special purpose computers, or microprocessors or other processors, and the methods described herein may be performed in part by one or more general purpose and/or special purpose computers, or microprocessors or other processors.\n\nA number of patent and non-patent publications may be cited herein in order to describe the state of the art to which this invention pertains. The entire disclosure of each of these publications is incorporated by reference herein.\n\nWhile certain embodiments of the present invention have been described and/or exemplified above, various other embodiments will be apparent to those skilled in the art from the foregoing disclosure. The present invention is, therefore, not limited to the particular embodiments described and/or exemplified, but is capable of considerable variation and modification without departure from the scope and spirit of the appended claims.\n\nMoreover, as used herein, the term “about” means that dimensions, sizes, formulations, parameters, shapes and other quantities and characteristics are not and need not be exact, but may be approximate and/or larger or smaller, as desired, reflecting tolerances, conversion factors, rounding off, measurement error and the like, and other factors known to those of skill in the art. In general, a dimension, size, formulation, parameter, shape or other quantity or characteristic is “about” or “approximate” whether or not expressly stated to be such. It is noted that embodiments of very different sizes, shapes and dimensions may employ the described arrangements.\n\nFurthermore, the transitional terms “comprising”, “consisting essentially of” and “consisting of”, when used in the appended claims, in original and amended form, define the claim scope with respect to what unrecited additional claim elements or steps, if any, are excluded from the scope of the claim(s). The term “comprising” is intended to be inclusive or open-ended and does not exclude any additional, unrecited element, method, step or material. The term “consisting of” excludes any element, step or material other than those specified in the claim and, in the latter instance, impurities ordinary associated with the specified material(s). The term “consisting essentially of” limits the scope of a claim to the specified elements, steps or material(s) and those that do not materially affect the basic and novel characteristic(s) of the claimed invention. All apparatuses and methods described herein that embody the present invention can, in alternate embodiments, be more specifically defined by any of the transitional terms “comprising,” “consisting essentially of,” and “consisting of.”\n\n",
            "length": 76032
        },
        {
            "patent_id": "11013981",
            "text": "While the invention is susceptible to various modifications and alternative forms, specific embodiments have been shown by way of example in the drawings and will be described in detail herein. It should be understood, however, that the invention is not intended to be limited to the particular forms disclosed. Rather, the invention is to cover all modifications, equivalents, and alternatives falling within the spirit and scope of the invention as defined by the appended claims.\n\nDETAILED DESCRIPTION\n\nThis disclosure is susceptible of embodiment in many different forms. There are shown in the drawings, and will herein be described in detail, representative embodiments with the understanding that the present disclosure is to be considered as an exemplification of the principles of the present disclosure and is not intended to limit the broad aspects of the disclosure to the embodiments illustrated. To that extent, elements and limitations that are disclosed, for example, in the Abstract, Summary, and Detailed Description sections, but not explicitly set forth in the claims, should not be incorporated into the claims, singly or collectively, by implication, inference or otherwise. For purposes of the present detailed description, unless specifically disclaimed or logically prohibited: the singular includes the plural and vice versa; and the words “including” or “comprising” or “having” means “including without limitation.” Moreover, words of approximation, such as “about,” “almost,” “substantially,” “approximately,” “generally,” and the like, can be used herein in the sense of “at, near, or nearly at,” or “within 3-5% of,” or “within acceptable manufacturing tolerances,” or any logical combination thereof, for example.\n\nReferring generally toFIGS. 1 and 2, a ski pole accessory100is attached to a ski pole102to form a ski pole system103. According to this illustrative embodiment, and referring more specifically toFIG. 1, the ski pole accessory100includes three pole connectors104, a supporting base106, and a plurality of strings108. A string, as used herein, refers to a flexible elongated structure such as a streamer.\n\nIn other embodiments, the ski pole accessory100includes a different number of pole connectors104, e.g., a single pole connector104or any other number of pole connectors considered beneficial for the respective embodiment. InFIG. 1, the pole connector104is generally illustrated in the form of one exemplary connector in which a looped connector is secured to itself, around the ski pole102, via a hook. InFIG. 2, an alternative embodiment shows another exemplary pole connector204that is in the form of a zipped tie tied to the ski pole102. As further described below and illustrated inFIGS. 3 and 4, according to yet another exemplary embodiment a pole connector304is in the form of yet another connector configuration. Referring back to the illustrated embodiment ofFIG. 1, the configuration with three pole connectors104provides an advantageous stable attachment between the ski pole accessory100and the ski pole102.\n\nThe supporting base106of the ski pole accessory100is generally elongated, having a length SL (also referred to as a supporting length) that extends along at least a majority of a length PL (also referred to as a pole length) of the ski pole102. The supporting length SL extends along the pole length PL when the supporting base106is attached to the ski pole102. According to the illustrated embodiment, the supporting length SL is approximately 75% the pole length PL.\n\nThe supporting base106further has a width SW (also referred to as a supporting width) that extends generally perpendicular to the pole length PL when the ski pole accessory100is attached to the ski pole102. Thus, the supporting length SL is generally in a parallel orientation relative to the ski pole102, and more specifically, relative to a shaft108of the ski pole102that separates a handgrip110from a tip112.\n\nThe plurality of strings108has each string individually connected to and extending from the supporting base106, which collectively can form a streamer. The plurality of strings108extends along at least a majority of the supporting length SL of the supporting base106. For example, according to the illustrated embodiment the plurality of strings108extends along the entirety of the supporting length SL.\n\nEach string108is offset from an adjacent string108along the supporting base106, and has a free-moving end114that is opposite to an attached end116near the supporting base106. Each string108is free-flowing such that, in response to gravity, its free-moving end114extends generally parallel to the supporting base106in a vertical orientation (as illustrated inFIG. 2). Each string108extends generally perpendicular to the supporting base106in a horizontal orientation (as illustrated inFIG. 1). The free-moving end114flows freely based on one or more environmental and skiing factors, including, for example, gravity, wind force, skiing speed, skier posture, etc.\n\nAccording to the exemplary illustrated embodiment, the free-moving ends114of the strings108have a tapered effect in length across the supporting length SL of the supporting base106. Specifically, the strings108include a first outermost string108a, a second outermost string108b, and a plurality of innermost strings108c. The first outermost string108ahas a shorter length1L than a length2L of the second outermost string108b. Each of the plurality of innermost strings108chas a respective free-moving end that terminates on an imaginary tapered line TL drawn between a free-moving end114aof the first outermost string108aand a free-moving end114bof the second outermost string108b.\n\nAccording to a specific example, the first outermost string108ahas a length of about 152 millimeters (about 5.984 inches), the second outermost string108bhas a length of about 610 millimeters (about 24.016 inches), and the width of each string108is about 5 millimeters (0.197 inches). The width of each string108is parallel to the supporting length SL and perpendicular to the length of the respective string108. Each of these dimensions is implemented individually or in combination with each other.\n\nAccording to another example, the length ratio between the second outermost string108band first outermost string108ais about 4:1, the ratio of the length of the first outermost string108ato the width of each string108is about 30:1, and the ratio of the length of the second outermost string108bto the width of each string108is about 122:1. Each of these ratios is implemented individually or in combination with each other.\n\nAccording to yet another example, the supporting length SL of the supporting base106is about 610 millimeters (about 24.016 inches) and the supporting width SW is about 26 millimeters (about 1.024 inches). According to yet another example, the ratio between the supporting length SL and the supporting width is about 24:1. The dimensions and ratios disclosed above with respect to the strings108and the supporting base106are implemented individually or in combination with each other.\n\nThe plurality of strings108are made from one or more materials and include one or more colors. Collectively, the strings108can form or resemble a streamer. For example, according to one embodiment the plurality of strings108can be made from a pleather material that includes a variety of colors, including gold, silver, black and white. According to one example, all the strings108include a single color. According to another example, one or more strings108include a first color and one or more strings108include a second color. According to yet another example, at least on string108includes at least two colors.\n\nThe selected material is beneficially selected to provide the free flowing aspect of the strings108, while simultaneously enduring environmental elements and providing water-resistant or waterproof protection. Accordingly, the strings can be composed of other suitable materials including pleather, leather, plastic, feathers, weatherproof or synthetic paper, and the like. The selected colors are beneficial to enhancing the ski pole102, facilitating a dazzling effect as the skier speeds and slaloms down the ski slope.\n\nReferring generally toFIGS. 3 and 4, an exemplary pole connector is illustrated in the form of another configuration304that has a loop318, which extends from a main body320. The loop318is stretchable to wrap (or “loop”) around an object, such as the shaft108of the ski pole102(illustrated inFIGS. 1 and 2). When wrapped around the object (as illustrated inFIG. 4), the loop318is secured to a hook322that is positioned on the main body320and opposite to the loop318(as more clearly illustrated inFIG. 3).\n\nThe pole connector304wraps around the ski pole102and maintains its general position based on a frictional contact between the loop318and the shaft108. For increased frictional resistance, the loop318is made from a gripping material consisting of silicone. Silicone is beneficial in achieving the stretching of the loop318, as well as providing the desired frictional resistance for preventing undesired movement of the pole connector304relative to the ski pole102. According to other examples, other materials are selected that provide similar stretching and frictional resistance to silicone.\n\nAccording to yet another alternative example, the ski pole102includes respective hooks for receiving pole connectors of the ski pole accessory100. In other words, instead of or in addition to the hook322of the pole connector304disclosed above, the ski pole102includes its own hooks that are either permanently or removably affixed at respective positions along the shaft108.\n\nWhen skiing on a ski slope, a skier using the ski pole system103displays a unique, entertaining, and useful ski pole accessory100that not only dazzles with its free-flowing strings108, but also potentially protects the skier from at least some environmental factors (such as snow, water, rain, wind, etc.). Additionally, depending on the skier, the ski pole accessory100potentially provides an enhanced aerodynamic shape and look that facilitates improved balance and support while skiing. The aerodynamic shape provided by the ski pole accessory100continually and automatically (or naturally) changes as the skier proceeds down the ski slope, based on environmental factors, skier speed, and/or skier posture.\n\nBeneficially yet, the ski pole accessory100does not interfere with the skier's movement or standing when the skier is in a stopped position. The strings108fall naturally down (due to gravity) along the ski pole102(as illustrated inFIG. 2) to minimize any such potential interference. Thus, somewhat similar to wings of a bird, the ski pole accessory100helps enhance the utility and entertainment of an otherwise traditional ski pole that is used without the ski pole accessory100.\n\nEach of these embodiments and obvious variations thereof is contemplated as falling within the spirit and scope of the claimed invention, which is set forth in the following claims. Moreover, the present concepts expressly include any and all combinations and sub-combinations of the preceding elements and aspects. The present disclosure is not limited to the specific illustrated example but extends to alternative embodiments other shapes and/or configurations in accordance with the knowledge of one of ordinary skill in the art applied consistent with the presently disclosed principles.\n\n",
            "length": 11520
        },
        {
            "patent_id": "11010941",
            "text": "DETAILED DESCRIPTION\n\nThis disclosure is generally directed to a system and method for displaying (e.g., on a display device) in a two-dimensional array the structured interaction of two variables moving in tandem to achieve a target outcome (for example, balancing heat and pressure in a chemical reaction to yield a given compound). In various embodiments, the feasible values of the two system operating variables are represented by proxy values of X and Y scaled so that the range and interval of the X- and Y-axes are the same, and configured so that whenever the system is in an equilibrium or optimal state, the proxy value of X and equals the proxy value of Y. The resulting display has at least two distinct features: first, it forms a “matched array” of all operationally-relevant X,Y intersections, and second, the points at which the system is in equilibrium or at an optimum (the same points at which proxy values of X and Y are equal) all lie along a unique, clearly-delineated center diagonal of the displayed output (e.g., on a display device) referred to herein as the “alignment vector.”\n\nAccording to an embodiment, wherever on the display X and Y intersect, cells of the display can reflect several indicators of use to system operators: the values of the underlying operating variables, their proximity to the optimal position along the alignment vector, and the direction and extent of adjustments needed to reach the alignment vector to achieve optimal system performance. The presentation of the display can be on a display device (such as a computer monitor) including a matrix with shading and colors reflecting values relative to the alignment vector.\n\nIn an embodiment, the matched array system indicates the proximity to or distance from the optimal position of the X,Y values with an audible warning. In one implementation, the output is in an airplane cockpit instrument, in which the audio warnings sound when the X,Y intersection is dangerously far from the alignment vector, and with instructions on what to do to return to the desired flight path.\n\nIn an embodiment, the matched array system operates in two modes: normative, as in the above examples, in which the monitor or instrument provides information to be acted upon; and positive, in which the system, acting on the same information, automatically makes the needed adjustments to move the system toward the operating state represented by the alignment vector.\n\nAccording to various embodiments, a “matched array” system and method facilitates coordinated achievement of joint optimization results using a computerized display system and method that combines the two different metrics in one display, and articulating optimal settings along a unique “alignment vector.” The result is easier achievement of more consistently optimal performance, even by less experienced users.\n\nTurning toFIG. 1, the operation of a matched array system according to an embodiment will now be described. In this embodiment, the matched array system receives physical input (e.g., pressure, heat, or electrical inputs from a system such as a chemical or mechanical system) from a physical system101. The physical system101is similar to one that might be found in a chemical process in which the collected metrics indicate physical phenomena such a pressure, heat, or mechanical impulses. The physical input is received by a transducer102, which translates it into analog electrical signals. These analog electrical signals are received by an analog-to-digital (A/D) converter103, which converts the analog signals into digital signals. The digital signals are provided to a digital signal processor (DSP)104, which processes (e.g., filters) the signals into a form that is usable by a meter105or other device for displaying measurements. The processed signal is also used by an alignment computer106(which can be implemented as a separate hardware processor such as a controller or microprocessor, or as a computing device such as that shown inFIG. 17) that analyzes the range of feasible values of x and (later) y to determine a corresponding set of proxy values that form the X and Y axes of a matrix display. The alignment computer106controls a display device107(to display a matched array). A parallel set of actions is taking place in in a second transducer108, a second A/D converter109, and a DSP110, resulting in a signal111input to the alignment computer106. The alignment computer106converts x and y metrics to proxy values that have the same range and interval on the X and Y axes, respectively. The display device107plots the proxy values as an intersection on the matched array (i.e., in response to actual metric 1 and 2 data received).\n\nInFIG. 2, the operation of a matched array system according to an additional embodiment is illustrated. In this embodiment, the matched array system receives data (e.g., business or financial information) from a business system201(e.g., a computing device such as that shown inFIG. 17). A data base202receives metric 1 and metric 2 data from the business system and feeds them into a data processor203(e.g., a computing device such as that shown inFIG. 17) which modifies the data for meaningful manipulation in later stages (e.g., conversion to log numbers, multiplication by a relevant coefficient, formatting). In an embodiment, an additional optional step processes the two data elements through an analytics engine204that might also, for example, combine the data received with additional data205, or otherwise enhance, interpret, or modify the data for processing by an alignment computer206(which can be implemented as a separate hardware processor such as a controller or microprocessor, or as a computing device such as that shown inFIG. 17). The alignment computer206converts the two variables to proxy values that have the same range and interval on the X and Y axes, respectively, enabling them to be plotted together on a matched array display207.\n\nFIG. 3portrays an “alignment computer”300(which can be implemented as a separate hardware processor such as a controller or microprocessor, or as a computing device such as that shown inFIG. 17) and the series of actions it implements to calibrate the axes of the matched array system so that when the overall system is at an optimum or in equilibrium, proxy values for x and y are equal. The matched array system can portray optimum or equilibrium positions when two conditions are present: first, each proxy value axis X or Y must be able to represent the relevant range of the underlying operating metrics; and second, the range and interval of the proxy values are the same. When these conditions exist, intersection set x=y will lie along the center diagonal of a rectilinear array. When the system designer or alignment computer follows these guidelines, the matched array will be properly calibrated, and the settings will be applicable to the foreseeable functioning of the matched array system in much the same way that the scale of a car's speedometer does not have to be re-calibrated for each trip.\n\nIn an embodiment inFIG. 3, a system designer or a microprocessor sets three specific conditions that support alignment computer operations: the operating system objective function301(e.g., product yield, aircraft flight orientation), the range and period of operation of the underlying operating system302, and any constraints and discontinuities303that apply to the metrics of the underlying operating system. Together, these settings ensure that the matched array system can search and calculate proxy values within the appropriate feasible range of values for x and y when a system operator, or alternatively a microprocessor or transducer, introduces test or actual operating data to the matched array system database304. In an embodiment, after receiving the data, or alternatively concurrent with the receipt of data, a system operator may manually, or a microprocessor may automatically, initiate the alignment computer process305(e.g., an alignment process carried out on a controller or microprocessor, or computing device such as that shown inFIG. 17) based on the data received.\n\nAn alignment computer (which can be implemented as a separate hardware processor such as a controller or microprocessor, or as a computing device such as that shown inFIG. 17) begins calculating the eventual alignment between proxy values for the actual operating metrics by first computing the range and interval of operating system metrics 1 and 2 in steps306and307. The alignment computer then calculates at step308the subset of matched operating metric settings for which values the underlying system is stable or optimal in achieving the objective function specified in301. Using the range and intervals of the operating metrics 1 and 2 of the underlying system, and the specific joint optima computed in step308, the matched array computer calculates in step309the set of optimal proxy value combinations corresponding to the optimal operating metrics 1 and 2. Working from this set of optimal x and y proxy values, and incorporating the range and intervals reflected in the actual operating data, the alignment computer converts metric 1 and 2 operating data to proxy values 1 and 2 at steps310and311. For purposes of the matched array, this process computes the values along the center diagonal—the alignment vector—and then identifies all related values (optimal or not) along the X and Y axes. The alignment computer calculates proxy values iteratively, checking that the proxy values correspond to the optimal operating values in step312, and stopping when the equivalence between proxy and operating values has been established, indicating that the condition of proxy value equality at x=y corresponds directly to the optimality of the underlying operating system values (“proxy-operating equivalence”).\n\nWhen the alignment computer has established proxy-operating equivalence in step312, all the conditions for specifying the matched array display are established for both the diagonal or reference alignment vector in313R and the general alignment vector in313G:the operating ranges and relevant intervals for metrics 1 and 2 have been identified;the subset of operating ranges and relevant intervals of metrics 1 and 2 values for which the operating system is stable, optimized, or at equilibrium have been identified, thus defining the combinations of values represented along the reference alignment vector in313R, or the general alignment vector in313G;the corresponding set of target proxy values of metrics 1 and 2 have been designated and their equivalence to the desired operating metrics validated;For the reference alignment vector in matched array313R:the common range and interval for the X and Y axes of proxy values 1 and 2 have been specified, delineating a rectilinear matched array;every point at which proxy value x equals proxy value y in313R represents an optimal, equilibrium, or target state of the underlying operating system;the range of values at which x=y designates the center diagonal of the matched array, called a “reference alignment vector;”For the general alignment vector in matched array313G:every point at which specific combinations of proxy value x and proxy value y in matched array313G represent an optimal, equilibrium, or target state of the underlying operating system;the combinations of proxy values of x and y represent a configuration of such target values in the matched array313G called a “general alignment vector,” which in an embodiment may or may not assume any form on the matched array.\n\nThe alignment computer generates a matched array display at block313R, including a matrix of feasible intersection points in the array of X and Y values, and a “reference (diagonal) alignment vector” of all intersection points for which the proxy value of x equals the proxy value of y. Alternatively, the alignment computer can generate a matched array at block313G wherein a matrix of feasible intersection points in the array of X and Y values may also incorporate a “general alignment vector” consisting of any combination of proxy values of x and y for which target or desired system performance is achieved. Hereinafter, the term, “alignment vector,” refers interchangeably to general or reference alignment vector types. Moreover, as illustrated, the “general alignment vector” may not be straight, as the case with a classical vector. Instead, the concepts herein are illustrated with respect to the “general alignment vector” that can represent a target or desired range that may not be straight.\n\nFor any embodiment of the system in which the conditions and optima remain generally the same, this setup process is implemented once and its results will apply to all reasonably similar cases, in much the same way the settings on an instrument gauge are calibrated to reflect the known parameters and limits of the system being measured, then applied to all instruments produced, and used in all reasonably foreseeable operating conditions.\n\nFIG. 4shows an embodiment of the matched array system (e.g., a computing device such as the one depicted inFIG. 17) that generates instructions an operator can follow to reach a desired target state in the underlying operating system (e.g., software executing on a computing device such as the one depicted inFIG. 17). These instructions are not implemented by the system, but represent the “normative” series of prescriptive adjustments a system operator should follow to achieve the target state as it responds to changing metric 1 and metric 2 data received. The matched array system in such an embodiment shows one or multiple steps that move from a current position toward the alignment vector. Because the alignment vector represents proxy-operating equivalence, these steps represent provisional changes that move toward optimization in the underlying operating system.\n\nActual operating metrics data generated by the underlying system401and402are displayed in an embodiment on the meters401aand402a. The alignment computer receives metric data 1 and 2 in blocks403and404in an embodiment and converts them in steps405and406to their respective proxy values. The alignment computer then calculates alignment between proxy values 1 and 2 at step407, generating the matched array. The matched array system then plots the intersection of these values on the matched array at step408. The matched array system then calculates at409the position of the resulting intersection in relation to the alignment vector on the matched array. The distance and direction of the plotted position relative to the alignment vector reflects the state of the system and the effort and direction required to achieve proxy value alignment which signals optimization or equilibrium in the underlying operating system. The matched array system state monitor (e.g., software executing on the same computing device as the matched array system) generates a compilation of system data at410, creating a complete picture of system performance and status for review and interpretation by the system operator.\n\nIn alternate embodiments, the system state monitor410can show system state and performance in the form of a colored light, with different colors indicating the degree of system stability, risk, or other dimensions of performance. A more complex system state indicator on the matched array411can, in various alternate embodiments, generate detailed lists of original metrics, proxy values, implicated stability metrics (e.g., temperature or pressure limits approached or exceeded), recommended rate and direction of change, degrees of adjustment needed, as well as the estimated speed and time to recovery or attainment of optimization in the underlying system. The matched array system continually checks if an optimum is attained at step412by comparing plotted values to the alignment vector values. In an embodiment, the matched array system continues to evaluate the relative values of system variables at steps413and414to determine which is closer to the alignment vector, potentially offering the more efficient path to alignment.\n\nFurther toFIG. 4, and acting on this information, the matched array system generates normative adjustments415and416in values for proxy values 1 and 2. In an embodiment, the matched array system receives the adjusted data415,416and converts the updated proxy values to new actual system metrics417and418. The projected results of making such normative adjustments will be reflected in changes in position relative to the alignment vector409. The system can continue to iterate until projected optimization threshold value is reached at step412, at which time the matched array system will cease proposing adjustments and come to rest at419. In this normative mode, actual changes to the actual underlying operating environment will only have been made as a result of specific actions the system operator executes in response to the matched array system instructions.\n\nContinuing toFIG. 5, note that the series of actions501to518are identical to those at blocks401to418inFIG. 4, encompassing all activities from the initial system metrics, to conversion and rendering on the matched array display, to the determination of proxy value adjustments needed to achieve optimization, and the conversion of these proxy values to updated operating metrics. Whereas the embodiment pictured inFIG. 4stopped with directional instructions to a system operator,FIG. 5illustrates an embodiment of the matched array system that further instructs the actual operating system to make specific underlying system adjustments consistent with approaching, and eventually reaching, the alignment vector on the matched array. Specifically, the matched array system instructs changes to underlying metrics 1 and 2, respectively, at steps519and520in line with the proxy value adjustments indicated in the matched array. In an embodiment as shown inFIG. 5, the instruction is issued but not acted upon until an operator checks the system state indicator displays521and522to view any changes that may have taken place since prior changes or from the initial state, and to review the projected impact of instructed adjustments519and520before they are executed by the matched array system.\n\nFurther toFIG. 5, in an embodiment, the system operator activates one or more switches523and524, releasing the system (Yes, or preventing release, No) to make the system-proposed adjustments. If the switches are shifted to No, then the system takes no action other than to update state indicator display510which also captures any other changes in the system state. Alternatively, in such an embodiment, if the system operator releases the system at523and524, the matched array system executes the instructions519and520, and these directives are implemented in the operating system, working through the metric 1 and metric 2 actuators (or a related mechanism)525and526. These adjustments generate actual system changes that move the system to a new state, causing the system to update metrics data501and502. In this embodiment, the matched array system continues to receive and process actual system data, processes this information relative to proxy values, and iterates closer to the alignment vector as long as this is unimpeded by an operator instruction or internal system rule that interrupts or counters the system operation. The system will continue to process instructions to new positions in the matched array display511, continually tracking plotted positions relative to the alignment vector. In an embodiment, the matched array system will iterate to an optimized state until the alignment vector is reached, meaning proxy value x=proxy value y, causing the switch512to acknowledge optimization, and ending the cycle at system stopping point526.\n\nNext is an application of the matched array system and alignment vector technologies applied to a critical use case of aircraft flight. Experts have argued that most pilots do not understand the relationship between airspeed and angle of attack, as evidenced by the high incidence of “loss of control” flight accidents. Angle of attack (AOA) is the angle between the oncoming air and a reference line along the fuselage or wing of an airplane. On takeoff, the pilot pulls back on the control stick or wheel to lift the nose of the aircraft so angle of attack relative to oncoming wind maximizes lift at a given airspeed. The amount of lift needed for an aircraft to achieve takeoff, to stay in flight, to maneuver, and to land, is directly related to the interaction of AOA and airspeed. While other variables enter consideration (weight which is constantly changing as fuel is consumed, aerodynamic drag, and forces exerted due to maneuvers), the “angle of attack challenge” refers to the criticality of maintaining the proper relationship between the airspeed and AOA to control lift so the aircraft gains altitude, stays aloft, or loses altitude in a controlled fashion (as in landing) as the pilot intends. The correct combinations of airspeed and AOA are essential to safe flight. When the angle of attack is too steep at a given airspeed, there is insufficient lift, resulting in a stall. Alternatively, if the angle of attack is correct, say nose down for landing, but airspeed is insufficient to maintain lift, a stall can also be precipitated causing loss of control. Accordingly, airspeed and AOA are two variables that move in tandem with one another to achieve optimal or equilibrium flight performance. Being able to visualize and adjust both together in a single instrument, as in the matched array system, would potentially avoid many loss of control accidents that occur due to the pilot's excessive focus on one instrument or flight condition (speed or AOA), rather than both together.\n\nFIG. 6is an embodiment of matched array and alignment vector technologies (e.g., implemented on a computing device such as the one depicted inFIG. 17) applied to the combination of airspeed and AOA in a single display, enabling assignment of jointly-optimal values for both variables along the alignment vector. Among the instruments customarily installed in modern aircraft are an airspeed indicator601and an AOA indicator602. The latter is sometimes accompanied by an AOA index meter602i, a simple, color-coded up, down, and on-target indicator to guide the pilot to increase, decrease, or hold angle of attack to prevent a stall at a given airspeed. Airspeed and AOA already represent electronic signals that can be translated into digital inputs using the physical system process described inFIG. 1. An alignment computer603(which can be implemented as a separate hardware processor such as a controller or microprocessor, or as a computing device such as that shown inFIG. 17) implements the alignment computing process outlined inFIG. 3, setting the axes on the matched array, and establishing the alignment vector. The range of possible airspeeds and safe angles of attack are specific to the aircraft and incorporated; they will already have been established by a system designer, and the relevant range of each variable is input to the matched array to generate the aligned values for which takeoff, level flight, and final approach/landing scenarios are identified. Accordingly, the axes on the matched array display604show the proxy values x and y corresponding to the combinations of airspeed and AOA that reflect optimal and safe combinations of airspeed and angle of attack.\n\nContinuing withFIG. 6, an airspeed/angle of attack matched array system604is shown, along with a set of airspeed and AOA plotted positions a, b, and c. These positions are associated with cockpit audio announcement scenarios shown in the surrounding panels605ca,606ca, and607ca. Each scenario represents an actual airspeed-AOA combination shown on individual instruments and represented together by a single proxy value on the matched array. At position ‘a,’ airspeed proxy value is 4 and angle of attack proxy value is 2. Vector605shows a direction and range of needed adjustment that is sufficiently far from the alignment vector that cockpit annunciator605caissues a warning with the instruction to increase angle of attack. In this embodiment, the system emits an audible warning over cockpit audio, “Warning: Too Fast,” indicating too high a speed for the AOA setting, and recommending a steeper angle of attack. At position ‘b,’ airspeed and AOA are aligned and no adjustment is needed, so the cockpit audio system606cadoes not issue any correction. At position ‘c,’ by contrast, the AOA is quite steep, and the airspeed too relatively slow for safe flight. As a result, the matched array system604causes the cockpit audio system to issue a warning at cockpit audio607ca, signaling a “Warning: Nose High” condition and the associated announcement607cato “Increase Speed.”\n\nFurther toFIG. 6, arrows608and609indicate alternative pathways to returning to the alignment vector, by either reducing airspeed at vector608for a given angle of attack (for example, during landing) or decreasing AOA along vector609at a given airspeed (to maintain level flight). Which pathway represents the preferred course of action depends on the specifics of the situation. In either case, returning to the alignment vector on the matched array provides the appropriate normative guidance to the pilot on how to avoid a loss of control or return the aircraft to stable flight.\n\nIn the warning scenarios pursuant to the embodiment described, the priority of direction (to adjust airspeed or AOA) can be predetermined by the value of the metric or according to the specifics of the scenario (e.g., nose down and slowing speed for final approach and landing might prioritize AOA adjustment vs slower speed). This use case follows the normative mode of operation in which instructions are issued and no automated action taken by an associated control system. In an alternate embodiment, the matched array system can operate in positive mode, sending actual instructions to the aircraft flight control system or autopilot to actually make the indicated adjustments to the aircraft flight control surfaces. Existing aircraft autopilot systems perform this function today, automatically calculating airspeed and receiving AOA data (from instruments mounted on one or both sides of the fuselage), and adjusting either metric based on aircraft design features, specific flight characteristics, and the relevant flight conditions. However, autopilots have no corresponding display of the matched characteristics of AOA and airspeed to inform pilots of the conditions the autopilot is responding to, or to enable them to visually monitor the rate of adjustment and confirm that the autopilot is adjusting the metric in the preferred position to maintain flight control.\n\nFIG. 7shows an embodiment of matched array technology applied to representing the alignment of various flight metrics during the flight of an aircraft from takeoff to landing. The context is a flight alignment instrument display700representing the interaction of any two variables relevant to the subject flight, such as airspeed and angle of attack, or altitude and airspeed, etc. Such a use case provides value to the pilot and co-pilot by providing an intelligent visualization for quickly interpreting and assessing whether the combined selected settings for position, altitude, speed, and attitude (in an embodiment, and collectively, the “state”) of the aircraft are within safe or target ranges. This is of special value, for example, during long trans-oceanic flights during which loss of contact with standard navigational beacons due to distance from land, combined with blindness to visual cues due to darkness, require extra diligence and continuous understanding of the aircraft's dynamic state at all times.\n\nThe following are exemplary components, features, and functionality of the flight alignment instrument700pursuant to design principles and engineering capabilities of general matched array technology:a. Alignment computer. The alignment computer700accomputes the target relationships between the selected metrics, generating the matched array and alignment vector corresponding to actual system performance. Upon selection of the metrics to be entered using switches701aand702a, or other input devices, and the system uploads the corresponding computed metrics and relationships. Data from the aircraft's flight navigation system can also be uploaded to the flight alignment system directly.b. Flight metric 1. The aircraft will already be equipped with digital or electromechanical instruments for airspeed701band altitude701c, for example, and the same signal feeds informing these instruments can be used to provide data feeds to the flight alignment instrument. The display screen scale701dcan show the actual scale of the metric or a proxy value such as 1, 2, 3, etc. Further, symbols or lights can be deployed to show progress along the instrument scale consistent with the progress of the flight. If actual metric data is shown the scale will increase and then decrease as it is read from bottom to top, in line with the increase in speed to level flight and decrease to descent and landing. Flight metric 1 data may be input using keyboard703, or other input device, such as a touch screen interface or voice interface.c. Flight metric 2. This axis captures the alternate metric the pilot may wish to coordinate with flight metric 1, and is selected using flight metric selector switch702a. Shown by way of example are options for vertical air speed702band angle of attack702cinstruments, and the digital or electromechanical feeds to these instruments supply data to the flight alignment instrument as well. The metric scale for this axis of the array can also consist of actual or proxy values, or symbols for progress or the passage of time. Flight metric 2 data may be input using keyboard703, or other input device.d. Flight segments. Segments of the flight are selected so as to avoid discontinuities or reversions, resulting in a smooth contour suitable to use in composing the alignment vector. To achieve this, the flight may be divided into five windows704: takeoff, ascent, flight, descent, and landing. Pressing the segment selector button causes the screen to display that segment across the entire screen. In addition,705provides variable magnification for each flight segment, with the degree to magnification controlled by a manual dial1006.e. Alignment vector. The flight alignment system instrument supports unambiguous interpretation of flight management parameters, and part of its utility is the ability to combine actual metrics and user-friendly forms to facilitate safe and intuitive flight. The alignment vector707is the product of both the alignment computer calculations and an intuitively-designed user interface that illustrates the overall contour of the flight (as reflected in the up, level, down stages) using an S-curve design. Alignment computer correlations between the selected flight metrics are mapped to this alignment vector707, and the specific location of the current flight state is identified by an indicator shown as the crosshair marker708. Indicators identify when the aircraft is not on the alignment vector. For example, the airplane-arrow icon709shows the aircraft flying at an angle of attack (relative to the x axis) that is too steep to remain on the alignment path, and identifies the direction in which flight changes can be made such that alignment can be attained. Similarly, airplane-arrow icon710indicates the airspeed is too slow to remain on the alignment vector, and the direction and amount of adjustment are reflected by the position and length of the arrow.\n\nNext,FIG. 8examines a business process case of the matched array technology applied to improving the function of a computerized human capital management (HCM) system. Human Capital Management systems are complex and powerful platforms for bringing together information about employees, ranging from administrative data such as timekeeping, pay and benefits to supporting recruitment, performance management, and workforce and succession planning. In this application, the matched array technology materially improves the HCM's performance management and workforce planning functions. Performance management is the function that helps organizations (i) set enterprise objectives; (ii) cascade those objectives down to business units, teams, and individual employees; and (iii) track individual and collective achievement of objectives. The allocation and cascading of objectives are straightforward activities. However, individual employee performance evaluation is more challenging as it depends on the skill of managers holding sometimes challenging one-on-one conversations with employees. Workforce planning is the function that helps project and strategize around the aggregate, long-term balance of the supply and demand for talent across the organization (e.g., skills, locations, volume, and level of employees).\n\nFIG. 8is a simplified representation of a human capital management system (HCM). HCM system components801,802, and803(e.g., one or more computing devices such as that shown inFIG. 17) manage the engagement and authentication of users and the administration of their transactions, accessing directory data from the user identity directory804. The user interface805enables users to access system functionality embodied in a set of HCM modules contained in core HCM component806and providing functionality such as recruiting and onboarding, compensation and benefits, succession planning and performance management. These modules access, manipulate, and update data in the HCM employee database807. The modules are continually generating updated data from employee information and changes, and the records management system808tracks and updates these continually. Data and integration management system component809continually integrates and manages data across all the components. Most HCM systems also include a partner channel integration component810that connects and integrates applicable third-party systems, for example through an application programming interface, such as xAPI. These third-party partners include, for example, providers of assessment tools, training modules, and employee financial management tools for savings and retirement planning.\n\nA matched array system processor811(which can be implemented as a separate hardware processor such as a controller or microprocessor, or as a computing device such as that shown inFIG. 17) is accessible to users, and connects with the underlying HCM modules for data extracts and updates to support its operations. Note that the partner channel810could be used in an embodiment of the technology to connect an HCM system to an external, partner-provided matched array technology system, enabling connectivity and integration to deliver the same functionality as the internally configured embodiment of the matched array system.\n\nThe performance management function in HCM systems typically addresses measurable employee goals such as sales targets, cost reduction goals, and completed projects that are classified as indicators of “performance.” The more qualitative and behavioral objectives relevant to career advancement (such as leadership, teamwork, culture, and assertiveness) are deemed indicative of “potential.” Performance is seen as more directly under the control of the employee, while potential is subject to the interpretation and control of management (given the larger context of the organization, its dynamics, and the manager's understanding of its leadership needs). Matched array technology will be described as applied to two use cases: the facilitation of individual manager-employee performance evaluation (performance management use case), and business-unit-wide evaluation of overall talent distribution and density (workforce planning use case).\n\nThe business problem in performance evaluation concerns the widely-perceived inadequacy of many frontline managers in providing meaningful, consistent, and actionable performance feedback to their direct reports. Performance in most organizations is measured in terms of the extent to which the employee “meets expectations” of the manager. Industry research notes that managers would be supported greatly by tools that provide more specific performance feedback and more meaningful and actionable advancement coaching. Matched array technology improves HCM system support of these needs by visually identifying the extent of alignment between management and employee expectations on a two-dimensional array, plotting the employee's position, and charting the direction and extent of improvement needed to approach alignment with management expectations. This alignment (meets expectations) condition reflects a performance management state in which manager and employee state are equivalent (that is, the employee is meeting manager expectations). Accordingly, proximity to the alignment vector in an embodiment can effectively communicate the degree of manager-employee alignment, and the direction and extent of change needed to close any gaps.\n\nAn additional value of matched array technology lies in addressing the talent “calibration” challenge. Differences in how individual managers evaluate their employees (e.g., more of less strictly) leads to different ratings for equivalent talent, or different ratings for the same talent when evaluated by different managers. These distinctions raise significant issues impacting compensation recommendations, assignments, and even promotions, based on possibly specious differences in assessments of an employee's capabilities, performance, and potential.\n\nSupporting this use case,FIG. 9portrays an embodiment of the matched array display technology applied to enhancing performance management functionality in an HCM system implementation. A computer monitor901displays output from the matched-array-enhanced HCM system901a(e.g., a computing device such as that shown inFIG. 17), and the matched array display902is shown with its associated alignment vector902avranging along the center diagonal. Distinct X and Y axes are defined specifically through the alignment computer process903similar to that outlined inFIG. 3to reflect matched terms for employee and management expectations, so the resulting alignment vector represents the points at which employee and management performance and potential expectations are aligned. In this embodiment, the correspondence between the values represented by the axes may also be presented as specific corresponding terms. For example, a management expectation of “develop” might be matched with an employee expectation of “advancement.”\n\nInformation for HCM use cases can be gathered in different ways. Performance appraisal evaluations can be used to gather the information needed to inform the plotted positions. Other observations can for the inputs, and the use of surveys, artificial intelligence, or graphing methods can be applied to the scaling of these inputs for use in creating the matched array. Similarly, a survey can be administered specifically to identify the employee position on the matched array using quantitative indicators that enable plotting in graduated increments that have greater precision than simple box placement indicators (e.g., a calibrated survey might show a position as (x=2.4, y=3.5). Managers armed with these statistics, with evidence for their assessments, and with ideas for improvement, can have clearer and more specific conversations about the reasons supporting the present position assessment, and the proposed direction and extent of improvement desired. These discussions can also result in more finely-tuned and mutually-acceptable compromises in performance appraisals that adjust plotted metrics numerically (e.g., x=2.7, y=3.5), an approach that may be preferred to changing a word in an appraisal that has a specific and important meaning in an organization's human capital management practice.\n\nSpecifically, inFIG. 9, two employees are plotted at A and B. Employee-specific identifying and classifying data information for each employee can be accessed in an embodiment by clicking on A or B on the matched array. The matched array (generated and maintained, for example, by a computing device such as that shown inFIG. 17) shows employee A has above-expectation potential (plotted above the expectations alignment vector902av), while A's performance is below expectations (to the left of expectations alignment vector902av). Accordingly, the associated direction and extent of improvement actions lean toward improving performance by moving employee A to the right along improvement path904toward the expectations alignment vector. The relative distance from the alignment vector provides a visual indicator of the degree of improvement needed, based on the axis definitions applied. A manager would review the details and evidence driving the plotted position, and potentially create a playbook905that includes actions appropriate for employee A's improvement. This playbook discussion could include changed behaviors, new assignments, specific commitments, training, and exposure to skill-enhancing experiences. The matched array also enables the addition of reference points such as historical markers showing employee prior plotted positions, or organization averages R based on groups of comparable employees in position for similar lengths of time. Accordingly, the employee's performance and potential can be guided by reference to her past plotted positions as well as in reference to the average of a reference set of employees.\n\nMatched array display902also shows an employee B has above-expectation performance (to the right of the expectations alignment vector902av), but below-expected potential (below the expectations alignment vector902av). A manager would review the details and evidence driving this plotted position, and potentially create a playbook906that includes actions appropriate for employee B's improvement along a path907. Here, guidance will be oriented toward improving aspects of potential, driving toward expectations alignment with vector902av, while maintaining the existing level of performance. The shorter length of the improvement path907in the matched array display also indicates that the improvement in potential required of employee B is relatively modest compared to the extent of performance improvement expected of employee A. However, time and effort required to improve are employee- and path-specific.\n\nMatched array technology and associated alignment vector optimization can use simple direct input of managers about their employees, or other established criteria. The visual presentation provides an enhanced platform for communication with the employee about the specifics of both performance and potential. By defining the alignment vector as the position at which manager and employee expectations are aligned (“meets expectations”)—matched array technology provides a basis for defining expectations clearly, identifying variances to this objective position, and underscoring employee behaviors and measuring results in terms of position relative to the alignment vector. Given that current HCM systems only support and capture narrative descriptions of performance, intelligently visualizing the direction and distance-indicated extent of improvement needed to align expectations marks a significant and tangible enhancement of the technological capabilities of current human capital management systems.\n\nFurther to the performance management use case, an alternate embodiment of the matched array technology can assign specific characteristics to each cell of the matched array matrix902, based on the interpretations inherent in the meaning of the axes. For example, supplementary display panel808shows a display of the status indicators for performance, potential, and risk associated with the employee position (generally indicated by the employee-position distance from the alignment vector802av, and whether it is above, below, or to the right or left). In a given embodiment, this information can be accessed by clicking on the displayed cell, thus revealing the underlying content. In these and similar embodiments, axis definitions, combined with descriptions of each cell can inform the manager and employee of the current status of performance and potential, as well as the nature and extent of change needed.\n\nMatched array technology provides a useful level of generality for assessing performance and potential that makes it applicable to a broad range of employment situations based solely on the axis definitions. And the alignment vector always represents the points at which management and employee expectations are aligned, and the cells will always have definitions that align with how the axes are defined. As a result, and since in all the embodiments, the evaluation of the plotted position is always in reference to the alignment vector, the matched array and the definition of all the content of its cells will be equally applicable in every employee-manager situation in which the axis definitions remain relevant. For example, the definition of “meets expectations” is always interpreted as alignment on the vector902av, and will have different content, but the same implications, for a research scientist as for a financial analyst. The relevant distance and direction for similarly plotted positions will represent the same general degree and direction of improvement needed.\n\nFIG. 10shows an output on a display device1000in a use case for a matched array system1002configured according to an embodiment in which a general alignment vector1002avportrays the flexible representation of target ranges of variable values, and two illustrative employees A and B are depicted in this context. Here, the lower contour of the general alignment vector1002avemphasizes performance more so than potential in the early stage of an employee's job tenure or career, as demonstrated by the rightward curvature along the talent metric 1 axis. Later in job tenure (or career progression) a greater emphasis is placed on potential in the upper portion of the S-curve when the rise (vertical distance) in the curve exceeds the “run” or horizontal travel. For example, in professional services, early stage work consists of more technical and detail-oriented effort, while later-stage work reflects more business-generating (potential-driven) client management, selling, and leading specific client efforts to build business. Further on, at the top of the curve, the S-curve bends to the right—later in the job or career stages of the employee—when expectations might turn more toward writing articles, contributing to practice development, and other endeavors for which leadership and business-building potential are less important, and more tactical contributions are made.\n\nContinuing withFIG. 10, employees A and B are plotted in positions similar to those plotted in the prior drawing, and the implications and insights are the same with the arrows1004and1007showing the direction and extent of change needed to achieve alignment, but now plotted against a general alignment vector1002ay. The playbooks for performance feedback1005and advancement coaching1006, as well as the matched array cell data content1008all have the same meaning as their equivalents inFIG. 9.\n\nFIG. 11illustrates a general alignment vector specified in relation to the reference alignment vector1103avon a display device1101in a use case for matched array1102configured according to an embodiment. The source of data is the HCM system matched array processor1101a. The alignment computer1104can configure any relevant axis definitions, ensuring that the proxy values of Talent Metrics 1 and 2 correspond with fidelity to the underlying operational relationships. The illustrative S-curve-shaped general alignment vector1102avcan be defined, shaped, and specified quite specifically in relation to the diagonal alignment vector1103av, by evaluating measures of deviation and proximity1105in relation to the reference alignment vector1103ay.\n\nFIG. 12shows an embodiment in which matched array technology can be applied to workforce planning in an overall enterprise or organization unit. This is accomplished by compiling individual employee plots (represented by the dots on the display) into a scaled overall display, along with use of the appropriately adjusted axis definitions via alignment computer application (e.g., software executing on a computing device such as that shown inFIG. 17) at903. Once the scaled axes are established and calibrated to the organization being assessed, the scales can be used for a range of organizations, time periods, or other settings (e.g., different functions, such as finance or marketing). Monitor1201displays information from a matched-array-enhanced HCM system1201a. Employees are plotted directly onto a shared matched array display1202, or can be grouped into categories reflecting their relative tenure or contribution. In the embodiment shown, the matched array is composed of three such groupings of employees: entry-level talent in “pipeline array”1204, mature and stable talent in the “pool array”1205, and high-potential leadership or growth talent in the “pyramid array”1206.\n\nDisplaying talent together in a matched array scaled to represent such an aggregation provides an overall portrait of the organization's “talent architecture,” defined as the pattern and alignment of talent in response to workforce policies, processes, and practices. This talent architecture view enabled by matched array technology can show rich and novel detail, such as the current density and distribution of talent, visual perspectives on the adequacy of recruiting efforts in pipeline array1204, and the availability of leadership talent in the pyramid array1206. In the center lies the bulk of the organization's talent at pool array1205, which can be analyzed for turnover, inbound replacements, feeding of talent to advancement opportunities, and overall quality (based on proximity to the alignment vector).\n\nMoreover, talent architecture represented on the matched array can detail the relative dispersion of the talent around the alignment vector providing an indication of relative talent quality and measures of risk. For example, although a stable core of employees would ordinarily populate the pool array, the small group of employees at plotted group1207is falling significantly short of performance expectations and poses a termination risk if their performance cannot be rapidly and substantially improved. By contrast, employees at plotted group1208reflect a group of outstanding performers who pose a retention risk, as management—despite their performance—has not rated them as having sufficient potential for advancement; they may easily be lost to other employers. Finally, over time, the matched array and alignment vector technologies provide a way of tracking and measuring the organization's leadership “yield.” Leadership yield is the rate and volume at which talent traverses from pipeline to pool to pyramid, reflecting the organization's capacity to produce, grow, and retain the leaders it needs to run the organization. None of this information is provided in typical HCM systems.\n\nWhile modem HCM system workforce planning functionality addresses planning for the type and volume of skills the organization will need by role, organization, and location, matched array technology provides a view of the overall architecture dynamics (distribution, density, risks, and yield) of talent that adds richness, clarity, and enhanced diagnostic insight into these dynamics by providing a visual and composite display. Customary, high-technology HCM-based workforce planning cannot begin to approach this level of depth and insight. The most closely-related HCM practice, “organization design,” requires a costly analysis and research effort (studying each employee's evaluation rating) to generate the insights that are immediately accessible through this talent architecture view. Matched array and alignment vector technologies give leaders a better-informed and more easily understood perspective on the entire landscape of talent at a glance, in contrast to pouring over reams of workforce planning data and individual employee performance evaluations.\n\nIn an embodiment, a first set of inputs into the system ofFIG. 12is received from a first client computing device (entered via a user interface of the first client computing device) and a second set of inputs into the system ofFIG. 12is received from a second client computing device (entered via a user interface of the first client computing device).\n\nTurning toFIG. 13, a set of six panels illustrates the static and dynamic metrics used to characterize the features of a talent architecture according to an embodiment.a. Panel1301portrays the matched array, showing its core geometry, including X and Y axes for employee performance and potential, respectively, the alignment vector center diagonal approximating the area around the points at which values of x equal values of y, signaling alignment between management and employee. Along the alignment vector, broad areas are highlighted indicating the three representative stages of progress through a given job: entry stage1303, mastery stage1304, and growth stage1305. Finally, the northwest area1306and southeast area1307of the landscape—the areas furthest from the alignment vector—indicate the areas of highest risk: risk of separation1306due to poor performance, and retention risk of losing talented staff1307to opportunities outside the organization. These elements form the backdrop against which all metrics are defined in subsequent panels;b. Panel1308shows a scatter plot of individual employees populating the matched array, resulting from survey data or other data collection methods. Alignment measures the degree to which the scatter plot is tightly grouped around the diagonal vector1302. Given the direction of talent success toward the northeast quadrant of the matched array, the scatter plot generally has a similar directional tendency. Arrows1309measure the extent to which the employee scatter plot leans above or below the vector, representing the skew of the architecture, its general tendency to favor high-performers (downward skew) or high-potentials (upward skew). Talent plotted approximately along the alignment vector shows a balanced mix of potential and performance, which is ideal for talent growth and for business performance;c. Panel1310shows a well-aligned talent architecture with a significantly greater number of employees with similar profiles than shown in panel1308, indicating a higher density in roughly the same distribution. Triangles located at1311and1312designate areas of “compression,” where movement from entry to mastery, and from mastery to growth may encounter blockage—a condition in which the capacity to supply talent to the next higher progression exceeds the capacity to absorb that talent into the next level. As a result, “bunching” of the scatter plot—compression—can occur;d. Panel1313illustrates talent architecture distribution and balance. Distribution measures the spread1314of the scatter plot along the natural alignment vector path of growth1302. Balance reflects the relative density of employees in each of the stages of entry, mastery, and growth areas of the matched array, which is important to managing the hiring, preparation, flow, and equilibrium of talent as the organization grows;e. Panel1316identifies the relative dispersion of talent away from the alignment vector1302, which is a measure of talent risk. High dispersion generally reflects one or both of two conditions: When dispersion takes the form of scatter plots extending to the upper left of the matched array, this generally represents talent falling short of performance standards, as represented by the relatively long distance above and to the left of the alignment vector, potentially resulting in separation. Alternatively, when dispersion takes the form of scatter plots extending to the lower right of the matched array, this tends to reflect limited opportunities for growth, or poor follow-through in enabling advancement, resulting in retention risks, the potential loss of performing talent to opportunities outside the organization. Dispersion can be measured at various points along the alignment vector, and represented in a statistical formula similar to that used to define, for example, a linear regression fit;f. Panel1320shows an assortment of dynamic metrics that capture talent architecture change over time as employee presence, performance, potential, and growth change over time. Specifically:i. Talent coming into the system are inputs1321(either outside hires or internal transfers in) measured in terms of volume, reflecting recruiting practices, hiring intensity, and (implicitly) the hiring standards, employment value proposition, and specific search criteria applied to finding and attracting;ii. With development and growth over time, the ideal employee trajectory1322shows passage through the entry, mastery, and growth stages of job experience. Ideal in this sense does not necessarily mean directly paralleling the alignment vector1302, although it may. Some organizations seeking to expose talent to different experiences might intentionally drive talent to more intense performance- or potential-emphasizing development while trending in the direction of the alignment vector from entry to mastery to growth. Accordingly, this path is a function of organization experience, preference, and practice, and need not be linear;iii. The timing for a given employee to make the transition from entry to growth is measured throughout, but timing is especially critical at transition point1322from entry to mastery, and transition point1323from mastery to growth. Further, the availability of upward opportunities, the organization's ability to plan for talent growth, and the capacity to prepare capable talent for greater responsibility all contribute to the organization's ability to manage these talent transitions;iv. An employee who has successfully made all the identified transitions will emerge at the end of growth as a leader available for higher-level assignments in the organization at1324which represents advancement beyond the current organizational unit. The progression of talent from input1321, along trajectory1322to emergence at1324is a measure of the leadership yield of the talent architecture, and the number of employees undergoing that progression over a period of time is a measure of the throughput of the talent architecture. Leadership yield results from a combination of factors, including inputs of new talent, talent losses along the way, and successful talent development;v. The chevrons1325represent the number of employees progressing from stage to stage, resulting in the volume of employees in each talent pool (entry, mastery, growth) available to support the needs of the organization. Part of that migration is stochastic, but a portion can also be planned, projected, and managed to achieve a range of organization objectives, such as generating certain leadership yield, or establishing equilibrium in the supply of talent from one stage to the next as at transition points1326and1327, all to match the leadership talent needs of the organization;vi. Finally, the overall talent architecture can be viewed as a dynamic production function taking in, applying, and developing talent for the organization's needs. This generates additional metrics, including the overall flow of talent through the system, including where that flow speeds up or slows down and why, and the velocity of talent movement, reflecting the speed and direction with which talent progresses through the organization. These concepts also enable measurement of concepts such as voluntary and involuntary attrition, as well as process friction in the throughput of talent from entry to mastery, and to growth, helping to characterize the employees' experience along the trajectory1322.\n\nThese static and dynamic metrics enabled by the talent architecture have at least four types of utility not accessible through traditional approaches to organization design, workforce planning, or performance management:a. First, they describe the structure of the talent architecture, providing a richer and more complete vocabulary for description than an organization chart or succession plan, including the performance and potential of the talent in the roles represented (in contrast to the jobs represented by boxes on an organization chart);b. Second, they enable diagnostic insights into the nature, type, and impact of chokepoints, development needs, and structural characteristics of the organization;c. Third, the dynamic attributes of the talent architecture (input, flow, throughput, yield, velocity, and equilibrium) provide a way of evaluating the efficiency and performance of the organization as a system for taking in, deploying, and developing leadership talent. Such an understanding can facilitate adjustment and management action to improve leadership development, increase the volume or speed of talent growth, and implement other talent management changes to achieve specific objectives.d. Finally, tying the dynamic performance of the talent architecture to the existing structural features reflected in the static metrics enables managers to deliberately redesign the talent architecture in ways that can optimize organization performance, and then to manage to that objective through deliberate policies, practices, and actions. For example, addressing selection issues can improve the quality of talent inputs; focusing training provided to employees nearing compression zones between transition stages can accelerate passage through the trajectory; balancing flow from one stage to another can improve talent equilibrium across the pools; raising performance standards can drive closer alignment of talent to the trajectory1322, intentionally elevating potentially overlooked talent in the mastery pool can increase leadership yield of the talent architecture as a whole.\n\nFIG. 14shows four different talent architectures illustrating a sampling of the configurations which may be encountered in practice. Each talent architecture reflects a roughly comparable level of talent quality, as evidenced by the relative proximity of the scatter plot of employees to the alignment vector for all stages of progression (entry, mastery, and growth). The core difference across the four talent architectures is in the location of the central mass of the talent along the alignment vector. Note that each of the architectures can be described in sufficient detail by its static metrics (alignment, density, distribution, balance, dispersion) to support unique identification and feature characterization.\n\nImportantly, the different architectures also profile the underlying talent needs of the organizations they represent:a. Talent architecture1400is an example architecture of a growing public accounting practice with most of its talent centered in accounting staff handling bookkeeping and audits for clients, as represented by the concentration of staff in the middle mass, but with active entry-level activity as well. There is a relatively large ratio of mid-level staff to higher-level personnel, and moderate talent input at the entry stage, reflecting apprentice-type professional development practiced in some mid-size accounting firms;b. Talent architecture1401is representative of a relatively static, mid-size research organization with a preponderance of high potential and high-performance talent at middle and upper levels of a technical hierarchy. Evident density, dispersion, and professional growth challenges the architecture suggests are present should be assessed relative to career path and compensation for highly-educated staff, and the degree to which the work itself is the principal employment value proposition;c. Talent architecture1402is representative of a moderate-growth architectural practice with a preponderance of staff architects and designers in the mastery stage, and a relatively flat hierarchy of leaders who still design and stay close to the work. New employees hired are relatively experienced or specialized in certain skills not generally represented in the central body of the talent; experienced model makers or CAD designers for example. The volume of talent below the alignment vector and populating the lower right area suggests that this firm may also fail to retain high-performing talent, instead accepting that it will not have sufficient growth opportunities for all of them, and consequently will lose a portion to other firms;d. Talent architecture1403illustrates a fast-growing technology company with a significant inflow of developers at the lower end, and bunching in project teams in the middle. The organization is relatively flat (few team members in advanced roles at the upper end of the vector), and growth in the company leans in the direction of high-performance talent with density in and below the mastery zone below the alignment vector, possibly project team leads and specialized technical designers.\n\nIn addition to being descriptive, insights provided by the talent architecture can also shed light on ways to optimize organization performance. In every case, tightening the spread of talent around the alignment vector will bring talent into line on quality and progress. Addressing density issues that also emerge in the context of compression, opportunity, and talent policies (e.g., eliminating minimum time in position standards in favor of performance and potential) can also lead to improved satisfaction, positioning of the right talent for growth, and gaining alignment on progress. Importantly, management policies and actions such as these, are what change the shape and structure of the talent architecture.\n\nFIG. 15illustrates an example the application of talent architecture technology to the diagnosing of organization issues, and the subsequent redesign of talent architectures in response. Specifically, in this example, after a critical diagnostic review resulting in designation of areas for improvement in the oval circles, five specific issues and their resolutions are identified:a. Performance quality issues at1501, are indicated by the proximity of two employees to separation risk area. Following a review and interviews, the resolution is to in fact separate these individuals, resulting in the release of employees with relatively high potential (above the alignment vector), but falling significantly short on expected performance (located relatively far to the left of the alignment vector);b. Leadership growth issues at1502reflect a relative paucity of talent being prepared for growth. To address this, the two employees in1502will be advanced, along with three below them in the architecture who are solidly on the alignment vector;c. The white circle at1503reflects a significant compression concern with high-mastery talent straining for growth opportunities. The compression has been relieved to some extent by the elevation of talent from1502, but the high density in1503suggests further action will be beneficial;d. Issues in1504concern a relatively large number of high-performance employees (to the right of the alignment vector) whose retention is not immediately at risk, but whose growth prospects and commitment should be addressed to forestall retention issue going forward;e. Four employees at1505are immediate retention risks. The plotted position furthest to the right should be addressed as quickly as feasible, responding to specific concerns or potentially tailoring a generic package of development, compensation, and role changes.\n\nThe purpose of the talent architecture technology is to provide an overarching perspective on talent issues and opportunities based on an objective standard represented by the alignment vector and the context of the matched array display. The ability to look at an entire set of employees (e.g., a department, function, region, or business unit) enables insights and action that would ordinarily only be revealed during annual succession planning and leadership reviews, and even then, only on a time-consuming unit-by-unit review which lacks the integrated perspective essential to the development of a coherent overall program of action. From the CEO's perspective, for example, here we see five specific sets of talent issues, and a ready ability to prioritize them, craft initial responses, assign action items to relevant managers, and review progress over time. Taken together, not only does the talent architecture perspective reveal key diagnostic issues, but it shows that the actions taken will result demonstrably in improved alignment, higher quality performance, and the retention of key talent at risk.\n\nContinuing withFIG. 15, the talent architecture redesign1506shows the projected talent architecture following implementation of the actions addressing the five opportunities revealed in the diagnostic. Specifically, talent at risk of separation1501have been removed, leadership growth has been accelerated based on issues identified in1502, compression challenge1503has been relieved, high-performance talent1504has been coached and managed more closely toward the alignment vector, and retention-risk talent1505has been secured. These actions will collectively result in a future state talent architecture with greater proximity to the alignment vector, higher quality performance, and lower risk of talent loss.\n\nBecause talent is ever-changing, new or unresolved issues will continue to present themselves. For example, high potential talent that has not performed to expectations1507is above the alignment vector, demonstrating potential, but falling short of desired performance, perhaps due to needing training. Whatever the nature of the opportunity, the actions taken will be directed to establishing closer proximity to the alignment vector, which is a reliable proxy for the direction of improved overall performance.\n\nWhile the static metrics of the talent architecture are improved by the actions taken, the resulting performance of the organization will express itself in the dynamic measures of performance: input volume; talent throughput over time; leadership yield at the top of the marched array; talent flow volume per unit time; talent velocity (speed and direction across the array); and equilibrium supply of entry, mastery, and growth talent to meet the needs of the organization.\n\nAn additional capability indicated by the observations inFIGS. 14 and 15is that of benchmarking against organizations with normative or best practice architectures for their class of operations. InFIG. 14, talent architecture1400is a model after which the organization inFIG. 15might model itself at a high level, given the relatively central talent mass. Again, tighter proximity to the alignment vector is the normative goal, and specific actions to redesign the architecture to tighten that distribution will result in improved alignment and disposition of talent and correspondingly improved operating results.\n\nFIG. 16illustrates the steps involved in an embodiment of an automated system for generating a talent architecture improvement program. Talent architecture diagnostic1600identifies multiple areas of improvement; specifically, potential separation issues for two employees1601, the need for growth talent1602, compression concerns at the transition1603from mastery to growth, a significant high-performer recognition issue1604, as well as potential retention risks at1605.\n\nThese talent conditions impact real employees, and can only be addressed by taking specific talent management actions. The talent architecture enables specific diagnosis and prioritization, and shows what the modified talent architecture will look like once the proposed actions are taken. In an embodiment, the automated talent architecture modification system inFIG. 16generates improvement actions relevant to the organization unit in1600by applying the following steps:a. The process begins with the selection of a program priority focus1606to guide the process in the direction preferred by management. Options for priority focus are outlined in the selector1607, including an option to pursue all factors automatically.b. The talent architecture system then captures1608the coordinates x and y of each plotted employee position, storing the performance and potential ratings of the employee. Further, the system computes the orthogonal distance (horizontal and vertical gap) between the employee plotted position and the alignment vector AV, storing this information in a register1609, and using all the collected information to generate a narrative description1610of the employee's performance, potential, and risk. The geometry of the alignment matrix and the direction and distance from the alignment vector define a finite range of performance and potential combinations, enabling a narrative to be generated for each combination beforehand and applied to a given case based on coordinates and position in relation to the alignment vector.c. The same combinations of performance, potential, and risk drawn from a repository of improvement actions1611accessed and compiled by the system. All of these remedies will require scrutiny and refinement by the employee's manager.d. The system has enough information about planned actions and intended effects to project a proforma modified talent architecture1612. This provides an opportunity to approve or revise actions, timing, or direction to achieve the desired talent architecture.e. The talent architecture system groups employees1613according to their reporting manager for follow through action and tracking.f. The system data underlying the talent architecture is similar to a relational database1614, consolidating all employee issues and actions into an overall talent management program1615for assessment and tracking by senior leaders.g. The system then generates a projected talent architecture modification1616representing the impact of all successfully completed talent actions.h. Next, the talent architecture system generates scheduling cadence options1617for tracking manager progress against key employee actions. This architecture can be generated on an interim basis to track progress toward the fully-completed end state.i. Finally, the system operator can select additional issues or priorities to focus on1618, cycling back to the start1606, iterating potentially through complete delineation of all talent issues and their corresponding impact on the redesigned talent architecture.\n\nOne use of the talent architecture modification system will be to reverse engineer discovery of the talent actions to take. Specifically, this is accomplished by reviewing the diagnostic insights from measuring alignment, distribution, balance, density, and dispersion in the initial talent architecture, and then moving the graphic representation of employee plotted positions to desired positions. The system would then decompose the horizontal (performance) and vertical (potential) distances between initial and new employee plotted positions, and use the direction and extent of change required to pull from the inventory of management actions those that are relevant to delivering the desired changes registered between initial and desired employee positions. These actions become the system-determined employee improvement actions.\n\nTurning toFIG. 17, a computing device on which the techniques described herein may be carried out is shown. The computing device, generally labelled1700includes logic circuitry1702(e.g., one or more microprocessors, microcontrollers, application-specific integrated circuits, or field-programmable gate arrays), a primary memory1704(e.g., volatile memory, random-access memory), a secondary memory1706(e.g., non-volatile computer-readable media), user input devices1708(e.g., a keyboard, mouse, or touchscreen), a display1710(e.g., an organic, light-emitting diode display), and a network interface1712(which may be wired or wireless). The memories1704and1706store instructions and data. The logic circuitry1702executes the instructions and uses the data to carry out various procedures including, in some embodiments, the methods described herein.\n\nIt should be understood that the embodiments described herein should be considered in a descriptive sense only and not for purposes of limitation. Descriptions of features or aspects within each embodiment should typically be considered as available for other similar features or aspects in other embodiments. It will be understood by those of ordinary skill in the art that various changes in form and details may be made therein without departing from their spirit and scope.\n\n",
            "length": 77568
        }
    ]
}