{
    "table_name": "patent_201908",
    "table_fullname": "patents-public-data.patentsview.patent_201908",
    "column_names": [
        "id",
        "type",
        "number",
        "country",
        "date",
        "abstract",
        "title",
        "kind",
        "num_claims",
        "filename",
        "withdrawn"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "id",
        "type",
        "number",
        "country",
        "date",
        "abstract",
        "title",
        "kind",
        "num_claims",
        "filename",
        "withdrawn"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "id": "3930747",
            "type": "utility",
            "number": "3930747",
            "country": "US",
            "date": "1976-01-06",
            "abstract": " This invention relates to a turbine housing which includes at least two separate passageways for receiving a flow of fluid and carrying same to a volute section for introduction to a turbine wheel, a first of said passageways being arranged to surround at least 160.degree. of a second of said passageways at the termination of said second passageway, the termination of said second passageway being at or upstream of the start of the volute section of the housing. The invention also includes a turbine and a turbocharger including the housing of the invention and an internal combustion engine in combination with such a turbocharger, and further includes the turbine housing of the invention in combination with an exhaust system in which exhaust ducts merge together at least one duct surrounding at least 160.degree. of another duct at the point of juncture. ",
            "title": "Turbine housing",
            "kind": "A",
            "num_claims": "30",
            "filename": "pftaps19760106_wk01.zip",
            "withdrawn": "0"
        },
        {
            "id": "3930347",
            "type": "utility",
            "number": "3930347",
            "country": "US",
            "date": "1976-01-06",
            "abstract": " A plurality of structural unit bodies are utilized to construct a structure by suitably assembling the unit bodies. Each structural unit body comprises an outer flange and an inner flange extending from one end edge and the other end edge respectively of a box-shaped frame. A stuffed box is secured to the surface of the inner flange and the stuffed box is in the form of a flat box made of a dampproof material. The stuffed box is covered on the outside with a metal net-like material and has disposed therein a pipe capable of passing fluid therethrough. The box is stuffed with noncombustible materials. The upper portion of the middle section of the frame, the inside flange surface and the entire surface of the stuffed box is plastered or covered with mortar whereby there is formed a circumferential groove between the outer flange and the underside of the mortar. ",
            "title": "Structural unit body having a pipe incorporated therein",
            "kind": "A",
            "num_claims": "7",
            "filename": "pftaps19760106_wk01.zip",
            "withdrawn": "0"
        },
        {
            "id": "3931252",
            "type": "utility",
            "number": "3931252",
            "country": "US",
            "date": "1976-01-06",
            "abstract": " Process for the manufacture of pure 1-nitroanthraquinone, characterised in that a nitroanthraquinone mixture obtained by nitration of anthraquinone in the presence of inorganic acids and, optionally, lowering the molar fraction of the acids in the reaction mixture after isolation of the reaction products which have precipitated and, optionally, further measures, is subjected to a rectification. ",
            "title": "Process for the preparation of pure 1-nitroanthraquinone",
            "kind": "A",
            "num_claims": "10",
            "filename": "pftaps19760106_wk01.zip",
            "withdrawn": "0"
        },
        {
            "id": "3930826",
            "type": "utility",
            "number": "3930826",
            "country": "US",
            "date": "1976-01-06",
            "abstract": " Flat glass is produced by advancing a layer of molten glass along the surface of molten metal while cooling it sufficiently to form a continuous sheet of glass which is lifted upwardly from the surface of a supporting pool of molten metal and conveyed from it for further processing. The molten metal substantially immediately beneath the location at which the glass is lifted upwardly from the pool of molten metal is cooled to a temperature below that of a surrounding molten metal in order to provide for the free release of the formed sheet of glass from the molten metal and to provide for the production of an extremely flat sheet of glass. ",
            "title": "Conditioning flat glass for removal from supporting liquid following forming",
            "kind": "A",
            "num_claims": "3",
            "filename": "pftaps19760106_wk01.zip",
            "withdrawn": "0"
        },
        {
            "id": "3931301",
            "type": "utility",
            "number": "3931301",
            "country": "US",
            "date": "1976-01-06",
            "abstract": " The present invention relates to pharmacologically valuable new benzophenone derivatives having a pronounced sedative action on the central nervous system and some of which also possess muscle-relaxing and aggression-inhibiting properties. These new derivatives have the structural formula ##SPC1## And their acid addition salts, in which PA1 R.sub.1 and R.sub.2 are substituents selected from the group consisting of hydrogen, saturated and unsaturated alkyl groups having 1-4 carbon atoms; PA1 R.sub.3 is a substituent selected from the group consisting of --Cn, --CONH.sub.2, --COOCH.sub.3, --COOC.sub.2 H.sub.5, --COOH, and --COOMe, where Me is a metallic cation; n is an integer selected from 1 and 2; and m is an integer selected from 1,2, and 3, and wherein the rings A and B may be substituted, ring A being substituted preferably with a halogen such as chlorine or with nitro, trifluoromethyl, methyl, methoxy or methylmercapto, preferably in the 5 position, and ring B being preferably substituted in the 2' position with chlorine or fluorine. The radicals R.sub.1 and R.sub.2 preferably signify hydrogen or a methyl group, or a n-butyl group in the case of Ring B. ",
            "title": "Benzophenone derivatives and process for their preparation III",
            "kind": "A",
            "num_claims": "3",
            "filename": "pftaps19760106_wk01.zip",
            "withdrawn": "0"
        }
    ]
}