{
    "table_name": "patent",
    "table_fullname": "patents-public-data.patentsview.patent",
    "column_names": [
        "id",
        "type",
        "number",
        "country",
        "date",
        "abstract",
        "title",
        "kind",
        "num_claims",
        "filename",
        "withdrawn"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "INT64"
    ],
    "nested_column_names": [
        "id",
        "type",
        "number",
        "country",
        "date",
        "abstract",
        "title",
        "kind",
        "num_claims",
        "filename",
        "withdrawn"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "INT64"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "id": "10326139",
            "type": "utility",
            "number": "10326139",
            "country": "US",
            "date": "2019-06-18",
            "abstract": "An electrochemical cell includes an anode configured to produce multivalent cations during a discharge process, and a cathode comprising a catechol-bearing melanin. The cathode is configured to reversibly oxidize a catechol of the catechol-bearing melanin into a quinone by an extraction of the multivalent cation during a recharge process and reduce the quinone to the catechol by an insertion of the multivalent cation during the discharge process. The electrochemical cell includes an aqueous electrolyte solution in which the anode and the cathode are disposed, wherein the aqueous electrolyte solution is configured to transport the multivalent cations between the anode and the cathode.",
            "title": "Electrochemical cell with melanin electrode",
            "kind": "B2",
            "num_claims": 20,
            "filename": "ipg190618.xml",
            "withdrawn": 0
        },
        {
            "id": "10326289",
            "type": "utility",
            "number": "10326289",
            "country": "US",
            "date": "2019-06-18",
            "abstract": "A rechargeable handheld electrically operated smoking device is provided, including a rechargeable power source; a first charging contact connected to the power source by a MOSFET voltage-controlled switch having a source, drain, and gate terminals; an operational amplifier including a non-inverting input connected to the source terminal, an inverting input connected to the drain terminal, and an output connected to the gate terminal; and a second charging contact connected to the power source, the switch being configured to prevent current flow between the first charging contact and the power source through the switch when a voltage difference therebetween is lower than a first threshold voltage, the device being configured to amplify a voltage difference between the source and drain terminals and apply it to the gate terminal, closed loop feedback is applied to the inverting input, and a biasing resistor is connected between the inverting input and electrical ground.",
            "title": "Rechargeable device with short circuit prevention",
            "kind": "B2",
            "num_claims": 7,
            "filename": "ipg190618.xml",
            "withdrawn": 0
        },
        {
            "id": "10326369",
            "type": "utility",
            "number": "10326369",
            "country": "US",
            "date": "2019-06-18",
            "abstract": "A converter includes first and second coupled inductors. A first phase includes first high side and low side switches connected to the first inductor. A second phase includes second high side and low side switches connected to the second inductor. In discontinuous conduction mode, the controller determines, in response to the first high side switch being turned on and the second low side switch being turned off, that coupling between the first and second inductors is strong or weak based on whether body diode of the second low side switch will conduct if not prevented from conducting. The controller prevents second low side switch body diode conduction in response to the first high side switch being turned on when the coupling is strong, and does not prevent second low side switch body diode conduction in response to the first high side switch being turned on when the coupling is weak.",
            "title": "Method and apparatus for multi-phase DC-DC converters using coupled inductors in discontinuous conduction mode",
            "kind": "B2",
            "num_claims": 5,
            "filename": "ipg190618.xml",
            "withdrawn": 0
        },
        {
            "id": "10327869",
            "type": "utility",
            "number": "10327869",
            "country": "US",
            "date": "2019-06-25",
            "abstract": "An attachment member for mating with a dental implant includes a non-rotational structure and a body. The non-rotational structure is configured to mate with a corresponding non-rotational feature of the dental implant. The body extends from the non-rotational structure. The body has (i) an exterior side surface configured to at least partially engage gingival tissue adjacent to the dental implant, (ii) an exterior top surface that is exposed through the gingival tissue, (iii) a screw access bore for receiving a screw that attaches the attachment member to the dental implant in a removable fashion, and (iv) a set of radiopaque information markers that is located internal to the exterior side surface and the exterior top surface. The set of radiopaque information markers indicates information regarding the dental implant that is revealed in response to a scan from a computerized tomography (CT) scanner.",
            "title": "Attachment members with internally located radiopaque information markers for CT scan",
            "kind": "B2",
            "num_claims": 13,
            "filename": "ipg190625.xml",
            "withdrawn": 0
        },
        {
            "id": "10328964",
            "type": "utility",
            "number": "10328964",
            "country": "US",
            "date": "2019-06-25",
            "abstract": "The double stroller is a stroller that is configured for use with a plurality of children. The double stroller comprises an anterior seat and a posterior seat. The occupant of the anterior seat faces the anterior direction of the stroller. The occupant of the posterior seat faces the posterior direction of the stroller. The double stroller comprises a seating assembly, a frame, and a storage bin. The seating assembly forms the anterior seat and the posterior seat. The frame supports the seating assembly above the supporting surface upon which the double stroller is placed. The storage bin is a space dedicated to the storage of miscellaneous items.",
            "title": "Double stroller",
            "kind": "B1",
            "num_claims": 19,
            "filename": "ipg190625.xml",
            "withdrawn": 0
        }
    ]
}