{
    "table_name": "PATENTSVIEW.DETAIL_DESC_TEXT_2021",
    "table_fullname": "PATENTSVIEW.PATENTSVIEW.DETAIL_DESC_TEXT_2021",
    "column_names": [
        "text",
        "patent_id",
        "length"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "NUMBER"
    ],
    "description": [
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "patent_id": "10936286",
            "text": "DETAILED DESCRIPTION\n\nPersons of ordinary skill in the art will realize that the following description is illustrative only and not in any way limiting. Other aspects will readily suggest themselves to such skilled persons.\n\nThe present invention improves the efficiency of existing LUT-based FPGA logic cells at implementing up, down and pop counters. When implementing each of these functions, some of the K-input LUTs in some of the logic cells remain available to generate any function of the K inputs to those LUTs.\n\nIn accordance with one aspect of the present invention, an illustrative LUT-based logic cell120that allows improved efficiency for up counters and pop counters is shown inFIG. 4, to which attention is now drawn. Some of the elements of logic cell120ofFIG. 4are common to the logic cells shown in previous drawing figures and will be referred to inFIG. 4using the same reference numerals used to designate those same elements in the previous drawing figures.\n\nThe logic cell120ofFIG. 4includes a K-input LUT shown within dashed lines122formed from a first (K-1)-input LUT124aand a second (K-1)-input LUT124b. The small squares126and128represent the configuration inputs used to define the functions of LUTs124aand124brespectively. Both LUTs124aand124bshare in common the K-1function inputs (In2, In3, . . . InKshown at reference numerals130,132, and134, respectively). A first (2-input) multiplexer136has a first data input coupled to the output F0of the first (K-1)-input LUT124a, a second data input coupled to the output F1of the second (K-1)-input LUT124b, and a select input coupled to a function input In1at reference numeral138of the K-input LUT122. The data output of the first multiplexer136serves as the output of the K-input LUT122and is directly connected to the primary output (Y) of the logic cell the main output of the logic cell120shown at reference numeral48. In one particular instance of the present invention, K=4.\n\nThe logic cell120ofFIG. 4also includes a carry-in input CI42, a counter input QI140, a carry-out output CO44, and a sum output S50. A carry circuit142in the logic cell ofFIG. 4includes a second multiplexer shown inFIG. 4as a 4-input multiplexer32having a first data input coupled to the F0output of the first 3-input LUT124a, a second data input coupled to the F1output of the second 3-input LUT124b, a third data input coupled to a logic-high constant voltage, a fourth data input coupled to a logic-low constant voltage, select inputs shown as small square34coupled to configuration circuitry for the multiplexer32used to choose which one of the inputs of the second carry multiplexer32will be passed to its data output, and a data output denoted G. A third multiplexer is shown inFIG. 4as a 4-input multiplexer36in the carry circuit142of the logic cell ofFIG. 4has a first data input coupled to the counter input QI140of the logic cell120, a second data input coupled to the output of the K-input LUT122at the first multiplexer136, a third data input coupled to a logic-high constant voltage, a fourth data input coupled to a logic-low constant voltage, select inputs shown as a small square38coupled to configuration circuitry for the third multiplexer36used to choose which one of the inputs of the third multiplexer36will be passed to its data output, and a data output denoted P. A carry-out multiplexer shown inFIG. 4as a 2-input multiplexer40in the carry circuit142of the logic cell110ofFIG. 4has a first data input coupled to the data output G of the second multiplexer32, a second data input coupled to the carry-in input CI42of the logic cell120, a select input coupled to the P data output of the third multiplexer36, and a data output coupled to the carry-out output CO44of the logic cell120. An exclusive-OR gate46in the carry circuit142of the logic cell120ofFIG. 4has a first input coupled to the carry-in input CI42of the logic cell120, a second input coupled to the data output P of the third multiplexer36, and an output coupled to the sum output S50of the logic cell120.\n\nIn some implementations of the invention, either of the F0or F1inputs from LUTs124aand124b, or the logic-high constant voltage input can be omitted from the second multiplexer32, and/or the logic-high constant voltage input can be omitted from the third multiplexer36.\n\nThe structural differences between the logic cell120according to the aspect of the invention illustrated inFIG. 4and the prior-art logic cell inFIG. 1are the use of the second 4-input multiplexer36to drive the exclusive-OR gate46that generates the sum output S50, and the addition of a QI counter input140to the logic cell120as shown inFIG. 4.\n\nBroadly, the logic cell120ofFIG. 4has K function inputs, a QI input and a carry input. The particular example shown inFIG. 4includes K function inputs In1138, In2130, IN3132, through InK134. To implement logic cells having larger values of K, additional function inputs can be added, each driving both of LUTs124aand124b. The primary output Y48of the logic cell120presents a value that is any function of the K function inputs. A second output (the carry output CO44) presents a value present on the carry input CI42or an output sourced by the second multiplexer32as selected by the output of the third multiplexer36. The inputs In1, In2, In3, . . . InK, and outputs S and Y are connected to the programmable routing network. The QI input can be driven by the flip-flop associated with the logic cell, as described above in relation toFIG. 2, but need not be driven by the programmable routing network. The carry output CO of one cell directly drives the carry input CI of the next cell in the carry chain, and neither CI nor CO need to be connected to the programmable routing network.\n\nFIG. 5is a block diagram that shows how the logic cell120ofFIG. 4can be used to implement an up counter.FIG. 5shows an N-bit up counter160formed from (N-1) logic cells120-0,120-1, and120-(N-1). As shown inFIG. 5, the second multiplexer32inFIG. 4is set so its output G is the value logic 0, and multiplexer36is set so its output P is the value at input QI140of the logic cell120ofFIG. 4. The carry-in CI input42of the logic cell120representing the lowest significant bit is set to logic 1, and the carry-in input CI42of each of the successive more significant bits is connected to the carry-out output CO44of the adjacent less significant bit logic cell120. Data flip-flops162-0through162-(N-1) each have their data inputs connected to the S output (138inFIG. 4) of the logic cell110included in their respective counter stage. The Q outputs of the flip-flops162-0through162-(N-1) are each connected to the QI input (140inFIG. 4) of the logic cell included in their respective counter stage.\n\nAs shown inFIG. 5, none of the LUT inputs (shown for convenience as In1, In2, In3, . . . InKin an instance of the invention employing K-input LUTs122), nor the Y output, of all of the logic cells (120-0,120-1, and120-(N-1) are utilized in performing the counter function and so each cell can be used to generate any function of the K inputs (In1, In2, In3, . . . InKinFIG. 5) simultaneously with the operation of the up-counter function. This is not possible using any of the prior-art logic cells.\n\nReferring now toFIG. 6, a block diagram shows a variation of the logic cell ofFIG. 4. The logic cell170ofFIG. 6includes many of the same elements present in the logic cell120ofFIG. 4. These elements common to both drawing figures will be referenced using the same reference numerals employed inFIG. 4. The elements common in the logic cell170that are common to the logic cell120are connected as described with reference toFIG. 4.\n\nThe difference between the logic cell170ofFIG. 6and the logic cell120ofFIG. 4is that the logic cell170ofFIG. 6further includes a fourth multiplexer172having a first data input and a second data input. The second data input is an inverting data input. The first and second data inputs are coupled together to the counter input QI140of the logic cell170, and a select input is coupled to configuration circuitry for the logic cell represented by small square174. The output of the fourth multiplexer172is coupled to the first data input of the third multiplexer36.\n\nThe fourth multiplexer172selectively inverts the value present at the QI input134as configured by configuration bit174. The logic cell170ofFIG. 6thus employs the fourth multiplexer172as a programmable inverter to support both an up counter and a down counter function by setting the configuration bit at reference numeral174to pass either the non-inverted or the inverted QI input at reference numeral140. As was the case with the logic cell ofFIG. 4, in some implementations of the invention, either of the F0or F1inputs from the LUTS124aand124b, or the logic-high constant voltage input can be omitted from the second multiplexer32, and/or the logic-high constant voltage input can be omitted from the third multiplexer36.\n\nFIG. 7is a block diagram showing the logic cell ofFIG. 6used to implement a down counter.FIG. 7shows an N-bit counter180that uses (N-1) logic cells. The carry-in CI input of the lowest significant bit is set to logic 0 (instead of to logic 1 in the counter depicted inFIG. 5). As shown inFIG. 7, the output of the second multiplexer32inFIG. 6is set to pass the value logic 1, and the output P of the third multiplexer36is set to pass the value at input QI140of the logic cell170ofFIG. 6inverted by the fourth multiplexer172. As also shown inFIG. 7, all of the LUT inputs of all of the logic cells (0,1, and N-1) can be used to generate any function of the K inputs simultaneously with the operation of the up or down counter function.\n\nOne of the attractive features of the present invention is that, when implementing both up and down counters, as shown respectively inFIG. 5andFIG. 7, the entire K-input LUT portion112of each logic cell120and170that is used remains available to generate any function of all of the LUT inputs. This is not possible using prior-art logic cells and is a significant advantage of the logic cell of the present invention in that user designs can be implemented using fewer logic cells than in the prior art.\n\nFurther demonstration of the versatility of the logic cells120and170ofFIG. 4andFIG. 6is shown inFIG. 8, a block diagram that shows how logic cells like those ofFIG. 4can be used to implement an accumulator.FIG. 8depicts an accumulator having an L-bit input and an N-bit output. The N-bit accumulator190employs N logic cells shown as120-0through120-N connected as shown. The CI input of the logic cell120-0is connected to a constant logic low “0” level. The CO output of each logic cell is connected to the CI input of the next logic cell in the accumulator.\n\nEach logic cell120-0through120-(N-1) is associated with a data flip-flop192-0through192-(N-1) respectively. The S output of each logic cell is coupled to the D input of its associated data flip-flip. The Q output of each data flip-flop192-L through192-(N-1) is coupled to the QI input of its associated logic cell.\n\nThe In1inputs of logic cells120-0through120-(L-1) are coupled to the Q outputs of their associated data flip-flops. The In2inputs of logic cells120-0through120-(L-1) are coupled to the individual bits of the L-bit input to the accumulator190. The table inFIG. 8shows the configuration of each of the logic cells in the accumulator.\n\nWhen implementing accumulators, the entire LUT portion of a logic cell implementing one of the more significant bits of the accumulator190remain fully available for other purposes as shown inFIG. 8. As may be seen from an examination ofFIG. 8, the LUT functions of logic cells120-L through120-(N-1) remain available for use simultaneously with the operation of the accumulator190. While the above has been described in relation to logic cells120, one skilled in the art will recognize that this is equally applicable to logic cells170.\n\nAnother example of the versatility of the logic cells120and170ofFIG. 4orFIG. 6is shown inFIG. 9A. The logic cells of the present invention have the ability, by setting P=0, to transmit the value of the CI input to the S output and on to the programmable routing network while leaving the LUT available to implement in parallel any independent function of K inputs. In contrast with the prior-art cell ofFIG. 3A, no additional, expensive connection between CI or CO and the programmable routing network is required. This ability can, for example, allow a more efficient implementation of compressors. Implementing a 3:2 compressor with the prior-art logic cell ofFIG. 1would fully consume two cells.FIG. 9Ashows how a 3:2 compressor can be implemented with the logic cells120or170using only portions of two logic cells. Persons of ordinary skill in the art will appreciate that logic cell120-1ofFIG. 9Astill has its In1, In2, In3, and In4inputs and Y and CO outputs available, and enough of its internal logic available, that it can also serve as the first logic cell of an additional 3:2 compressor, or as an independent K-input function. In this way, M compressors can be implemented in M+1 logic cells, versus 2M using the prior art cell ofFIG. 1. The incremental cost of a 3:2 compressor is thus only one logic cell. Further details of this implementation are shown inFIG. 9Bparticularly illustrating an implementation with logic cell120, it being understood that a similar implementation may be performed utilizing logic cell170.\n\nYet another example of the versatility of the logic cells120and170ofFIG. 4orFIG. 6is shown inFIGS. 10A and 10B.FIG. 10Ais a block diagram of a 4:2 compressor210formed from two full adders212as shown.FIG. 10Adefines the function of a 4:2 compressor in terms of the well-known full-adder cell212. The compressor210is fed from inputs arbitrarily designated as inputs T, U, V, W, and X. The input T would be driven by the output N of a previous compressor in a chain.FIG. 10Bis a block diagram illustrating how only two logic cells120-0and120-1are required to implement the 4:2 compressor210ofFIG. 10Aand includes a table showing the configuration of logic cells120-0and120-1to implement this function. The top full adder212ofFIG. 10Ais implemented in Logic Cell1ofFIG. 10B. The lower full adder212is implemented in Logic Cell0, including generation of the signal M which then passes through Logic Cell1from the CI input to the S output. As shown inFIG. 10B, a 4:2 compressor can be implemented using two of the logic cells120of the present invention while it would take at least three of the prior-art logic cells shown inFIG. 1to implement this function. While the above has been described in relation to logic cells120, one skilled in the art will recognize that this is equally applicable to logic cells170.\n\nReferring now toFIG. 11, a block diagram shows a two-input, N-bit adder220implemented in accordance with an aspect of the present invention using logic cells120ofFIG. 4. The N-bit adder220employs N+1 logic cells shown as120-0through110-N connected as shown. The CI input of the logic cell120-0is connected to a constant logic low “0” level. The CO output of each logic cell120is connected to the CI input of the next logic cell120in the adder220.\n\nThe In1and In2inputs of logic cells120-0through120-(N-1) are coupled to the N operand inputs U[0] through U[N-1] and V[0] through V[N-1], respectively, for the adder220. The S outputs of each logic cell120-0through120-N form the sum outputs for each of the N+1 output bits of the adder. The table inFIG. 11shows the configuration of each of the logic cells120in the adder220. The logic cell120-N need only pass its carry-in (CI) input to its sum (S) output and on to the programmable routing network. Advantageously, this leaves its LUT available to implement in parallel any unrelated function of K inputs. While the above has been described in relation to logic cells120, one skilled in the art will recognize that this is equally applicable to logic cells170.\n\nWhile aspects and applications of this invention have been shown and described, it would be apparent to those skilled in the art that many more modifications than mentioned above are possible without departing from the inventive concepts herein. For instance, the abilities shown inFIGS. 9A, 9B and 10Bdepend only on the aspect of the invention that P rather than Y is used to drive the exclusive-OR gate, and so could be realized in an alternate embodiment that does not include the addition of the QI input shown inFIG. 4. The invention, therefore, is not to be restricted except in the spirit of the appended claims.\n\n",
            "length": 16627
        },
        {
            "patent_id": "10941081",
            "text": "DETAILED DESCRIPTION\n\nIn a cohesive granular material according to the present invention, the granules are made of stiff substance and have a grain size in the range from 55 μm to 2.0 mm. This range of grain sizes corresponds to the definition of sand. However, the granules are not restricted to sand, neither with regard to the substance of the granules, i.e. their chemical composition, nor with regard to the shape of the granules.\n\nThe elastomeric substance of the cohesive granular material according to the present invention is elastic and its young's modulus is not more than 0.5 times the Young's modulus of the stiff substance. Typically, the difference in Young's modulus is much higher. The elastomeric substance elastically connects the granules, particularly with regard to a tensile or a shear load but also with regard to a pressure load on the cohesive granular material. Already with regard to a shear load and particularly with regard to a pressure load on the cohesive granular material, the physical properties also strongly depend on the properties of the stiff substance. With regard to a pressure load, the granules of the stiff material abutting against each other provide for a high stability of the cohesive granular material. With regard to tensile and shear loads, the elastomeric substance protects against failure for deformations of the cohesive granular material. Further, by means of modifying the Young's modulus of the elastomeric substance, the deformability's of the cohesive granular material under tensile and shear loads and even under pressure loads can be varied over a wide range.\n\nThe voids between the granules of the cohesive granular material according to the invention are interconnected and provide for a fluid permeability of the cohesive granular material. Additionally, the connected voids have an influence on the mechanical properties of the cohesive granular material. Connected voids in the cohesive granular material mean that the granules are only locally connected by bridges. This may be described as local connections between neighboring granules via elastomeric bands and clearly differs from the granules being embedded in a matrix of the elastomeric substance.\n\nAlthough the voids between the granules of the cohesive granular material according to the present invention do not only provide for a fluid permeability, this fluid permeability may be of particular interest. The fluid permeability can be tuned by the grain size of the granules and the relative amount of the elastomeric substance to, for example, provide filters and membranes of a defined pore size and porosity.\n\nIn the cohesive granular material according to the invention, the granules of the stiff material may all have the same grain size. This particularly means that the granules typically do not comprise a big grain size and a small grain size, the granules of the small grain size fitting in and filling the free spaces left between the granules of the big grain size abutting against each other. Instead, these free spaces are left as a basis for the voids of the cohesive granular material according to the present invention. Typically, these free spaces are only filled by the elastomeric substance connecting the granules to a small extent.\n\nFurther, in the cohesive granular material according to the present invention, essentially all of the granules have the same shape. This, for example, means that there are no two different shapes of granules, wherein the granules of the one shapes fill free spaces left between the granules of the other shape.\n\nFor example, the granules may be spherical, cubic, tetrahedral, pyramidal, multiangular or sand-shaped. The shape of the granules has an influence on the physical properties of the cohesive granular material, particularly with regard to a shear load on the cohesive granular material.\n\nThe arrangement of the granules in the cohesive granular material corresponds to a bulk of the granules. I.e., typically, they are not densely packed. Thus, even non-spherical granules only make up 55% to 65% of the volume of the cohesive granular material according to the invention, leaving 45 to 35% free space between the granules which is only partially filled by the elastomeric substance.\n\nIn the cohesive granular material according to the invention, the stiff substance of which the granules are made may be selected from ceramic, stone, glass, sand, metal, hard plastic and hard organic substances. Particularly, the stiff substances may be selected according to the maximum pressure load which will be exerted on the cohesive granular material and according to the chemical surroundings in which the cohesive granular material will be used. Particularly, the substance should ensure that there is no relevant deformation of the granules under the maximum pressure load. I.e. the substance may be selected such that there is no compression of the granules in the direction of the pressure of more than 5, more than 3, more than 1 or more than 0.5%. In the chemical surroundings in which the cohesive granular material according to the present invention is used, the stiff substance should be inert. This means that it should not—or only to a limited extent—chemically react with any chemical components present in these chemical surroundings.\n\nIn the cohesive granular material according to the invention, the elastomeric substance is preferably uniformly distributed over those areas of the cohesive granular material in which the granules abut against each other. With a low relative amount of the elastomeric substance, the elastomeric substance will only form local bridges between the neighboring granules. With an increasing relative amount of the elastomeric substance, these bridges will also extend over areas in which the granules are arranged at some distance. However, the elastomeric substance will still leave the interconnected voids between the granules.\n\nThe bridges of the elastomeric substance connecting the granules elastically couple the granules in a defined relative arrangement of the individual granules. The elasticity of this elastic coupling—besides the relative amount of the elastomeric substance—particularly depends on the Young's modulus of the elastomeric substance. Preferably, this Young's modulus is at maximum 0.1 times or even at maximum 0.01 times or even at maximum 0.001 times or even at maximum 0.0001 times the Young's modulus of the stiff substance, i.e. the Young's moduli of the stiff substance and the elastomeric substance preferably differ by at least one or even several orders of magnitude.\n\nIn absolute terms, the Young's modulus of the elastomeric substance may be in a range from 1 kPa to 1.5 MPa. There are some elastomeric substances, available, whose Young's modulus, for example by the addition of different amounts of crosslinker, may be varied in this range of 1 kPa to 1.5 MPa. If these elastomeric substances are used for the cohesive granular material according to the present invention, the physical properties of the overall cohesive granular material may be tuned in a wide range.\n\nParticularly, the elastomeric substance may be selected from polymeric substances, at least partially crosslinked polymeric substances, chemically inert polymeric substances or, particularly, polydimethylsiloxane (PDMS). Besides the desired physical properties of the cohesive granular material, the selection of the elastomeric substance should be made dependent on the chemical surroundings in which the cohesive granular material is to be used. Preferably, the elastomeric substance is inert with regard to the chemical surroundings in which the cohesive granular material is used. This means that the elastomeric substance does not—or only to a very limited extent—react with any chemical component with which the cohesive granular material may get into contact. PDMS is particularly well suited for the cohesive granular material according to the present invention as its Young's modulus may be fine-tuned by means of adding crosslinker in different amounts, as it is inert in most chemical surroundings, and as it is particularly safe when getting into contact with foodstuff.\n\nIt has already been pointed out above more than once that the elastomeric substance does not fill up the free space left between the granules in the cohesive granular material but that the elastomeric substance leaves voids between the granules, which are interconnected. More particularly, the elastomeric substance makes up not more than about 25% of a partial volume of the cohesive granular material which is not filled by the granules. With regard to the volume of the overall cohesive granular material according to the present invention, the elastomeric substance may make up 0.3% to 9% or 1 to 6% or 2 to 3%. The particular amount of the cohesive granular material defines the extension of the bridges of the polymeric substance between the granules and thus both the physical properties and the pore size and porosity of the cohesive granular material.\n\nA porosity and a permeability of the granular material may be tuned by the grain size of the granules and by the relative amount of the elastomeric material in a range from 30% to 45%, and in a range from 2×10−12m2to 4×10−10m2, respectively. With the granules having a grain size in the range form 55 μm to 2.0 mm, a diameter of the voids in the granular material is in a typical range from 10 μm to 450 μm.\n\nThe cohesive granular material according to the present invention may particularly be used in a filter for a fluid. The fluid may be a gas or a liquid, and it may pass through the interconnected voids in the cohesive granular material, whereas the cohesive granular material retains any bigger sized contaminations of the fluid.\n\nFor making such a filter or for other uses, the cohesive granular material according to the present invention may be shaped into a membrane. Due to the elastic coupling between the granules, this membrane is bendable without the danger of failure. Shaping the cohesive granular material according to the present invention is easily achieved prior to curing the elastomeric substance up to its desired Young's modulus. After curing this shape is fixed.\n\nReferring now in greater detail to the drawings, a cohesive granular material1depicted inFIG. 1consists of granules2made of a stiff substance3, which are connected via bridges4of an elastomeric substance5, and of voids6remaining unfilled by the elastomeric substance5between the granules2. The granules2make up about 60% of the volume of the cohesive granular material1, and the voids6in this volume are interconnected. Thus, the cohesive granular material1is permeable to fluids. Its permeability depends on the pore size, i. e. on the size of the voids6, and on the porosity of the cohesive granular material1due to the overall free space between the granules2not filled up with the elastomeric substance5.\n\nIn the embodiment of the cohesive granular material1according toFIG. 1the bridges4are rings around contact points at which the granules2abut against each other, or short bands locally connecting the granules2where they show their shortest free distances. This distribution of the elastomeric substance5connecting the granules2is typically found with cohesive granular material1comprising not more than 2.7% by volume elastomeric substance5as compared to its overall volume.\n\nWith a relative content of the elastomeric substance5beyond 2.7% by volume of the overall cohesive granular material1, some of the bridges4according toFIG. 1merge to form extended bridges. This is depicted inFIG. 2. Whereas the connection of the granules according toFIG. 1via the elastomeric substance5may be called pendular, the connection according toFIG. 2is funicular. This difference in connecting of the granules2by means of the bridges4made of the elastomeric substance5results in a different dependencies of the Young's modulus of the overall cohesive granular material1on the volumetric content of the elastomeric substance5. Under the pendular regime, the Young's modulus strongly increases with the volumetric content of the elastomeric substance5. Under the funicular regime it only increases slowly. Even under the funicular regime, the voids6between the granules2not filled with the elastomeric substance5are interconnected and provide for a fluid permeability. The pore size and the porosity, however decreases with increasing volumetric content of the elastomeric substance5.\n\nThe Young's modulus of the overall cohesive granular material1further depends of the Young's modulus of the elastomeric substance5in that both Young's moduli increase in parallel. This both applies under the pendular and the funicular regime. The Young's modulus of the stiff substance3being one or more orders of magnitude higher than the Young's modulus of the elastomeric substance5only has an influence on the Young's modulus of the overall cohesive granular material1with larger deformations.\n\nIn working examples of the cohesive granular material according to the invention, glass beads have been mixed with a curable polymer, particularly polydimethylsiloxane (PDMS), with different amounts of crosslinker resulting in different Young's moduli of the polymer in a range of about 1 kPa to 1.5 MPa. Even at the upper limit of this range of 1.5 MPa the Young's modulus of the polymeric material was several orders of magnitudes smaller than the Young's modulus of the beads of about 60 GPa.\n\nFurther, the volumetric content of the polymeric substance has been varied between 0.3 and 8.2%. Additionally, the diameter of the beads and the volume fraction have been varied between 55 μm and 2.0 mm, and between 0.53 vol-% to 0.59 vol-%, respectively. The Young's modulus of the overall cohesive granular material increased with increasing content of PDMS strongly under the pendular regime and only slowly above about 2.7 vol-% under the funicular regime. Further, the Young's modulus of the overall cohesive granular material strongly dropped with increasing diameter of the beads.\n\nThe cohesive granular material according to the present invention may be easily shaped into various forms. The granules are simply mixed with a precursor of the elastomeric substance, like for example PDMS with a certain amount of crosslinker. Then, the cohesive granular material is brought into the desired shape, before the elastomeric substance is cured or crosslinked to the desired extent. The resulting cohesive granular material will keep the desired shape.\n\nFIG. 3schematically depicts a membrane7made of the cohesive granular material1, andFIGS. 4A and 4Bdepict a filter8made of the cohesive granular material1in a top view and in a cross-section, respectively.\n\nThe permeability of the cohesive granular material1has been measured for four bead sizes and two volume fractions of the PDMS. the results are Listed In Table 1.\n\nTABLE 1BeaddiameterVolumeVol. frac.(μm)fraction beadsPDMSPorosityPermeability (m2)5560.6%2.4%37.0%(2.32 ± 0.03) × 10−125559.1%5.0%35.9%(2.32 ± 0.01) × 10−1221061.2%2.4%36.3%(3.54 ± 0.01) × 10−1121060.2%5.2%34.5%(3.54 ± 0.02) × 10−1136559.1%2.4%38.6%(1.41 ± 0.01) × 10−1036558.8%5.1%36.1%(1.26 ± 0.02) × 10−10204060.6%2.5%37.0%(6.2 ± 0.5) × 10−10204060.2%5.4%34.5%(3.7 ± 0.6) × 10−10Table 1: Errors on the permeabilities correspond to standard deviation after 3 different measurements on the same sample.\n\nAs expected, the permeability depends strongly on the grain or bead size of the granules2or beads, but can also be finely tuned with the PDMS fraction. To sum up the results, permeability can be tuned from 2×10−12m2to 4×10−10m2.\n\nThe porosity of the cohesive granular material1depends on the packing of the granules2or beads and on the amount of the PDMS. The maximal porosity one could get with a loose packing of beads and a tiny fraction of the PDMS is be about 45% (maximal value which has been measured). Generally, the porosity can be tuned down to 0% by adding more PDMS. With the maximum fraction of the PDMS tested of 8.2% and with a dense packing of the granules up to a volume fraction of 60%, a porosity of 31.8% has been reached. To summarize, porosities between 31.8% and 45% have been measured, but one could easily decrease the porosity by adding more PDMS.\n\nThe pore size distribution of the cohesive granular material1has not been measured, but it can be estimated by considering the maximum size of a interstitial sphere in a tetrahedral site. The diameter of the sphere inscribed in the pore is then 0.225 times the diameter of the spheres. The pores characteristic size would then vary from a diameter of 10 microns to 450 microns for samples made of beads of 55 microns to 2.0 mm microns in diameter.\n\nMany variations and modifications may be made to the preferred embodiments of the invention without departing substantially from the spirit and principles of the invention. All such modifications and variations are intended to be included herein within the scope of the present invention, as defined by the following claims.\n\n",
            "length": 17139
        },
        {
            "patent_id": "10940178",
            "text": "DETAILED DESCRIPTION OF EXEMPLARY EMBODIMENTS\n\nA. General Introduction\n\nThe present invention provides, inter alia, methods for treating a CD30-expressing hematologic cancer. The present inventors have discovered that a weekly therapeutic regimen with the anti-CD30 antibody-drug conjugate cAC10-(MC-vc-PAB-MMAE)4at doses of about 0.8 mg/kg to about 1.2 mg/kg provides a surprisingly efficacious therapeutic regimen, e.g., it allows for multiple objective responses within a short time period and has an acceptable tolerability profile despite frequent dosing. That such a substantial dose of the antibody-drug conjugate can be provided at such frequent intervals and result in a high response rate and acceptable toxicity profile is a surprising finding. In a phase I study, multiple complete responses were observed within 8 weeks of treatment. The weekly dosing regimen has been observed to provide a high rate of response in a short time period. The high rate of response is also surprising for a drug delivered, not as a combination therapy, but as a monotherapy, for the treatment of cancer. Accordingly, the present methods provide, inter alia, a weekly dosing regimen for administering an anti-CD30 vc-PAB-MMAE antibody-drug conjugate to a subject. In some embodiments, the weekly dosing regimen increases the subject's probability of responding to the therapy as compared to other dosing regimens (e.g., as compared to an every three week dosing regimen). In some embodiments, the dosing regimen does not increase the subject's probability of suffering from an adverse event (including a dose limiting toxicity) as compared to other dosing regimens (e.g., as compared to an every three week dosing regimen) despite the fact that the total dose of antibody drug conjugate over a treatment cycle may be greater for the weekly dosing regimen as compared to other dosing regimens. The present invention also provides, inter alia, maintenance therapy following the weekly dosing regimen.\n\nFor clarity of disclosure, and not by way of limitation, the detailed description of the invention is divided into the subsections which follow.\n\nB. Summary\n\nThe present invention is based, inter alia, on the discovery that weekly dosing of a cAC10-MC-vc-PAB-MMAE antibody drug conjugate (Sanderson et al.,Clinical Cancer Research2005 11:843-852, incorporated by reference herein in its entirety and for all purposes) provides a surprisingly high rate of response with an acceptable tolerability profile.\n\nC. Definitions and Abbreviations\n\nUnless defined otherwise, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art pertinent to the methods and compositions described. As used herein, the following terms and phrases have the meanings ascribed to them unless specified otherwise.\n\nThe term “inhibit” or “inhibition of” as used herein means to a reduce by a measurable amount, or to prevent entirely.\n\nThe transitional phrase “consisting essentially of” as used herein limits the scope of a claim to the specified active agents or steps and those additional active agents and steps that do not materially affect the properties of the specified active agents.\n\nThe term “agent” as used herein means an element, compound, or molecular entity, including, e.g., a pharmaceutical, therapeutic, or pharmacologic compound. Agents can be natural or synthetic or a combination thereof.\n\nAn “anti-cancer agent” is an agent that exerts a cytotoxic or cytostatic effect on cancer cells either alone or in combination with another agent as part of a treatment regimen. An “anti-cancer agent” can slow, stop, or reverse the progression of cancer in a subject. For example, an anti-cancer agent is an agent that can inhibit tumor growth, arrest tumor growth, and/or cause the regression of already existing tumors. Anti-inflammatory agents or other agents administered to a subject with cancer to treat symptoms associated with cancer, but not the underlying cancer itself, including, for example inflammation, pain, weight loss, and general malaise are not considered anti-cancer agents.\n\n“Cytotoxic effect,” in reference to the effect of an agent on a cell, means killing of the cell. “Cytostatic effect” means an inhibition of cell proliferation. A “cytotoxic agent” means an agent that has a cytotoxic or cytostatic effect on a cell, thereby depleting or inhibiting the growth of, respectively, cells within a cell population.\n\nThe term “deplete,” in the context of the effect of an anti-CD30 antibody-drug conjugate on CD30-expressing cells, refers to a reduction or elimination of the CD30-expressing cells.\n\nAs used herein, the terms “treatment” or “treat” refer to slowing, stopping, or reversing the progression of a CD30-expressing disease in a subject.\n\nThe terms “specific binding” and “specifically binds” mean that the anti-CD30 antibody will react, in a highly selective manner, with its corresponding target, CD30, and not with the multitude of other antigens. Typically, the anti-CD30 antibody binds with an affinity of at least about 1×10−7M, and preferably 1×10−8M to 1×10−9M, 1×10−10M, 1×10−11M, or 1×10×12M.\n\nThe term “monoclonal antibody” refers to an antibody that is derived from a single cell clone, including any eukaryotic or prokaryotic cell clone, or a phage clone, and not the method by which it is produced. Thus, the term “monoclonal antibody” as used herein is not limited to antibodies produced through hybridoma technology.\n\nThe terms “identical” or “percent identity,” in the context of two or more nucleic acids or polypeptide sequences, refer to two or more sequences or subsequences that are the same or have a specified percentage of nucleotides or amino acid residues that are the same, when compared and aligned for maximum correspondence. To determine the percent identity, the sequences are aligned for optimal comparison purposes (e.g., gaps can be introduced in the sequence of a first amino acid or nucleic acid sequence for optimal alignment with a second amino or nucleic acid sequence). The amino acid residues or nucleotides at corresponding amino acid positions or nucleotide positions are then compared. When a position in the first sequence is occupied by the same amino acid residue or nucleotide as the corresponding position in the second sequence, then the molecules are identical at that position. The percent identity between the two sequences is a function of the number of identical positions shared by the sequences (i.e., % identity=# of identical positions/total # of positions (e.g., overlapping positions)×100). In certain embodiments, the two sequences are the same length.\n\nThe term “substantially identical,” in the context of two nucleic acids or polypeptides, refers to two or more sequences or subsequences that have at least 70% or at least 75% identity; more typically at least 80% or at least 85% identity; and even more typically at least 90%, at least 95%, or at least 98% identity (for example, as determined using one of the methods set forth below).\n\nThe determination of percent identity between two sequences can be accomplished using a mathematical algorithm. A preferred, non-limiting example of a mathematical algorithm utilized for the comparison of two sequences is the algorithm of Karlin and Altschul, 1990,Proc. Natl. Acad. Sci. USA87:2264-2268, modified as in Karlin and Altschul, 1993,Proc. Natl. Acad. Sci. USA90:5873-5877. Such an algorithm is incorporated into the NBLAST and XBLAST programs of Altschul, et al., 1990,J. Mol. Biol.215:403-410. BLAST nucleotide searches can be performed with the NBLAST program, score=100, wordlength=12 to obtain nucleotide sequences homologous to a nucleic acid encoding a protein of interest. BLAST protein searches can be performed with the XBLAST program, score=50, wordlength=3 to obtain amino acid sequences homologous to protein of interest. To obtain gapped alignments for comparison purposes, Gapped BLAST can be utilized as described in Altschul et al., 1997,Nucleic Acids Res.25:3389-3402. Alternatively, PSI-Blast can be used to perform an iterated search which detects distant relationships between molecules (Id.). When utilizing BLAST, Gapped BLAST, and PSI-Blast programs, the default parameters of the respective programs (e.g., XBLAST and NBLAST) can be used. Another preferred, non-limiting example of a mathematical algorithm utilized for the comparison of sequences is the algorithm of Myers and Miller, CABIOS (1989). Such an algorithm is incorporated into the ALIGN program (version 2.0) which is part of the GCG sequence alignment software package. When utilizing the ALIGN program for comparing amino acid sequences, a PAM120 weight residue table, a gap length penalty of 12, and a gap penalty of 4 can be used. Additional algorithms for sequence analysis are known in the art and include ADVANCE and ADAM as described in Torellis and Robotti, 1994,Comput. Appl. Biosci.10:3-5; and FASTA described in Pearson and Lipman, 1988,Proc. Natl. Acad. Sci.85:2444-8. Within FASTA, ktup is a control option that sets the sensitivity and speed of the search. If ktup=2, similar regions in the two sequences being compared are found by looking at pairs of aligned residues; if ktup=1, single aligned amino acids are examined. ktup can be set to 2 or 1 for protein sequences, or from 1 to 6 for DNA sequences. The default if ktup is not specified is 2 for proteins and 6 for DNA.\n\nAlternatively, protein sequence alignment may be carried out using the CLUSTAL W algorithm, as described by Higgins et al., 1996,Methods Enzymol.266:383-402.\n\nThe term “pharmaceutically acceptable” as used herein refers to those compounds, materials, compositions, and/or dosage forms that are, within the scope of sound medical judgment, suitable for contact with the tissues of human beings and animals without excessive toxicity, irritation, allergic response, or other problems or complications commensurate with a reasonable benefit/risk ratio. The term “pharmaceutically compatible ingredient” refers to a pharmaceutically acceptable diluent, adjuvant, excipient, or vehicle with which an antibody-drug conjugate is administered.\n\nThe abbreviation “MMAE” refers to monomethyl auristatin E.\n\nThe abbreviations “vc” and “val-cit” refer to the dipeptide valine-citrulline.\n\nThe abbreviation “PAB” refers to the self-immolative spacer:\n\n\n\nThe abbreviation “MC” refers to the stretcher maleimidocaproyl:\n\n\n\ncAC10-MC-vc-PAB-MMAE refers to a chimeric AC10 antibody conjugated to the drug MMAE through a MC-vc-PAB linker.\n\nAn anti-CD30 vc-PAB-MMAE antibody-drug conjugate refers to an anti-CD30 antibody conjugated to the drug MMAE via a linker comprising the dipeptide valine citrulline and the self-immolative spacer PAB as shown in Formula (I).\n\nThe phrase “single weekly dose” as it refers to administration of an antibody-drug conjugate refers to administration of the drug once in a weekly period. In contrast, a “split-delivery dose” during a weekly period refers to administration of the drug more than once during the weekly time period.\n\nAs used herein, “pharmaceutically acceptable salts” refer to derivatives of the disclosed compounds wherein the parent compound is modified by making acid or base salts thereof. Examples of pharmaceutically acceptable salts include, but are not limited to, mineral or organic acid salts of basic residues such as amines; alkali or organic salts of acidic residues such as carboxylic acids; and the like. The pharmaceutically acceptable salts include the conventional non-toxic salts or the quaternary ammonium salts of the parent compound formed, for example, from non-toxic inorganic or organic acids. For example, such conventional non-toxic salts include those derived from inorganic acids such as hydrochloric, hydrobromic, sulfuric, sulfamic, phosphoric, nitric and the like; and the salts prepared from organic acids such as acetic, propionic, succinic, glycolic, stearic, lactic, malic, tartaric, citric, ascorbic, pamoic, maleic, hydroxymaleic, phenylacetic, glutamic, benzoic, salicylic, sulfanilic, 2-acetoxybenzoic, fumaric, toluenesulfonic, methanesulfonic, ethane disulfonic, oxalic, isethionic, and the like. These physiologically acceptable salts are prepared by methods known in the art, e.g., by dissolving the free amine bases with an excess of the acid in aqueous alcohol, or neutralizing a free carboxylic acid with an alkali metal base such as a hydroxide, or with an amine.\n\nUnless otherwise noted, the term “alkyl” refers to a saturated straight or branched hydrocarbon having from about 1 to about 20 carbon atoms (and all combinations and subcombinations of ranges and specific numbers of carbon atoms therein), with from about 1 to about 8 carbon atoms being preferred. Examples of alkyl groups are methyl, ethyl, n-propyl, iso-propyl, n-butyl, iso-butyl, sec-butyl, tert-butyl, n-pentyl, 2-pentyl, 3-pentyl, 2-methyl-2-butyl, n-hexyl, n-heptyl, n-octyl, n-nonyl, n-decyl, 3-methyl-2-butyl, 3-methyl-1-butyl, 2-methyl-1-butyl, 1-hexyl, 2-hexyl, 3-hexyl, 2-methyl-2-pentyl, 3-methyl-2-pentyl, 4-methyl-2-pentyl, 3-methyl-3-pentyl, 2-methyl-3-pentyl, 2,3-dimethyl-2-butyl, and 3,3-dimethyl-2-butyl.\n\nAlkyl groups, whether alone or as part of another group, can be optionally substituted with one or more groups, preferably 1 to 3 groups (and any additional substituents selected from halogen), including, but not limited to, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R′, —OC(O)R′, —C(O)OR′, —C(O)NH2, —C(O)NHR′, —C(O)N(R′)2, —NHC(O)R′, —SR′, —SO3R′, —S(O)2R′, —S(O)R′, —OH, ═O, —N3, —NH2, —NH(R′), —N(R′)2and —CN, where each R′ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl, and wherein said —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C1-C8alkyl, —C2-C8alkenyl, and —C2-C8alkynyl groups can be optionally further substituted with one or more groups including, but not limited to, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R″, —OC(O)R″, —C(O)OR″, —C(O)NH2, —C(O)NHR″, —C(O)N(R″)2, —NHC(O)R″, —SR″, —SO3R″, —S(O)2R″, —S(O)R″, —OH, —N3, —NH2, —NH(R″), —N(R″)2and —CN, where each R″ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl.\n\nUnless otherwise noted, the terms “alkenyl” and “alkynyl” refer to straight and branched carbon chains having from about 2 to about 20 carbon atoms (and all combinations and subcombinations of ranges and specific numbers of carbon atoms therein), with from about 2 to about 8 carbon atoms being preferred. An alkenyl chain has at least one double bond in the chain and an alkynyl chain has at least one triple bond in the chain. Examples of alkenyl groups include, but are not limited to, ethylene or vinyl, allyl, -1-butenyl, -2-butenyl, -isobutylenyl, -1-pentenyl, -2-pentenyl, -3-methyl-1-butenyl, -2-methyl-2-butenyl, and -2,3-dimethyl-2-butenyl. Examples of alkynyl groups include, but are not limited to, acetylenic, propargyl, acetylenyl, propynyl, -1-butynyl, -2-butynyl, -1-pentynyl, -2-pentynyl, and -3-methyl-1 butynyl.\n\nAlkenyl and alkynyl groups, whether alone or as part of another group, can be optionally substituted with one or more groups, preferably 1 to 3 groups (and any additional substituents selected from halogen), including but not limited to, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R′, —OC(O)R′, —C(O)OR′, —C(O)NH2, —C(O)NHR′, —C(O)N(R′)2, —NHC(O)R′, —SR′, —SO3R′, —S(O)2R′, —S(O)R′, —OH, ═O, —N3, —NH2, —NH(R′), —N(R′)2and —CN, where each R′ is independently selected from —H, —C1-C8alkyl, —C2-C8alkyenl, —C2-C8alkynyl, or -aryl and wherein said —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C1-C8alkyl, —C2-C8alkenyl, and —C2-C8alkynyl groups can be optionally further substituted with one or more substituents including, but not limited to, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2C8alkynyl), -aryl, —C(O)R″, —OC(O)R″, —C(O)OR″, —C(O)NH2, —C(O)NHR″, —C(O)N(R″)2, —NHC(O)R″, —SR″, —SO3R″, —S(O)2R″, —S(O)R″, —OH, —N3, —NH2, —NH(R″), —N(R″)2and —CN, where each R″ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl.\n\nUnless otherwise noted, the term “alkylene” refers to a saturated branched or straight chain hydrocarbon radical having from about 1 to about 20 carbon atoms (and all combinations and subcombinations of ranges and specific numbers of carbon atoms therein), with from about 1 to about 8 carbon atoms being preferred and having two monovalent radical centers derived by the removal of two hydrogen atoms from the same or two different carbon atoms of a parent alkane. Typical alkylenes include, but are not limited to, methylene, ethylene, propylene, butylene, pentylene, hexylene, heptylene, ocytylene, nonylene, decalene, 1,4-cyclohexylene, and the like. Alkylene groups, whether alone or as part of another group, can be optionally substituted with one or more groups, preferably 1 to 3 groups (and any additional substituents selected from halogen), including, but not limited to, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R′, —OC(O)R′, —C(O)OR′, —C(O)NH2, —C(O)NHR′, —C(O)N(R′)2, —NHC(O)R′, —SR′, —SO3R′, —S(O)2R′, —S(O)R′, ═O, —N3, —NH2, —NH(R′), —N(R′)2and —CN, where each R′ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl and wherein said —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C1-C8alkyl, —C2-C8alkenyl, and —C2-C8alkynyl groups can be further optionally substituted with one or more substituents including, but not limited to, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R″, —OC(O)R″, —C(O)OR″, —C(O)NH2, —C(O)NHR″, —C(O)N(R″)2, —NHC(O)R″, —SR″, —SO3R″, —S(O)2R″, —S(O)R″, —OH, —N3, —NH2, —NH(R″), —N(R″)2and —CN, where each R″ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl.\n\nUnless otherwise noted, the term “alkenylene” refers to an optionally substituted alkylene group containing at least one carbon-carbon double bond. Exemplary alkenylene groups include, for example, ethenylene (—CH═CH—) and propenylene (—CH═CHCH2—).\n\nUnless otherwise noted, the term “alkynylene” refers to an optionally substituted alkylene group containing at least one carbon-carbon triple bond. Exemplary alkynylene groups include, for example, acetylene (—C≡C—), propargyl (—CH2C≡C—), and 4-pentynyl (—CH2CH2CH2C≡CH—).\n\nUnless otherwise noted, the term “aryl” refers to a monovalent aromatic hydrocarbon radical of 6-20 carbon atoms (and all combinations and subcombinations of ranges and specific numbers of carbon atoms therein) derived by the removal of one hydrogen atom from a single carbon atom of a parent aromatic ring system. Some aryl groups are represented in the exemplary structures as “Ar”. Typical aryl groups include, but are not limited to, radicals derived from benzene, substituted benzene, phenyl, naphthalene, anthracene, biphenyl, and the like.\n\nAn aryl group, whether alone or as part of another group, can be optionally substituted with one or more, preferably 1 to 5, or even 1 to 2 groups including, but not limited to, -halogen, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R′, —OC(O)R′, —C(O)OR′, —C(O)NH2, —C(O)NHR′, —C(O)N(R′)2, —NHC(O)R′, —SR′, —SO3R′, —S(O)2R′, —S(O)R′, —OH, —NO2, —N3, —NH2, —NH(R′), —N(R′)2and —CN, where each R′ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl and wherein said —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), and -aryl groups can be further optionally substituted with one or more substituents including, but not limited to, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R″, —OC(O)R″, —C(O)OR″, —C(O)NH2, —C(O)NHR″, —C(O)N(R″)2, —NHC(O)R″, —SR″, —SO3R″, —S(O)2R″, —S(O)R″, —OH, —N3, —NH2, —NH(R″), —N(R″)2and —CN, where each R″ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl.\n\nUnless otherwise noted, the term “arylene” refers to an optionally substituted aryl group which is divalent (i.e., derived by the removal of two hydrogen atoms from the same or two different carbon atoms of a parent aromatic ring system) and can be in the ortho, meta, or para configurations as shown in the following structures with phenyl as the exemplary aryl group:\n\n\nTypical “—(C1-C8alkylene)aryl,” “—(C2-C8alkenylene)aryl”, “and —(C2-C8alkynylene)aryl” groups include, but are not limited to, benzyl, 2-phenylethan-1-yl, 2-phenylethen-1-yl, naphthylmethyl, 2-naphthylethan-1-yl, 2-naphthylethen-1-yl, naphthobenzyl, 2-naphthophenylethan-1-yl and the like.\n\nUnless otherwise noted, the term “heterocycle,” refers to a monocyclic, bicyclic, or polycyclic ring system having from 3 to 14 ring atoms (also referred to as ring members) wherein at least one ring atom in at least one ring is a heteroatom selected from N, O, P, or S (and all combinations and subcombinations of ranges and specific numbers of carbon atoms and heteroatoms therein). The heterocycle can have from 1 to 4 ring heteroatoms independently selected from N, O, P, or S. One or more N, C, or S atoms in a heterocycle can be oxidized. A monocylic heterocycle preferably has 3 to 7 ring members (e.g., 2 to 6 carbon atoms and 1 to 3 heteroatoms independently selected from N, O, P, or S), and a bicyclic heterocycle preferably has 5 to 10 ring members (e.g., 4 to 9 carbon atoms and 1 to 3 heteroatoms independently selected from N, O, P, or S). The ring that includes the heteroatom can be aromatic or non-aromatic. Unless otherwise noted, the heterocycle is attached to its pendant group at any heteroatom or carbon atom that results in a stable structure.\n\nHeterocycles are described in Paquette, “Principles of Modern Heterocyclic Chemistry” (W. A. Benjamin, New York, 1968), particularly Chapters 1, 3, 4, 6, 7, and 9; “The Chemistry of Heterocyclic Compounds, A series of Monographs” (John Wiley & Sons, New York, 1950 to present), in particular Volumes 13, 14, 16, 19, and 28; andJ. Am. Chem. Soc.82:5566 (1960).\n\nUnless otherwise noted, the term “heterocyclo” refers to an optionally substituted heterocycle group as defined above that is divalent (i.e., derived by the removal of two hydrogen atoms from the same or two different carbon atoms of a parent heterocyclic ring system).\n\nExamples of “heterocycle” groups include by way of example and not limitation pyridyl, dihydropyridyl, tetrahydropyridyl (piperidyl), thiazolyl, pyrimidinyl, furanyl, thienyl, pyrrolyl, pyrazolyl, imidazolyl, tetrazolyl, benzofuranyl, thianaphthalenyl, indolyl, indolenyl, quinolinyl, isoquinolinyl, benzimidazolyl, piperidinyl, 4-piperidonyl, pyrrolidinyl, 2-pyrrolidonyl, pyrrolinyl, tetrahydrofuranyl, bis-tetrahydrofuranyl, tetrahydropyranyl, bis-tetrahydropyranyl, tetrahydroquinolinyl, tetrahydroisoquinolinyl, decahydroquinolinyl, octahydroisoquinolinyl, azocinyl, triazinyl, 6H-1,2,5-thiadiazinyl, 2H,6H-1,5,2-dithiazinyl, thienyl, thianthrenyl, pyranyl, isobenzofuranyl, chromenyl, xanthenyl, phenoxathinyl, 2H-pyrrolyl, isothiazolyl, isoxazolyl, pyrazinyl, pyridazinyl, indolizinyl, isoindolyl, 3H-indolyl, 1H-indazolyl, purinyl, 4H-quinolizinyl, phthalazinyl, naphthyridinyl, quinoxalinyl, quinazolinyl, cinnolinyl, pteridinyl, 4H-carbazolyl, carbazolyl, β-carbolinyl, phenanthridinyl, acridinyl, pyrimidinyl, phenanthrolinyl, phenazinyl, phenothiazinyl, furazanyl, phenoxazinyl, isochromanyl, chromanyl, imidazolidinyl, imidazolinyl, pyrazolidinyl, pyrazolinyl, piperazinyl, indolinyl, isoindolinyl, quinuclidinyl, morpholinyl, oxazolidinyl, benzotriazolyl, benzisoxazolyl, oxindolyl, benzoxazolinyl, and isatinoyl. Preferred “heterocycle” groups include, but are not limited to, benzofuranyl, benzothiophenyl, indolyl, benzopyrazolyl, coumarinyl, isoquinolinyl, pyrrolyl, thiophenyl, furanyl, thiazolyl, imidazolyl, pyrazolyl, triazolyl, quinolinyl, pyrimidinyl, pyridinyl, pyridonyl, pyrazinyl, pyridazinyl, isothiazolyl, isoxazolyl and tetrazolyl.\n\nA heterocycle group, whether alone or as part of another group, can be optionally substituted with one or more groups, preferably 1 to 2 groups, including but not limited to, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R′, —OC(O)R′, —C(O)OR′, —C(O)NH2, —C(O)NHR′, —C(O)N(R′)2, —NHC(O)R′, —SR′, —SO3R′, —S(O)2R′, —S(O)R′, —OH, —N3, —NH2, —NH(R′), —N(R′)2and —CN, where each R′ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, alkynyl, or -aryl and wherein said —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, and -aryl groups can be further optionally substituted with one or more substituents including, but not limited to, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R″, —OC(O)R″, —C(O)OR″, —C(O)NH2, —C(O)NHR″, —C(O)N(R″)2, —NHC(O)R″, —SR″, —SO3R″, —S(O)2R″, —S(O)R″, —OH, —N3, —NH2, —NH(R″), —N(R″)2and —CN, where each R″ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or aryl.\n\nUnless otherwise noted, the term “carbocycle,” refers to a saturated or unsaturated non-aromatic monocyclic, bicyclic, or polycyclic ring system having from 3 to 14 ring atoms (and all combinations and subcombinations of ranges and specific numbers of carbon atoms therein) wherein all of the ring atoms are carbon atoms. Monocyclic carbocycles preferably have 3 to 6 ring atoms, still more preferably 5 or 6 ring atoms. Bicyclic carbocycles preferably have 7 to 12 ring atoms, e.g., arranged as a bicyclo [4,5], [5,5], [5,6] or [6,6] system, or 9 or 10 ring atoms arranged as a bicyclo [5,6] or [6,6] system. The term “carbocycle” includes, for example, a monocyclic carbocycle ring fused to an aryl ring (e.g., a monocyclic carbocycle ring fused to a benzene ring). Carbocyles preferably have 3 to 8 carbon ring atoms.\n\nCarbocycle groups, whether alone or as part of another group, can be optionally substituted with, for example, one or more groups, preferably 1 or 2 groups (and any additional substituents selected from halogen), including, but not limited to, -halogen, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R′, —OC(O)R′, —C(O)OR′, —C(O)NH2, —C(O)NHR′, —C(O)N(R′)2, —NHC(O)R′, —SR′, —SO3R′, —S(O)2R′, —S(O)R′, —OH, ═O, —N3, —NH2, —NH(R′), —N(R′)2and —CN, where each R′ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl and wherein said —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), and -aryl groups can be further optionally substituted with one or more substituents including, but not limited to, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, -halogen, —O—(C1-C8alkyl), —O—(C2-C8alkenyl), —O—(C2-C8alkynyl), -aryl, —C(O)R″, —OC(O)R″, —C(O)OR″, —C(O)NII2, —C(O)NIIR″, —C(O)N(R″)2, —NHC(O)R″, —SR″, —SO3R″, —S(O)2R″, —S(O)R″, —OH, —N3, —NH2, —NH(R″), —N(R″)2and —CN, where each R″ is independently selected from —H, —C1-C8alkyl, —C2-C8alkenyl, —C2-C8alkynyl, or -aryl.\n\nExamples of monocyclic carbocylic substituents include -cyclopropyl, -cyclobutyl, -cyclopentyl, -1-cyclopent-1-enyl, -1-cyclopent-2-enyl, -1-cyclopent-3-enyl, cyclohexyl, -1-cyclohex-1-enyl, -1-cyclohex-2-enyl, -1-cyclohex-3-enyl, -cycloheptyl, -cyclooctyl, -1,3-cyclohexadienyl, -1,4-cyclohexadienyl, -1,3-cycloheptadienyl, -1,3,5-cycloheptatrienyl, and -cyclooctadienyl.\n\nA “carbocyclo,” whether used alone or as part of another group, refers to an optionally substituted carbocycle group as defined above that is divalent (i.e., derived by the removal of two hydrogen atoms from the same or two different carbon atoms of a parent carbocyclic ring system).\n\nUnless otherwise indicated by context, a hyphen (-) designates the point of attachment to the pendant molecule. Accordingly, the term “—(C1-C8alkylene)aryl” or “—C1-C8alkylene(aryl)” refers to a C1-C8alkylene radical as defined herein wherein the alkylene radical is attached to the pendant molecule at any of the carbon atoms of the alkylene radical and one of the hydrogen atoms bonded to a carbon atom of the alkylene radical is replaced with an aryl radical as defined herein.\n\nWhen a particular group is “substituted”, that group may have one or more substituents, preferably from one to five substituents, more preferably from one to three substituents, most preferably from one to two substituents, independently selected from the list of substituents. Groups that are substituted are so indicated.\n\nIt is intended that the definition of any substituent or variable at a particular location in a molecule be independent of its definitions elsewhere in that molecule. It is understood that substituents and substitution patterns on the compounds of this invention can be selected by one of ordinary skill in the art to provide compounds that are chemically stable and that can be readily synthesized by techniques known in the art as well as those methods set forth herein.\n\nD. Dosing Regimen\n\nThe present invention provides, inter alia, a dosing regimen for the treatment of CD30-expressing hematologic cancers. The dosing regimen comprises a weekly dose of an antibody-drug conjugate as described herein of from about 0.8 mg/kg body weight to about 1.8 mg/kg body weight, 0.8 mg/kg body weight to about 1.6 mg/kg body weight, 0.8 mg/kg body weight to about 1.4 mg/kg body weight, 0.8 mg/kg body weight to about 1.2 mg/kg body weight, or more preferably from about 0.8 mg/kg body weight to about 1.0 mg/kg body weight for at least a three week period (e.g., 21 day period). The weekly dose can either be administered as a single weekly dose (once a week) or by split delivery (e.g., two or more times per week).\n\nIn some embodiments, the weekly dose of the antibody drug conjugate will be about 0.8 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 0.9 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.0 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.1 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.2 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.3 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.4 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.5 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.6 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.7 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be about 1.8 mg/kg body weight. In some embodiments, the weekly dose of the antibody drug conjugate will be 0.8, 0.9, 1, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7 or 1.8 mg/kg of the subject's body weight.\n\nIn some embodiments, the weekly dose is administered, as a split delivery or as a single weekly dose, for at least one three week (e.g., 21 day) treatment cycle. In some embodiments, the dose will be administered as a single weekly dose on days 1, 8, and 15 of a 21 day treatment cycle. Preferably, the weekly dose, as a split delivery or as a single weekly dose, is administered for two or more 21 day treatment cycles, even more preferably for three or more, four or more, five, or even six or more treatment cycles. In some embodiments, the weekly dose is administered for no more than 3, no more than 4, no more than 5, or no more than 6 treatment cycles. Preferably, there will a period of rest between treatment cycles. For example, in some preferred embodiments, the dosing regimen will be a total weekly dose of the antibody-drug conjugate of from about 0.8 mg/kg body weight to about 1.8 mg/kg body weight, 0.8 mg/kg body weight to about 1.6 mg/kg body weight, 0.8 mg/kg body weight to about 1.4 mg/kg body weight, 0.8 mg/kg body weight to about 1.2 mg/kg body weight or 0.8 mg/kg body weight to about 1.0 mg/kg body weight for at least two treatment cycles with a one week period of rest between each of the treatment cycles (e.g., six single weekly doses during an eight week time period). In some embodiments, the treatment cycle will be greater than 21 days. The weekly dose can be administered as a single weekly dose (once a week) or by split delivery (e.g., two or more times per week).\n\nInstead of referring to the treatment cycle as a three week treatment cycle with a one week period of rest between treatment cycles, the treatment cycle can be referred to as a 4 week (28 day) treatment cycle where the antibody-drug conjugate is delivered 3 out of 4 weeks in the 4 week treatment cycle. Accordingly, in some embodiments, the dose is administered weekly, as a split delivery or as a single weekly dose, 3 out of 4 weeks in a 4 week treatment cycle. In some embodiments, the dose will be administered as a single weekly dose on days 1, 8, and 15 of a 28 day treatment cycle. Preferably, the weekly dose, as a split delivery or as a single weekly dose, is administered for two or more four week treatment cycles, even more preferably for three or more, four or more, five or more, or even six or more four week treatment cycles (e.g., 2, 3, 4, 5, or 6 consecutive treatment cycles). In some embodiments, the weekly dose is administered for no more than 3, no more than 4, no more than 5, or no more than 6 treatment cycles. For example, in some preferred embodiments, the dosing regimen will be a weekly dose, as a split delivery or as a single weekly dose, for a total weekly dose of from about 0.8 mg/kg body weight to about 1.8 mg/kg body weight, 0.8 mg/kg body weight to about 1.6 mg/kg body weight, 0.8 mg/kg body weight to about 1.4 mg/kg body weight, 0.8 mg/kg body weight to about 1.2 mg/kg body weight or 0.8 mg/kg body weight to about 1.0 mg/kg body weight of the antibody-drug conjugate, 3 out of 4 weeks, for at least two four week treatment cycles (e.g., six single weekly doses an eight week time period). In some preferred embodiments, the dosing regimen will be a weekly dose, as a split delivery or as a single weekly dose, for a total weekly dose of from about 0.8 mg/kg body weight to about 1.8 mg/kg body weight, 0.8 mg/kg body weight to about 1.6 mg/kg body weight, 0.8 mg/kg body weight to about 1.4 mg/kg body weight, 0.8 mg/kg body weight to about 1.2 mg/kg body weight or 0.8 mg/kg body weight to about 1.0 mg/kg body weight of the antibody-drug conjugate, 3 out of 4 weeks, for one, two, three, four, or five four week treatment cycles (e.g., six single weekly doses in an eight week time period, nine single weekly doses in a twelve week time period, twelve single weekly doses in a sixteen week time period).\n\nFollowing or during one or more treatment cycles (e.g., during days 21-28 of the second treatment cycle), the subject can be evaluated (e.g., through clinical or diagnostic testing) to determine whether the subject should remain on the treatment schedule. For example, following or during one or more 28 day treatment cycles (e.g., 1, 2, 3, 4, 5, or 6 28 day treatment cycles), the subject can be evaluated (e.g., a clinical and/or diagnostic evaluation). Depending on the evaluation, the subject will discontinue treatment, continue on treatment with additional treatment cycles, or commence maintenance therapy. If the subject continues treatment, the subject can be further evaluated following one or more additional treatment cycles. Depending on each successive evaluation, the subject will discontinue treatment, continue on treatment with additional treatment cycles, or commence maintenance therapy.\n\nThe present invention encompasses embodiments wherein the subject remains on the weekly treatment cycle (e.g., the four week treatment cycle) following an evaluation indicating that the subject has no detectable cancer, for example, following a diagnostic test that is negative for the CD30 expressing cancer (i.e., the diagnostic test is unable to detect any cancer in the subject). For example, in some embodiments, the subject will remain on the weekly treatment cycle for at least 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12 or more treatment cycles following such an evaluation. In some embodiments, the subject will remain on the weekly treatment cycle for at least two but no more than 3, no more than 4, no more than 5, or no more than 6 treatment cycles. One example of a diagnostic test used for determining the presence and severity of cancers is positron emission tomography (PET).\n\nIn some embodiments, the subject will commence maintenance therapy following one or more, preferably two or more, (e.g, following 1, 2, 3, 4, 5, or 6) treatment cycles (e.g., the four week treatment cycle). In some embodiments, the subject will commence maintenance therapy following an evaluation indicating that the subject has little or no detectable cancer, e.g., following an evaluation indicating that the subject has had a complete response. As used herein, maintenance therapy refers to therapy with the antibody-drug conjugate but at a reduced administration schedule at either the same or different dosages. During maintenance therapy, the antibody-drug conjugate is preferably administered once every two weeks, once every three weeks, once every four weeks, once every five weeks, once every 6 weeks, once every 7 weeks, or once every 8 weeks. Following these maintenance therapy cycles, the subject can be further evaluated (e.g., through clinical or diagnostic testing) to determine whether the subject should remain on the maintenance therapy, continue with regular treatment or discontinue treatment. In some embodiments, maintenance therapy will be once every three weeks to six weeks. The dosage of the antibody drug conjugate administered during maintenance therapy can range, for example, from about 0.3 mg/kg body weight to about 2.0 mg/kg body weight, preferably from about 0.6 mg/kg body weight to about 1.8 mg/kg body weight, preferably from about 1.2 mg/kg body weight to about 2.0 mg/kg body weight, more preferably from about 1 mg/kg body weight to about 1.8 mg/kg body weight per dose, with 1.8 mg/kg being an exemplary dose.\n\nIn some embodiments, following conclusion of the weekly treatment at a dosage of the antibody drug conjugate of from about 0.8 mg/kg body weight to about 1.8 mg/kg body weight, more preferably a dosage of from about 0.8 mg/kg body weight to about 1.2 mg/kg body weight and evaluation, the subject will begin a maintenance therapy which comprises administration of the antibody-drug conjugate once every three to six weeks at a dosage of from about 0.3 mg/kg body weight to about 2 mg/kg body weight, preferably from about 0.6 mg/kg body weight to about 1.8 mg/kg body weight, preferably from about 1.2 mg/kg body weight to about 2.0 mg/kg body weight, more preferably from about 1 mg/kg body weight to about 1.8 mg/kg body weight with about 1.8 mg/kg being preferred. In some embodiments, following conclusion of the weekly treatment (e.g., for one, two, three, four or five treatment cycles), the subject will begin a once every three week administration schedule (e.g., treatment on day 1 of a three week maintenance therapy cycle) of the antibody drug conjugate at a dosage of from about 0.4 mg/kg body weight to about 2 mg/kg body weight, from about 1.2 mg/kg body weight to about 2.0 mg/kg body weight, or from about 1 mg/kg body weight to about 1.8 mg/kg body weight with about 1.8 mg/kg being preferred.\n\nAccordingly, the present invention encompasses embodiments wherein a subject will be administered a weekly dose, as a split delivery or as a single weekly dose, of the antibody drug conjugate for a total weekly dose of from about 0.8 mg/kg of the subject's body weight to about 1.8 mg/kg of the subject's body weight, about 0.8 mg/kg body weight to about 1.6 mg/kg body weight, about 0.8 mg/kg body weight to about 1.4 mg/kg body weight, about 0.8 mg/kg body weight to about 1.2 mg/kg body weight or about 0.8 mg/kg body weight to about 1.0 mg/kg body weight, 3 out of 4 weeks, for one, two, three, four, five, or six 28 day treatment cycles followed by administration of an every three to six week dose, preferably every three week dose, of antibody drug conjugate at a dose of from about 0.4 mg/kg body weight to about 2 mg/kg body weight, from about 1.2 mg/kg body weight to about 2.0 mg/kg body weight, or from about 1.0 mg/kg body weight to about 1.8 mg/kg body weight per dose for 2 or more maintenance therapy cycles. In some embodiments, the weekly administration cycle will be for 2, 3, 4, 5, 6, 7, 8, 9 or 10 or more treatment cycles and the every three week administration schedule will be for 2, 3, 4, 5, 6, 7, 8, 9 or 10 or more maintenance therapy cycles. In some embodiments, the weekly administration cycle will be for no more than 2, 3, 4, 5, or 6 treatment cycles.\n\nThe present invention encompasses embodiments wherein a subject will be administered a weekly dose, as a split delivery or as a single weekly dose, of the antibody drug conjugate at a total weekly dose of dose of from about 0.8 mg/kg of the subject's body weight to about 1.2 mg/kg 3 out of 4 weeks (e.g., on days 1, 8, and 15 of a 28 day treatment cycle) for one, two, three, four, five, or six 28 day treatment cycles followed by administration of an every three to six week dose, preferably every three week dose, of antibody drug conjugate at a dose of about 1.8 mg/kg per body weight for 2 or more maintenance therapy cycles (e.g., a dose of about 1.8 mg/kg per body weight every three weeks for two or more three week maintenance therapy cycles).\n\nThe present invention encompasses embodiments wherein the subject to be treated by the present methods is being treated with a anti-CD30 vc-PAB MMAE antibody-drug conjugate of the present invention but at a schedule other than the weekly dosing regimen (e.g., administration of the antibody drug conjugate at a dose of about 1.8 mg/kg body weight every three weeks for one or more three week therapy cycles) and is switched to a weekly dosing regimen as described herein for no more than 1, 2, 3, 4, 5, or 6 treatment cycles. Following the weekly dosing regimen, the patient can optionally commence maintenance therapy as described herein.\n\nThe present invention also encompasses embodiments wherein following treatment with the antibody-drug conjugate and prior to commencement of maintenance therapy, the subject will undergo a stem cell transplant. Accordingly, in some embodiments, following two or more treatment cycles (e.g., following 1, 2, 3, 4, 5 or 6 treatment cycles) and following an evulation indicating that the subject is eligible for a stem cell transplant, the subject will undergo a stem cell transplant. Following the transplant, the subject can commence maintenance therapy. Maintenance therapy will commence post transplant and prior to any detectable relapse of the cancer.\n\nThe antibody-drug conjugate is preferably administered as a monotherapy. By the term “monotherapy” it is meant that the antibody drug conjugate is the only anti-cancer agent administered to the subject during the treatment cycle. Other therapeutic agents, however, can be administered to the subject. For example, anti-inflammatory agents or other agents administered to a subject with cancer to treat symptoms associated with cancer, but not the underlying cancer itself, including, for example inflammation, pain, weight loss, and general malaise can be administered during the period of monotherapy. A subject being treated by the present methods will preferably have completed any prior treatment with anti-cancer agents before administration of the antibody drug conjugate. In some embodiments, the subject will have completed any prior treatment with anti-cancer agents at least 1 week (preferably 2, 3, 4, 5, 6, 7, or 8 weeks) prior to treatment with the antibody drug conjugate. The subject will also, preferably, not be treated with any additional anti-cancer agents for at least 2 weeks (preferably at least 3, 4, 5, 6, 7, or 8 weeks) following completion of the first treatment cycle with the antibody drug conjugate and preferably for at least 2 weeks (preferably at least 3, 4, 5, 6, 7, or 8 weeks) following completion of the last dose of the antibody drug conjugate.\n\nE. Subjects\n\nThe methods of the present invention encompass administering an anti-CD30 vc-PAB-MMAE antibody-drug conjugate to a subject for the treatment of a CD30-expressing hematologic cancer. After administration of the antibody-drug conjugate to a subject and binding of the anti-CD30 antibody to a CD30 expressing cancer cell, the antibody drug conjugate internalizes into the cell, and the drug is released.\n\nA CD30-expressing hematologic cancer refers to a hematologic cancer that expresses the CD30 antigen. The CD30 antigen is expressed in large numbers on tumor cells of select lymphomas and leukemias. Hodgkin lymphoma, anaplastic large-cell lymphoma, and/or acute or lymphomatous forms of adult T-cell leukemia are examples of CD30-expressing hematologic cancers that can be treated by the present methods.\n\nThe subjects to be treated with the methods of the present invention are those that have been diagnosed with a CD30 expressing hematologic cancer or are suspected of having a CD30-expressing hematologic cancer. Diagnosis can be by methods known in the art, including, for example, lymph node biopsy. After Hodgkin lymphoma is diagnosed, for example, a subject can be classified according to stage of disease using one of the known classification schemes. The Cotswolds staging classification scheme is one such classification scheme. The methods of the present invention can be used to treat a subject classified in any stage of disease, including a subject with advanced stage disease.\n\nThe methods of the present invention encompass treating a subject who is newly diagnosed and has not previously been treated for a CD30-expressing hematologic cancer.\n\nThe methods of the present invention can be used to treat subjects with a refractory and/or relapsed CD30-expressing hematologic cancer.\n\nA subject with a refractory CD30-expressing hematologic cancer is a subject who has not responded to a previous anti-cancer therapy, i.e., the subject continues to experience disease progression despite therapy.\n\nA subject with a relapsed CD30-expressing hematologic cancer is a subject who has responded to a prior anti-cancer therapy for the disease at one point, but has had a reoccurence or further progression of disease following the response.\n\nThe methods of the present invention encompass, for example, treating a subject who has previously been treated with a first-line chemotherapy regimen and/or a salvage regimen and/or experimental treatment for the CD30-expressing hematologic cancer. First line chemotherapeutic regimens for Hodgkin lymphoma include, for example, the ABVD regimen (Bonadonna and Santoro, Cancer Treat Rev 1982; 9:21-35), the BEACOPP regimen (Diehl et al., N Engl J Med 2003; 348:2386-2395), the escalated BEACOPP regimen (Diehl et al., N Engl J Med 2003; 348:2386-2395), the MOPP regimen (Devita et al., Ann Inter Med 1970:73:881-895), and the Stanford V regimen (Horning et al., J Clin Oncol 2000; 18:972-980). Salvage chemotherapy regimens and experimental regimens include, for example, the ESHAP regimen (Aparicio et al., Ann Ocol 1999; 10:593-595), the modified Stanford V regimen (Aviles et al., Med Oncol 2001; 18:261-267), the GDP regimen (Baetz et al., Ann Oncol 2003; 14:1762-1767), the Mini-Beam regimen (Colwill et al., J Clin Oncol 1995; 13:396-402, Fernandez-Jimenez et al., Haematologica 1999; 84:1007-1011), the MIME regimen (Enblad et al., Eur J Haematol 1998; 60:166-171), the MINE regimen (Ferme et al., Ann Oncol 1995; 6:543-549), the IEE regimen (Jackson et al., Leuk Lymphoma 2000; 37:561-570), the DHAP regimen (Josting et al., Ann Oncol 2002; 13:1628-1635), the ICE regimen (Moskowitz et al., Semin Oncol 2004; 31(suppl):54-59), the IIVP regimen (Oyan et al., Biol Blood Marrow Transplant 2005; 11:688-697), the IVE regimen (Proctor et al., Eur J Haematol 2001; 64(suppl):28-32), the VIP regimen (Ribrag et al., Bone Marrow Transplant 1998; 21:969-974), the ASHAP regimen (Rodriguez et al., Blood 1999; 93:3632-3636), the Dexa-BEAM regimen (Schmitz et al., Lancet 2002; 359:2065-2071), the CEP regimen (Szanto et al., Oncology 1991; 48:456-458), the CN30P regimen (Walewski et al., Med Oncol. 2000; 17:195-202), the MVC regimen (Wiernik et al., Cancer J Sci Am 1998; 4:254-260) and gemcitabine (Savage et al., Annals of Oncology 2000; 11:595-597).\n\nThe methods of the present invention also encompass treating a subject who has previously undergone a stem cell transplant. In some embodiments, the methods encompass treating a subject who has undergone a stem cell transplant for treatment of a CD30-expressing hematologic cancer and who, at the time, of treatment has no detectable signs of cancer. The methods also encompass treating a subject who has previously undergone a stem cell transplant but has relapsed.\n\nF. Anti-CD30 Antibodies\n\nAnti-CD30 antibodies suitable for use in accordance with the present compositions and methods include any antibody that specifically binds to the CD30 antigen.\n\nIn some embodiments, anti-CD30 antibodies of the present invention not only immunospecifically bind CD30 but also can exert cytostatic and/or cytotoxic effect on cancerous cells, for example, malignant cells in HL. In some such embodiments, the cytostatic or cytotoxic effect is complement-independent and can be achieved in the absence of (i) conjugation to a cytostatic or cytotoxic agent and (ii) effector cells. For example, in some such embodiments, the cytostatic or cytotoxic effect is not a result of antibody effector function but, for example, a result of signaling activity.\n\nAnti-CD30 antibodies of the present invention are preferably monoclonal and can include, for example, chimeric (e.g., having a human constant region and mouse variable region), humanized, or human antibodies. The immunoglobulin molecule is of the IgG type and can be any subclass (e.g., IgG1, IgG2, IgG3, IgG4) of immunoglobulin molecule and variants thereof. The immunoglobulin molecule is preferably an IgG1.\n\nThe antibodies of the present invention can be generated by any suitable method known in the art. Monoclonal antibodies can be prepared using a wide variety of techniques known in the art including the use of hybridoma, recombinant, and phage display technologies, or a combination thereof. For example, monoclonal antibodies can be produced using hybridoma techniques including those known in the art and taught, for example, in Harlow et al., Antibodies: A Laboratory Manual, (Cold Spring Harbor Laboratory Press, 2nd ed., 1988); Hammerling, et al., in: Monoclonal Antibodies and T-Cell Hybridomas 563-681 (Elsevier, N.Y., 1981) (said references incorporated by reference in their entireties).\n\nAny method known in the art for the synthesis of proteins, e.g., recombinant expression techniques, can be used to generate the anti-CD30 antibodies of the present invention.\n\nOnce a CD30-binding protein is identified, if desired, its ability (alone or when multimerized or fused to a dimerization or multimerization domain) to elicit a cytostatic or cytotoxic effect on CD30-expressing cancerous cells can be determined by contacting a culture of an CD30-expressing cancer cell line, such as L428, L450, HLLM2 or KM-H2, with the protein. Culture conditions are most preferably about 5,000 cells in a culture area of about 0.33 cm2, and the contacting period being approximately 72 hours. The culture is then exposed to 0.5 μCi of3H-thymidine during the final 8 hours of the 72-hour period and the incorporation of3H-thymidine into cells of the culture is measured. The protein has a cytostatic or cytotoxic effect on the cell line if the cells of the culture have reduced3H-thymidine incorporation compared to cells of the same cell line cultured under the same conditions but not contacted with the protein. There are many other cytotoxicity assays known to those of skill in the art. Any one of them can be used in the present methods.\n\nExemplary anti-CD30 antibodies include, but are not limited to, humanized or chimeric AC10 or HeFi-1 antibodies. Murine AC10 has been deposited under ATCC Accession Number PTA-6679.\n\nAn exemplary anti-CD30 antibody comprises one or more (1, 2, 3, 4, 5, or 6) CDRs of murine HeFi-1 (SEQ ID NO:20, SEQ ID NO:22; SEQ ID NO:24; SEQ ID NO:28, SEQ ID NO:30 or SEQ ID NO:32) or murine AC10 (SEQ ID NO:4; SEQ ID NO:6; SEQ ID NO:8; SEQ ID NO:12; SEQ ID NO:14; or SEQ ID NO:16). In some embodiments, the anti-CD30 antibody comprises the heavy and/or light chain variable regions of murine HeFi-1 (SEQ ID NO:18 or SEQ ID NO:26) or murine AC10 (SEQ ID NO:2 or SEQ ID NO:10). A table indicating the region of AC10 or HeFi-1 to which each SEQ ID NO corresponds to is provided below.\n\nTABLE 1NUCLEOTIDE ORSEQ IDMOLECULEAMINO ACIDNOAC10 Heavy Chain Variable RegionNucleotide1AC10 Heavy Chain Variable RegionAmino Acid2AC10 Heavy Chain-CDR1 (H1)Nucleotide3AC10 Heavy Chain-CDR1 (H1)Amino Acid4AC10 Heavy Chain-CDR2 (H2)Nucleotide5AC10 Heavy Chain-CDR2 (H2)Amino Acid6AC10 Heavy Chain-CDR3 (H3)Nucleotide7AC10 Heavy Chain-CDR3 (H3)Amino Acid8AC10 Light Chain Variable RegionNucleotide9AC10 Light Chain Variable RegionAmino Acid10AC10 Light Chain-CDR1 (L1)Nucleotide11AC10 Light Chain-CDR1 (L1)Amino Acid12AC10 Light Chain-CDR2 (L2)Nucleotide13AC10 Light Chain-CDR2 (L2)Amino Acid14AC10 Light Chain-CDR3 (L3)Nucleotide15AC10 Light Chain-CDR3 (L3)Amino Acid16HeFi-1 Heavy Chain Variable RegionNucleotide17HeFi-1 Heavy Chain Variable RegionAmino Acid18HeFi-1 Heavy Chain-CDR1 (H1)Nucleotide19HeFi-1 Heavy Chain-CDR1 (H1)Amino Acid20HeFi-1 Heavy Chain-CDR2 (H2)Nucleotide21HeFi-1 Heavy Chain-CDR2 (H2)Amino Acid22HeFi-1 Heavy Chain-CDR3 (H3)Nucleotide23HeFi-1 Heavy Chain-CDR3 (H3)Amino Acid24HeFi-1 Light Chain Variable RegionNucleotide25HeFi-1 Light Chain Variable RegionAmino Acid26HeFi-1 Light Chain-CDR1 (L1)Nucleotide27HeFi-1 Light Chain-CDR1 (L1)Amino Acid28HeFi-1 Light Chain-CDR2 (L2)Nucleotide29HeFi-1 Light Chain-CDR2 (L2)Amino Acid30HeFi-1 Light Chain-CDR3 (L3)Nucleotide31HeFi-1 Light Chain-CDR3 (L3)Amino Acid32Human gamma I constant regionAmino Acid33Human kappa constant regionAmino Acid34\n\nIn a specific embodiment, the invention encompasses an antibody comprising a heavy chain variable domain, said variable domain comprising (a) a set of three CDRs, in which said set of CDRs comprises SEQ ID NO:4, 6, or 8 or comprises amino acid sequences that are substantially identical to the amino acid sequences set forth in SEQ ID NO:4, 6, or 8 and (b) a set of four framework regions, in which said set of framework regions differs from the set of framework regions in murine monoclonal antibody AC10, and in which said antibody immunospecifically binds CD30.\n\nIn a specific embodiment, the invention encompasses an antibody comprising a heavy chain variable domain, said variable domain comprising (a) a set of three CDRs, in which said set of CDRs comprises SEQ ID NO:20, 22 or 24 or comprises amino acid sequences that are substantially identical to the amino acid sequences set forth in SEQ ID NO:20, 22, or 24 and (b) a set of four framework regions, in which said set of framework regions differs from the set of framework regions in murine monoclonal antibody HeFi-1, and in which said antibody immunospecifically binds CD30.\n\nIn a specific embodiment, the invention encompasses an antibody comprising a light chain variable domain, said variable domain comprising (a) a set of three CDRs, in which said set of CDRs comprises SEQ ID NO:12, 14 or 16 or comprises amino acid sequences that are substantially identical to the amino acid sequences set forth in SEQ ID NO:12, 14, or 16, and (b) a set of four framework regions, in which said set of framework regions differs from the set of framework regions in murine monoclonal antibody AC10, and in which said antibody immunospecifically binds CD30.\n\nIn a specific embodiment, the invention encompasses an antibody comprising a light chain variable domain, said variable domain comprising (a) a set of three CDRs, in which said set of CDRs comprises SEQ ID NO:28, 30, or 32 or comprises amino acid sequences that are substantially identical to the amino acid sequences set forth in SEQ ID NO:28, 30, or 32, and (b) a set of four framework regions, in which said set of framework regions differs from the set of framework regions in murine monoclonal antibody HeFi-1, and in which said antibody immunospecifically binds CD30.\n\nIn certain embodiments, the anti-CD30 antibody comprises a gamma I constant region, (e.g., huCγ1, SwissProt accession number P01857, incorporated herein by reference in its entirety) and a human kappa constant region (e.g., huCκ, PID G185945, incorporated herein by reference in its entirety).\n\nThe present invention encompasses embodiments wherein a chimeric AC10 antibody comprises the heavy chain variable region set forth in SEQ ID NO:2, the light chain variable region set forth in SEQ ID NO:10, the human gamma I constant region set forth in SEQ ID NO:33 (or amino acids 1 to 329 of SEQ ID NO:33) and the human kappa constant region set forth in SEQ ID NO:34.\n\nAdditionally, the antibodies can also be described or specified in terms of their primary structures. In some embodiments, the variable regions of the anti-CD30 antibodies will have at least 80%, at least 85%, at least 90%, at least 95% and most preferably at least 98% identity (as calculated using methods known in the art and described herein) to the variable regions of murine AC10 or HeFi-1.\n\nExemplary anti-CD30 antibodies include functional derivatives or analogs of AC10 and HeFi-1. As used herein, the term “functional” in this context indicates that the functional derivate or analog of AC10 and HeFi-1 is capable of specific binding to CD30.\n\nAntibodies for use in the present invention include those that competitively inhibit binding of murine AC10 or HeFi-1 to CD30 as determined by any method known in the art for determining competitive binding. For example, the antibody can inhibit binding of AC10 or HeFi-1 to CD30 by at least 50%, at least 60%, at least 70%, at least 80%, at least 85%, at least 90%, or even at least 95%.\n\nG. Antibody-Drug Conjugates\n\nThe methods described herein encompass the use of antibody drug conjugates comprising an anti-CD30 antibody, covalently linked to MMAE through a vc-PAB linker. The antibody drug conjugates are delivered to the subject as a pharmaceutical composition.\n\nThe antibody-drug conjugates of the present invention have the following formula:\n\nor a pharmaceutically acceptable salt thereof;wherein:mAb is an anti-CD30 antibody,S is a sulfur atom of the antibodyA- is a Stretcher unit,p is from about 3 to about 5.\n\nThe drug loading is represented by p, the average number of drug molecules per antibody in a pharmaceutical composition. For example, if p is about 4, the average drug loading taking into account all of the antibody present in the pharmaceutical composition is about 4. P ranges from about 3 to about 5, more preferably from about 3.6 to about 4.4, even more preferably from about 3.8 to about 4.2. P can be about 3, about 4, or about 5. The average number of drugs per antibody in preparation of conjugation reactions may be characterized by conventional means such as mass spectroscopy, ELISA assay, and HPLC. The quantitative distribution of antibody-drug conjugates in terms of p may also be determined. In some instances, separation, purification, and characterization of homogeneous antibody-drug-conjugates where p is a certain value from antibody-drug-conjugates with other drug loadings may be achieved by means such as reverse phase HPLC or electrophoresis.\n\nThe Stretcher unit (A), is capable of linking an antibody unit to the valine-citrulline amino acid unit via a sulfhydryl group of the antibody. Sulfhydryl groups can be generated, for example, by reduction of the interchain disulfide bonds of an anti-CD30 antibody. For example, the Stretcher unit can be linked to the antibody via the sulfur atoms generated from reduction of the interchain disulfide bonds of the antibody. In some embodiments, the Stretcher units are linked to the antibody solely via the sulfur atoms generated from reduction of the interchain disulfide bonds of the antibody. In some embodiments, sulfhydryl groups can be generated by reaction of an amino group of a lysine moiety of an anti-CD30 antibody with 2-iminothiolane (Traut's reagent) or other sulfhydryl generating reagents. In certain embodiments, the anti-CD30 antibody is a recombinant antibody and is engineered to carry one or more lysines. In certain other embodiments, the recombinant anti-CD30 antibody is engineered to carry additional sulfhydryl groups, e.g., additional cysteines.\n\nThe synthesis and structure of MMAE is described in U.S. Pat. No. 6,884,869 incorporated by reference herein in its entirety and for all purposes. The synthesis and structure of exemplary Stretcher units and methods for making antibody drug conjugates are described in, for example, U.S. Publication Nos. 2006/0074008 and 2009/0010945 each of which is incorporated herein by reference in its entirety.\n\nRepresentative Stretcher units are depicted within the square brackets of Formulas IIIa and IIIb, wherein L-, —W—, —Y—, -D, w and y are as defined above, and R17is selected from —C1-C10alkylene-, —C1-C10alkenylene-, —C1-C10alkynylene-, -carbocyclo-, —O—(C1-C8alkylene)-, O—(C1-C8alkenylene)-, —O—(C1-C8alkynylene)-, -arylene-, —C1-C10alkylene-arylene-, —C2-C10alkenylene-arylene, —C2-C10alkynylene-arylene, -arylene-C1-C10alkylene-, -arylene-C2-C10alkenylene-, -arylene-C2-C10alkynylene-, —C1-C10alkylene-(carbocyclo)-, —C2-C10alkenylene-(carbocyclo)-, —C2-C10alkynylene-(carbocyclo)-, -(carbocyclo)-C1-C10alkylene-, -(carbocyclo)-C2-C10alkenylene-, -(carbocyclo)-C2-C10alkynylene, -heterocyclo-, —C1-C10alkylene-(heterocyclo)-, —C2-C10alkenylene-(heterocyclo)-, —C2-C10alkynylene-(heterocyclo)-, -(heterocyclo)-C1-C10alkylene-, -(heterocyclo)-C2-C10alkenylene-, -(heterocyclo)-C1-C10alkynylene-, or —(CH2CH2O)r—, or —(CH2CH2O)2—, and r is an integer ranging from 1-10, wherein said alkyl, alkenyl, alkynyl, alkylene, alkenylene, alkynyklene, aryl, carbocyle, carbocyclo, heterocyclo, and arylene radicals, whether alone or as part of another group, are optionally substituted.\n\n\n\nAn illustrative Stretcher unit is that of Formula IIIa wherein R17is —(CH2)5—:\n\n\n\nAnother illustrative Stretcher unit is that of Formula IIIa wherein R17is —(CH2CH2O)r—CH2—; and r is 2:\n\n\n\nAn illustrative Stretcher unit is that of Formula IIIa wherein R17is -arylene- or arylene-C1-C10alkylene-. In some embodiments, the aryl group is a phenyl group.\n\nStill another illustrative Stretcher unit is that of Formula IIIb wherein R17is —(CH2)5—:\n\n\n\nOne way that the Stretcher unit can be linked to the antibody unit is via a disulfide bond between a sulfur atom of the antibody unit and a sulfur atom of the Stretcher unit. In some embodiments, the sulfur atom is from an internal cysteine residue of the antibody. In some other embodiments, the sulfur atom is from a cysteine residue that has been engineered into the antibody.\n\nA representative Stretcher unit is depicted within the square brackets of Formula IV, wherein R17is as defined above.\n\n\n\nIt should be noted that throughout this application, the S moiety in the formula below refers to a sulfur atom of the antibody, unless otherwise indicated by context.\n\n\n\nIn a particularly preferred embodiment, of the present invention, the strectcher is of Formula IIIa and the antibody drug conjugate is a MC-vc-PAB-MMAE antibody drug conjugate as follows wherein p is from about 3 to about 5, preferably from 3.8 to 4.2. The S moiety refers to a sulfur atom of the antibody.\n\n\n\nIn a particularly preferred embodiment, the antibody is a chimeric or humanized AC10 antibody. In a particularly preferred embodiment, the S moiety is generated by reduction of the interchain disulfide bonds of the antibody.\n\nH. Pharmaceutical Compositions and Formulations\n\nVarious delivery systems can be used to administer antibody-drug conjugates. In certain preferred embodiments of the present invention, administration of the antibody-drug conjugate compound is by intravenous infusion. In some embodiments, administration is by a two hour intravenous infusion.\n\nThe antibody-drug conjugate compound can be administered as a pharmaceutical composition comprising one or more pharmaceutically compatible ingredients. For example, the pharmaceutical composition typically includes one or more pharmaceutically acceptable carriers, for example, water-based carriers (e.g., sterile liquids). Water is a more typical carrier when the pharmaceutical composition is administered intravenously.\n\nThe composition, if desired, can also contain, for example, saline salts, buffers, salts, nonionic detergents, and/or sugars. Examples of suitable pharmaceutical carriers are described in “Remington's Pharmaceutical Sciences” by E. W. Martin. The formulations correspond to the mode of administration.\n\nThe present invention provides, for example, pharmaceutical compositions comprising a therapeutically effective amount of the antibody-drug conjugate, a buffering agent, optionally a cryoprotectant, optionally a bulking agent, optionally a salt, and optionally a surfactant. Additional agents can be added to the composition. A single agent can serve multiple functions. For example, a sugar, such as trehalose, can act as both a cryoprotectant and a bulking agent. Any suitable pharmaceutically acceptable buffering agents, surfactants, cyroprotectants and bulking agents can be used in accordance with the present invention.\n\nIn addition to providing methods for treating a CD30-expressing cancer, the present invention provides antibody drug conjugate formulations including drug conjugate formulations that have undergone lyophilization, or other methods of protein preservation, as well as antibody drug formulations that have not undergone lyophilization.\n\nIn some embodiments, the antibody drug conjugate formulation comprises (i) about 1-25 mg/ml, preferably about 3 to about 10 mg/ml of an antibody-drug conjugate (e.g., an antibody-drug conjugate of formula I or a pharmaceutically acceptable salt thereof), (ii) about 5-50 mM, preferably about 10 mM to about 25 mM of a buffer selected from a citrate, phosphate, or histidine buffer or combinations thereof, preferably sodium citrate, potassium phosphate, histidine, histidine hydrochloride, or combinations thereof, (iii) about 3% to about 10% sucrose or trehalose or combinations thereof, (iv) optionally about 0.05 to 2 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80 or combinations thereof; and (v) water, wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nIn some embodiments, an antibody drug conjugate formulation will comprise about 1-25 mg/ml, preferably about 3 to about 10 mg/ml, even more preferably about 5 mg/ml of an antibody-drug conjugate, (ii) about 10 mM to about 25 mM of a buffer selected from sodium citrate, potassium phosphate, histidine, histidine hydrochloride or combinations thereof, (iii) about 3% to about 7% trehalose or sucrose or combinations thereof, optionally (iv) about 0.05 to about 1 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80, and (v) water, wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nIn some embodiments, an antibody drug conjugate formulation will comprise about 5 mg/ml of an antibody-drug conjugate, (ii) about 10 mM to about 25 mM of a buffer selected from sodium citrate, potassium phosphate, histidine, histidine hydrochloride or combinations thereof, (iii) about 3% to about 7% trehalose, optionally (iv) about 0.05 to about 1 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80, and (v) water, wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nThe antibody drug conjugate formulation can, for example, comprise (or consist essentially of) about 5 mg/ml of an antibody-drug conjugate, (ii) about 20 mM sodium citrate (iii) about 6% to about 7% trehalose (about 70 mg/ml), (iv) about 0.1 to 0.3 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80 (preferably polysorbate 80), and (v) water, wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nAny of the formulations described above can be stored in a liquid or frozen form and can be optionally subjected to a preservation process. In some embodiments, the formulations described above are lyophilized, i.e., they are subjected to lyophilization. In some embodiments, the formulations described above are subjected to a preservation process, for example, lyophilization, and are subsequently reconstituted with a suitable liquid, for example, water. By lyophilized it is meant that the composition has been freeze-dried under a vacuum. Lyophilization typically is accomplished by freezing a particular formulation such that the solutes are separated from the solvent(s). The solvent is then removed by sublimation (i.e., primary drying) and next by desorption (i.e., secondary drying).\n\nIn some embodiments, lyophilized formulations of the present invention comprise the antibody-drug conjugate, a buffering agent, optionally a cryoprotectant, optionally a bulking agent, optionally a salt, and optionally a surfactant as well as additional agents, wherein the composition has a pH of about 5.3-7 when reconstituted with water. In some embodiments, lyophilized formulations of the present invention, when reconstituted with water, comprise (i) about 1-25 mg/ml, preferably about 3 to about 10 mg/ml, of an antibody-drug conjugate (e.g., an antibody-drug conjugate of formula I or a pharmaceutically acceptable salt thereof), (ii) about 5-50 mM, preferably about 10 mM to about 25 mM of a buffer selected from a citrate, phosphate, or histidine buffer or combinations thereof, preferably sodium citrate, potassium phosphate, histidine, histidine hydrochloride, or combinations thereof, (iii) about 3% to about 10% sucrose or trehalose or combinations thereof, and (iv) optionally about 0.05 to 2 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80 or combinations thereof; wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nIn some embodiments, lyophilized formulations, when reconstituted with water, comprise (i) about 1-25 mg/ml, preferably about 3 to about 10 mg/ml, even more preferably about 5 mg/ml of an antibody-drug conjugate (ii) about 10 mM to about 25 mM of a buffer selected from sodium citrate, potassium phosphate, histidine, histidine hydrochloride or combinations thereof, (iii) about 3% to about 7% trehalose or sucrose or combinations thereof, and optionally (iv) about 0.05 to about 1 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80, wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nIn some embodiments, lyophilized formulations, when reconstituted with water, comprise about 5 mg/ml of an antibody-drug conjugate of the present invention, (ii) about 10 mM to about 25 mM of a buffer selected from sodium citrate, potassium phosphate, histidine, histidine hydrochloride, or combinations thereof, (iii) about 3% to about 7% trehalose, optionally (iv) about 0.05 to about 1 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80, wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nIn some embodiments, lyophilized formulations, when reconstituted with water, comprise (or consist essentially of) about 5 mg/ml of an antibody-drug conjugate of the present invention, (ii) about 20 mM sodium citrate (iii) about 6% to about 7% trehalose (about 70 mg/ml), (iv) about 0.1 to 0.3 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80 (preferably polysorbate 80), wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nThe formulations of the present invention can be used with the methods described herein or with other methods for treating disease. The antibody drug conjugate formulations may be further diluted before administration to a subject. In some embodiments, the formulations will be diluted with saline and held in IV bags or syringes before administration to a subject. Accordingly, in some embodiments, the methods for treating a CD30-expressing hematologic cancer in a subject will comprise administering to a subject in need thereof a weekly dose of a pharmaceutical composition comprising antibody-drug conjugates having formula I wherein the administered dose of antibody-drug conjugates is from about 0.8 mg/kg of the subject's body weight to about 1.8 mg/kg of the subject's body weight and the pharmaceutical composition is administered for at least three weeks and wherein the antibody drug conjugates, prior to administration to a subject, were present in a formulation comprising (i) about 1-25 mg/ml, preferably about 3 to about 10 mg/ml of the antibody-drug conjugate (ii) about 5-50 mM, preferably about 10 mM to about 25 mM of a buffer selected from sodium citrate, potassium phosphate, histidine, histidine hydrochloride, or combinations thereof, (iii) about 3% to about 10% sucrose or trehalose or combinations thereof, (iv) optionally about 0.05 to 2 mg/ml of a surfactant selected from polysorbate 20 or polysorbate 80 or combinations thereof; and (v) water, wherein the pH of the composition is from about 5.3 to about 7, preferably about 6.6.\n\nIn typical embodiments, the pharmaceutical composition is formulated in accordance with routine procedures as a pharmaceutical composition adapted for intravenous administration to human beings. Typically, compositions for intravenous administration are solutions in sterile isotonic aqueous buffer. Where necessary, the pharmaceutical can also include a solubilizing agent and a local anesthetic such as lignocaine to ease pain at the site of the injection. Generally, the ingredients are supplied either separately or mixed together in unit dosage form, for example, as a dry lyophilized powder or water free concentrate in a hermetically sealed container such as an ampoule or sachette indicating the quantity of active agent. Where the pharmaceutical is to be administered by infusion, it can be dispensed, for example, with an infusion bottle containing sterile pharmaceutical grade water or saline. Where the pharmaceutical is administered by injection, an ampoule of sterile water for injection or saline can be, for example, provided so that the ingredients can be mixed prior to administration.\n\nThe present invention also provides kits for the treatment of a CD30-expressing hematologic cancer. The kit can comprise (a) a container containing the antibody-drug conjugate. Such kits can further include, if desired, one or more of various conventional pharmaceutical kit components, such as, for example, containers with one or more pharmaceutically acceptable carriers, additional containers, etc., as will be readily apparent to those skilled in the art. Printed instructions, either as inserts or as labels, indicating quantities of the components to be administered, guidelines for administration, and/or guidelines for mixing the components, can also be included in the kit.\n\nThe present invention is not to be limited in scope by the specific embodiments described herein. Various modifications of the invention in addition to those described herein will become apparent to those skilled in the art from the foregoing description and accompanying figures. Such modifications are intended to fall within the scope of the appended claims.\n\nAll publications and patent documents cited above are hereby incorporated by reference in their entirety for all purposes to the same extent as if each were so individually denoted.\n\nThe invention is further described in the following examples, which are in not intended to limit the scope of the invention.\n\nEXAMPLES\n\nA multicenter, phase 1, weekly dosing, dose escalation study was conducted in pts with refractory or relapsed HL or systemic ALCL. The cAC10-MC-vc-PAB-MMAE antibody drug conjugate was administered weekly at doses of 0.4-1.4 mg/kg (2-hr IV infusions). Patients with standard disease or better after two 21-day cycles (6 doses) were eligible to continue treatment with the antibody drug conjugate. The weekly study design is provided inFIG. 1.\n\nResults: In 34 patients, median age was 34 yrs (range 13-82). Patients received a median of 5 prior therapies; 62% received an autologous SCT. MTD was exceeded at 1.4 mg/kg. Exposure to SGN-35 (AUC) increased relative to dose level. Multiple CRs were observed at higher doses (table); observed time to response for 1 mg/kg dose was approximately 8 wks.\n\nTABLE 2Best Clinical Response*Dose Group(mg/kg)NCRPRSDPD0.44——4+—0.63—1110.864++—1P11.064++11—1.25—13P11.432—1—Total27103223*Based on International Working Group Revised Response Criteria for Malignant Lymphoma (Cheson, 2007). 7 patients not evaluable (pending Cycle 2 restage).+represents 1 patient with ALCL;++represents 2 patient with ALCL;eachPrepresents 1 pediatric patient (12-17 years)\n\nTABLE 3Percent ResponseAllHLsALCLResponse RatePatientsPatientspatientsOverall Response48% (13/27)41% (9/22)80% (4/5)Rate (CR + PR)Complete Response37% (10/27)27% (6/22)80% (4/5)Tumor Reductions81% (22/27)\n\nThe cAC10-MC-vc-PAB-MMAE antibody drug conjugate was generally well tolerated in the 34 treated patients. There were no grade 5 events. The grade 4 events were neutropenia (1 subject), and hyperglycemia (1). The grade 3 events were neutropenia (3), diarrhea (1), paresthesia (1), vomiting (1), and leucopenia (1). The grade 2 or lower adverse events were nausea (9), fatigue (8), peripheral neuropathy (6), neutropenia (2), dizziness (4), hyperglycemia (3), and paresthesia (3). The dose limiting toxicity was at 1.4 mg/kg.\n\nSEQUENCE LISTINGSEQ ID NO: 1cag atc cag ctg cag cag tct gga cct gag gtg gtg aag cct ggg gcttca gtg aag ata tcc tgc aag gct tct ggc tac acc ttc act gac tactat ata acc tgg gtg aag cag aag cct gga cag gga ctt gag tgg attgga tgg att tat cct gga agc ggt aat act aag tac aat gag aag ttcaag ggc aag gcc aca ttg act gta gac aca tcc tcc agc aca gcc ttcatg cag ctc agc agc ctg aca tct gag gac act gct gtc tat ttc tgtgcg aac tat ggt aac tac tgg ttt gct tac tgg ggc caa ggg act caggtc act gtc tct gcaSEQ ID NO: 2Gln Ile Gln Leu Gln Gln Ser Gly Pro Glu Val Val Lys Pro Gly AlaSer Val Lys Ile Ser Cys Lys Ala Ser Gly Tyr Thr Phe Thr Asp TyrTyr Ile Thr Trp Val Lys Gln Lys Pro Gly Gln Gly Leu Glu Trp IleGly Trp Ile Tyr Pro Gly Ser Gly Asn Thr Lys Tyr Asn Glu Lys PheLys Gly Lys Ala Thr Leu Thr Val Asp Thr Ser Ser Ser Thr Ala PheMet Gln Leu Ser Ser Leu Thr Ser Glu Asp Thr Ala Val Tyr Phe CysAla Asn Tyr Gly Asn Tyr Trp Phe Ala Tyr Trp Gly Gln Gly Thr GlnVal Thr Val Ser AlaSEQ ID NO: 3gactactata taaccSEQ ID NO: 4Asp Tyr Tyr Ile ThrSEQ ID NO: 5tggatttatc ctggaagcgg taatactaag tacaatgaga agttcaaggg cSEQ ID NO: 6Trp Ile Tyr Pro Gly Ser Gly Asn Thr Lys Tyr Asn Glu Lys Phe LysGlySEQ ID NO: 7tatggtaact actggtttgc ttac 24SEQ ID NO: 8Tyr Gly Asn Tyr Trp Phe Ala TyrSEQ ID NO: 9gac att gtg ctg acc caa tct cca gct tct ttg gct gtg tct cta gggcag agg gcc acc atc tcc tgc aag gcc agc caa agt gtt gat ttt gatggt gat agt tat atg aac tgg tac caa cag aaa cca gga cag cca cccaaa gtc ctc atc tat gct gca tcc aat cta gaa tct ggg atc cca gccagg ttt agt ggc agt ggg tct ggg aca gac ttc acc ctc aac atc catcct gtg gag gag gag gat gct gca acc tat tac tgt cag caa agt aatgag gat ccg tgg acg ttc ggt gga ggc acc aag ctg gaa atc aaaSEQ ID NO: 10Asp Ile Val Leu Thr Gln Ser Pro Ala Ser Leu Ala Val Ser Leu GlyGln Arg Ala Thr Ile Ser Cys Lys Ala Ser Gln Ser Val Asp Phe AspGly Asp Ser Tyr Met Asn Trp Tyr Gln Gln Lys Pro Gly Gln Pro ProLys Val Leu Ile Tyr Ala Ala Ser Asn Leu Glu Ser Gly Ile Pro AlaArg Phe Ser Gly Ser Gly Ser Gly Thr Asp Phe Thr Leu Asn Ile HisPro Val Glu Glu Glu Asp Ala Ala Thr Tyr Tyr Cys Gln Gln Ser AsnGlu Asp Pro Trp Thr Phe Gly Gly Gly Thr Lys Leu Glu Ile LysSEQ ID NO: 11aaggccagcc aaagtgttga ttttgatggt gatagttata tgaacSEQ ID NO: 12Lys Ala Ser Gln Ser Val Asp Phe Asp Gly Asp Ser Tyr Met AsnSEQ ID NO: 13gctgcatcca atctagaatc tSEQ ID NO: 14Ala Ala Ser Asn Leu Glu SerSEQ ID NO: 15cagcaaagta atgaggatcc gtggacgSEQ ID NO: 16Gln Gln Ser Asn Glu Asp Pro Trp ThrSEQ ID NO: 17gag gtg aag ctg gtg gag tct gga gga ggc ttg gta cag cct ggg ggttct ctg aga ctc tcc tgt gca act tct ggg ttc acc ttc agt gat tactat atg aac tgg gtc cgc cag cct cca gga aag gct ctt gag tgg ttgggt ttt att aga aac aaa gct aat ggt tac aca aca gag ttc agt gcatct gtg atg ggt cgg ttc acc atc tcc aga gat gat tee caa agc atcctc tat ctt cag atg aac acc ctg aga gct gag gac agt gcc act tattac tgt gca aga gat ccc ccc tat ggt aac ccc cat tat tat gct atggac tac tgg ggt caa gga ace tea gtc acc gtc tcc tcaSEQ ID NO: 18Glu Val Lys Leu Val Glu Ser Gly Gly Gly Leu Val Gln Pro Gly GlySer Leu Arg Leu Ser Cys Ala Thr Ser Gly Phe Thr Phe Ser Asp TyrTyr Met Asn Trp Val Arg Gln Pro Pro Gly Lys Ala Leu Glu Trp LeuGly Phe Ile Arg Asn Lys Ala Asn Gly Tyr Thr Thr Glu Phe Ser AlaSer Val Met Gly Arg Phe Thr Ile Ser Arg Asp Asp Ser Gln Ser IleLeu Tyr Leu Gln Met Asn Thr Leu Arg Ala Glu Asp Ser Ala Thr TyrTyr Cys Ala Arg Asp Pro Pro Tyr Gly Asn Pro His Tyr Tyr Ala MetAsp Tyr Trp Gly Gln Gly Thr Ser Val Thr Val Ser SerSEQ ID NO: 19gattactata tgaacSEQ ID NO: 20Asp Tyr Tyr Met AsnSEQ ID NO: 21tttattagaa acaaagctaa tggttacaca acagagttca gtgcatctgt gatgggtSEQ ID NO: 22Phe Ile Arg Asn Lys Ala Asn Gly Tyr Thr Thr Glu Phe Ser Ala SerVal Met GlySEQ ID NO: 23gatcccccct atggtaaccc ccattattat gctatggact acSEQ ID NO: 24Asp Pro Pro Tyr Gly Asn Pro His Tyr Tyr Ala Met Asp TyrSEQ ID NO: 25gac att gtg ctg acc cag tct cct gct tcc tta gct gtt tct ctg gggcag agg gcc acc atc tca tgc agg gcc agc aaa agt gtc agt gca tctggc tat aat tat atg cac tgg tac caa cag aaa gca ggg cag cca cccaaa ctc ctc atc cat ctt gca tcc aac cta gaa tct ggg gtc cct gccagg ttc agt ggc agt ggg tct ggg aca gac ttc acc ctc aac atc catcct gtg gag gag gag gat gct tca acc tat tac tgt cag cac agt ggggag ctt cca ttc acg ttc ggc tcg ggg aca aag ttg gaa ata aaaSEQ ID NO: 26Asp Ile Val Leu Thr Gln Ser Pro Ala Ser Leu Ala Val Ser Leu GlyGln Arg Ala Thr Ile Ser Cys Arg Ala Ser Lys Ser Val Ser Ala SerGly Tyr Asn Tyr Met His Trp Tyr Gln Gln Lys Ala Gly Gln Pro ProLys Leu Leu Ile His Leu Ala Ser Asn Leu Glu Ser Gly Val Pro AlaArg Phe Ser Gly Ser Gly Ser Gly Thr Asp Phe Thr Leu Asn Ile HisPro Val Glu Glu Glu Asp Ala Ser Thr Tyr Tyr Cys Gln His Ser GlyGlu Leu Pro Phe Thr Phe Gly Ser Gly Thr Lys Leu Glu Ile LysSEQ ID NO: 27agggccagca aaagtgtcag tgcatctggc tataattata tgcacSEQ ID NO: 28Arg Ala Ser Lys Ser Val Ser Ala Ser Gly Tyr Asn Tyr Met HisSEQ ID NO: 29cttgcatcca acctagaatc tSEQ ID NO: 30Leu Ala Ser Asn Leu Glu SerSEQ ID NO: 31cagcacagtg gggagcttcc attcacgSEQ ID NO: 32Gln His Ser Gly Glu Leu Pro Phe ThrSEQ ID NO: 33Ala Ser Thr Lys Gly Pro Ser Val Phe Pro Leu Ala Pro Ser Ser LysSer Thr Ser Gly Gly Thr Ala Ala Leu Gly Cys Leu Val Lys Asp TyrPhe Pro Glu Pro Val Thr Val Ser Trp Asn Ser Gly Ala Leu Thr SerGly Val His Thr Phe Pro Ala Val Leu Gln Ser Ser Gly Leu Tyr SerLeu Ser Ser Val Val Thr Val Pro Ser Ser Ser Leu Gly Thr Gln ThrTyr Ile Cys Asn Val Asn His Lys Pro Ser Asn Thr Lys Val Asp LysLys Val Glu Pro Lys Ser Cys Asp Lys Thr His Thr Cys Pro Pro CysPro Ala Pro Glu Leu Leu Gly Gly Pro Ser Val Phe Leu Phe Pro ProLys Pro Lys Asp Thr Leu Met Ile Ser Arg Thr Pro Glu Val Thr CysVal Val Val Asp Val Ser His Glu Asp Pro Glu Val Lys Phe Asn TrpTyr Val Asp Gly Val Glu Val His Asn Ala Lys Thr Lys Pro Arg GluGlu Gln Tyr Asn Ser Thr Tyr Arg Val Val Ser Val Lou Thr Val LouHis Gln Asp Trp Leu Asn Gly Lys Glu Tyr Lys Cys Lys Val Ser AsnLys Ala Lou Pro Ala Pro Ile Glu Lys Thr Ile Ser Lys Ala Lys GlyGln Pro Arg Glu Pro Gln Val Tyr Thr Leu Pro Pro Ser Arg Asp GluLeu Thr Lys Asn Gln Val Ser Leu Thr Cys Leu Val Lys Gly Phe TyrPro Ser Asp Ile Ala Val Glu Trp Glu Ser Asn Gly Gln Pro Glu AsnAsn Tyr Lys Thr Thr Pro Pro Val Leu Asp Ser Asp Gly Ser Phe PheLeu Tyr Ser Lys Leu Thr Val Asp Lys Ser Arg Trp Gln Gln Gly AsnVal Phe Ser Cys Ser Val Met His Glu Ala Leu His Asn His Tyr ThrGln Lys Ser Leu Ser Leu Ser Pro Gly LysSEQ ID NO: 34Thr Val Ala Ala Pro Ser Val Phe Ile Phe Pro Pro Ser Asp Glu GlnLeu Lys Ser Gly Thr Ala Ser Val Val Cys Leu Leu Asn Asn Phe TyrPro Arg Glu Ala Lys Val Gln Trp Lys Val Asp Asn Ala Leu Gln SerGly Asn Ser Gln Glu Ser Val Thr Glu Gln Asp Ser Lys Asp Ser ThrTyr Ser Leu Ser Ser Thr Leu Thr Leu Ser Lys Ala Asp Tyr Glu LysHis Lys Val Tyr Ala Cys Glu Val Thr His Gln Gly Leu Ser Ser ProVal Thr Lys Ser Phe Asn Arg Gly Glu Cys\n\n",
            "length": 85747
        },
        {
            "patent_id": "10939746",
            "text": "BRIEF SUMMARY OF THE INVENTION\n\nThe rotatable hook assembly10is designed to meet all of the above criteria and more. It can comprise five or more primary components: a locking twist handle, a bag hook, a suspension thickness buffer, a lock in accessory, and a headrest storage hook. The locking twist handle functions in concert with the bag hook to form the main body of the rotatable hook assembly10. Together, they provide for a hook on which a plethora of shopping bag handles (or similar) can be gathered and hooked as well as a locking member which, once activated, secures the handles on the hook. The locking twist handle also comprises a convenient carry handle so that multiple bags can be carried simultaneously by the user in one hand without discomfort, pinching, and other common issues experienced when carrying multiple bags with a bare hand. The twist function allows the locking twist handle to twist open and closed making adding and/or removing bags from the bag hook a simple process. The bag hook can incorporate a first cart member to hang the device from the sidewall of a shopping cart or similar relatively thin, vertical surface. Additionally, a suspension thickness buffer helps the first cart member work for various thicknesses of vertical surfaces by adjusting to fill the void spaces between the first cart member's sides and the vertical surface placed therebetween. An additional lock in accessory can be incorporated into the rotatable hook assembly10as well. In one embodiment, this comprises a lock in cup holder that snaps into a groove in the bag hook's exterior and is locked in place by the closing of the twist handle. Optionally attaching to the twist handle can be a headrest storage hook which allows the rotatable hook assembly10to be attached to and hang from a vertical tube or support member of an automobile's headrest.\n\nDETAILED DESCRIPTION\n\nIt will be readily understood that the components of the present invention, as generally described with reference to the drawings herein, could be implemented in a wide variety of different configurations. Thus, the following more detailed description of the embodiments of the system and method of the present invention, is not intended to limit the scope of the invention, but is merely representative of various embodiments of the invention. Unless explicitly stated, the use of “or” means and/or, that is, this the nonexclusive meaning of the term “or”. Exemplary embodiments are described below and in the accompanying Figures. The following detailed description provides a review of the drawing Figures in order to provide a thorough understanding of, and an enabling description for, these embodiments. One having ordinary skill in the art will understand that in some cases well-known structures and functions have not been shown or described in detail to avoid unnecessarily obscuring the description of the embodiments.\n\nIn the following discussion, numerous specific details are set forth to provide a thorough understanding of the present disclosure. However, those skilled in the art will appreciate that embodiments may be practiced without such specific details. Furthermore, lists and/or examples are often provided and should be interpreted as exemplary only and in no way limiting embodiments to only those examples. Similarly, in this disclosure, language such as “could, should, may, might, must, have to, can, would, need to, is, is not”, etc. and all such similar language shall be considered interchangeable whenever possible such that the scope of the invention is not unduly limited. For example, a comment such as: “item X is used” can be interpreted to read “item X may be used”.\n\nFIGS. 1A to 1Hare various views of a first exemplary embodiment of a rotatable hook assembly10.FIG. 1Aintroduces a rear perspective view of a first exemplary embodiment of a rotatable hook assembly10with a number of sub-components depicted with reference numbers. The rotatable hook assembly10embodiment shown inFIG. 1Amay have a twist handle100which may be configured to be locked. The twist handle100may have an entrapment bay110to entrap and hold a locking portion202(seeFIG. 1A) of the bag hook200, thereby ensuring that any bag handles (not shown) that have been threaded through the bag hook200are trapped thereon and generally cannot be removed from an area, or aperture130(seeFIGS. 1A and 1B), defined above by the twist handle100and below by the bag hook200without unlocking the bag hook200from the twist handle100and purposefully removing a bag or by ripping open the handle of a bag so as to create an opening. The entrapment bay110may incorporate a lock flange120to define a locking area for locking the bag hook200into the entrapment bay110.\n\nExtending upwards from the entrapment bay110may be a grasp handle102. Grasp handle102may be configured with an arcuate member attached to a generally linear base member104. Grasp handle102may provide a grasping surface so that a user can wrap the user's fingers around the grasp handle102, in the opening106formed between grasp handle102and base member104, and carry the rotatable hook assembly10as well as all the bags suspended therefrom without the pinching and discomfort commonly experienced when attempting to carry multiple bags with a single hand of the user.\n\nReferring now toFIGS. 12A-12E, the bag hook200(FIG. 1A) may be rotationally coupled within a rotation bay140(see e.g.,FIG. 12B) to a rotatable member204extending from within the rotation bay140. In some preferred embodiments, rotatable member204may have a plurality of compressible prongs208a,208b, which may be inserted into the rotatable member receiver206of the bag hook200. Each of the plurality of compressible prongs208a,208bmay have an upper portion210and a lower head portion212(see, e.g.,FIGS. 12B and 12C).\n\nReferring briefly toFIGS. 7A-7G, the bag hook200is further described. The rotatable member receiver206mentioned above, may have a void member209which defines a void which is large enough to accommodate the plurality of compressible prongs208a,208bwhen the compressible prongs208a,208bare squeezed together, but the void may be not large enough to allow the lower head portion212of each of the compressible prongs208a,208bto be removed from the void defined by the void member209when the compressible prongs208a,208bare not compressed. In some preferred embodiments, rotatable member204may be a void that receives a fastener and an optional washer. SeeFIG. 7of the provisional application from which this application claims a benefit.\n\nIn some preferred embodiments, an accessory lock150(seeFIG. 1H), which may have one or more protrusions, may extend downwards from grasp handle102. Preferably located at the end of grasp handle102, the accessory lock150may be twisted clockwise or counterclockwise about the rotatable member204so as to lock an accessory, such as a cup holder170, via accessory mount430(see, e.g.,FIGS. 8A-8C) into the accessory mount receiver214(see, e.g.,FIGS. 7A, 7D and 7F) of bag hook200.\n\nWhen the twist handle100is twisted closed, the entrapment bay110may surround a portion of the bag hook200called the entrapment tooth216(see, e.g.,FIGS. 7A-7C. The locking portion202of bag hook200may extend rotationally into the entrapment bay110and may include an entrapment tooth216which may be coupled by a slot218defined within the lock flange120of twist handle100, as best shown inFIG. 6A. When the twist handle100is in the locked position, the entrapment tooth216rests within the slot218of the lock flange120. and the bag hook200may not be rotated substantially clockwise or substantially counterclockwise until a user unlocks the twist hangle100. by lifting the entrapment tooth216above and out of the slot218of the lock flange120, seeFIG. 5Aillustrating the entrapment tooth216within slot218andFIG. 5Billustrating the entrapment tooth216being lifted out of slot218so that the locking portion202may rotate out of the entrapment bay110.\n\nThe bag storage loop230may comprise the bulk of the bag hook200as it loops from the entrapment tooth210down and around back up to the rotation member240. The bag storage loop230can hold one or even a large number and variety of bag handles (not shown) threaded thereon. Once the twist handle100is in a twisted closed, or locked, position on the bag hook200, the bags may be locked onto the bag storage loop230and may not be removed without again twisting the twist handle100to gain access to the bags (not shown) on the bag storage loop230.\n\nThe bag storage loop230may terminate into the rotation member240. The rotation member240may be rotatably coupled with the rotation bay140and the two components may rotate relative to each other. Extending downwards from the other side of the rotation member240is the first cart member250, which may have a substantially flat portion254and may have a length greater than the average bar used in a grocery cart on which the first cart member may be placed in frictional contact.\n\nThe first cart member250may be between 0.1 inches and 500 inches in length, may be between 0.1 inch and 5 inches in length, may be between 1 inch and 2 inches in length, may be between 2 inches and 4 inches in length, may be between 4 inches and 6 inches in length, may be between 6 inches and 8 inches in length. The first cart member250extends downward from the rotation member240of the bag hook200and is opposed to the second cart member252, which may also extend downwards from the rotation member240of the bag hook200. As defined herein the second cart member252may be substantially the same length of the first cart member250, and the first cart member250and the second cart member252may be substantially parallel to each other, or in some preferred embodiments, the first cart member250may be slightly angled downwards at an angle between 0.1 degrees and 30 degrees from a horizontal line, such that a shopping cart bar may be wedged between the first cart member250and the second cart member252and one of the first cart member250and the second cart member252may flex to allow the shopping cart bar to be inserted and then may flex back to at or near the original position so as to grasp or hold the shopping cart bar. In some embodiments the length between the first car member250and the second cart member252is between 15 mm to 23 mm, wherein the difference between the first cart member250and the second cart member252at the top of the first cart member250compared to the bottom of the first cart member250is between 0.1 mm and 3 mm, and in some preferred embodiments is between 1 mm and 2 mm.\n\nWhen suspending the rotatable hook assembly10from shopping cart walls of varying types and thicknesses, a suspension thickness buffer300may be incorporated into the gap between the first cart member250and the second cart member252. The buffer300may be compressible or otherwise deformable so that it can fill any excess gap left after the rotatable hook assembly10is hung from a shopping cart wall, or sidewall302, seeFIGS. 2 and 3. Further, in the case of relatively thick sidewalls302, buffer300needs to squeeze down and provide more space for the sidewall302in the gap. In order to function in this way in some embodiments, the buffer300may comprise a plurality of thickness adjusters, which may be the pieces that define channels of the suspension buffer300also known as the suspension thickness buffer300.\n\nExtending from a side of the first cart member250opposite the gap in which the shopping cart sidewall302can be placed, may be an optional lock in accessory (only one embodiment illustrated, namely cup holder170). In the embodiment illustrated inFIG. 1, the lock in accessory is a cup holder170. Other lock in accessories are contemplated (such as a cell phone holder, shelf for a wallet, etc., not shown). Referring now toFIGS. 8A-8G, the cup holder170can utilize a top edge cup holding lip410that provides a support surface to strengthen the cup holder170and support a cup (not shown) placed therein. At the bottom edge may be a reduced diameter ring420which squeezes down the diameter and so allows the cup holder170to firmly grasp a cup (not shown) placed therein.\n\nReferring now toFIGS. 9A-G, a headrest storage hook500may be included with the rotatable hook assembly10. The headrest storage hook500may have a first arcuate portion502and a second arcuate portion504. The first arcuate portion502may be substantially perpendicular to the second arcuate portion504, with a substantially linear portion extending between the first502and second504arcuate portions. Storage hook500can be hooked around a headrest upright support member600(seeFIG. 4) or other object so that the rotatable hook assembly10can be used in the car (not shown) or anywhere a loop or hook receiver is located. Thus, storage hook500is not just limited to use on the sidewall302of a shopping cart350.\n\nFIG. 1Eillustrates a rear elevation view of an exemplary embodiment of a rotatable hook assembly10. In this view additional structural components of the headrest storage hook500are visible. For example, the substantially linear portion506is shown extending from the second arcuate portion504to the first arcuate portion502. The headrest hook extension500provides additional room between the first502and second504arcuate portions so that the rotatable hook assembly10can rest somewhat vertically against the back of a car seat650(FIG. 4). The suspension buffer300may be made from silicone, rubber, or any other flexible material.\n\nFIG. 1Fillustrates a top plan view of an exemplary embodiment of a rotatable hook assembly10. This Figure provides an additional perspective on the rotatable hook assembly10such that the headrest storage hook500and cup holder lock in accessory400can be more clearly discerned. Additionally, it should be apparent that the headrest storage hook500is removable from the twist handle100simply by snapping the headrest hook attachment520off from around the handle100.\n\nFIG. 1Gillustrates a bottom plan view of an exemplary embodiment of a rotatable hook assembly10which shows additional detail of the suspension thickness buffer300, including the thickness adjusters310which are also described as pieces which define vertical or horizontal channels.FIG. 1Hillustrates an exploded view of the various components of an exemplary embodiment of a rotatable hook assembly10. Here, the various major components have been exploded out from one another so that their various shapes and functions can be more clearly discerned. In some embodiments there are a shown a plurality of thickness adjusters310on the suspension thickness buffer300. Also, the accessory mount430on a lock in accessory, such as cup holder170, may comprise a substantially T-shaped elongated member413configured to removably mate with the accessory mount receiver214, which is a channel defined by a portion of the bag hook200and disposed within the channel, wherein the accessory lock of the twist handle may be configured to be in a locked position and thereby physically prevent the T-shaped elongated member disposed within the channel defined by the portion of the bag hook200from exiting the channel defined by the portion of the bag hook200. Stated another way, the T-shaped elongated member413of the accessory mount receiver214slides to engage an accessory, for example cup holder170, with the bag hook200.\n\nThe rotatable hook assembly10may have rotation hardware, which may include a mounting member, which may comprise a bolt, screw, or other type of fastener in the preferred embodiments (not shown). Similarly, a friction member such as a simple washer and the accepting member, such as a threaded metal lock-nut type cylinder that can be affixed inside the twist handle100may be used; the threaded metal lock-nut type cylinder may accept the mounting member therein. In other embodiments other types of rotation hardware are contemplated. Basically, any sufficiently sturdy way of rotatably mounting the rotation member240within the rotation bay140can be used.\n\nFIGS. 2A and 2Billustrate perspective views of a rotatable hook assembly10attached to bars352and354, respectively, of a shopping cart350. More particularly inFIG. 2B, bar354on the cart wall302is larger than bar352shown in cart350ofFIG. 2A. As shown inFIG. 2B, the suspension buffer300is positioned on the opposite end of the bag hook200from that shown inFIG. 2A. This is because of the thickness and larger size of bar354relative to bar352, thus the suspension buffer300is not used to hold the rotatable hook assembly10securely to the shopping card350.FIGS. 2A and 2Bfurther illustrate grasp handle102, bag hook200, suspension buffer300, shopping cart wall302and cup holder170.FIG. 3is another perspective view ofFIG. 2Ashown from the opposite side.\n\nFIGS. 13 to 21Fillustrate a second exemplary embodiment of a rotatable hook assembly700. Referring toFIG. 14B, an embodiment of push-button mechanism702is shown in cross-section. InFIG. 14B, the button shaft706is also depicted in cross-section. Referring toFIG. 20A, a button shaft706is shown. Button shaft706may have a button receptacle718, which may be substantially frustoconical-shaped, or round or thimble-shaped. Button shaft706may have a button support720, which may be substantially similar in shape to button receptacle718. In some preferred embodiments the button support720is also frustoconical-shaped and has a front flat surface located at the proximal end710and is coupled to the back of the lock button704(see, e.g.,FIG. 14B). Button shaft706may be rectangular in cross-section and may have substantially flat surfaces as shown inFIG. 20A. Shaft706may have one or more angled portions722. The distal end of shaft706may have an end piece shaped like a wedge714. the button shaft end piece, or wedge714may have an angled back portion715(see, e.g.,FIG. 20A) and a substantially vertically aligned front portion717(see, e.g.,20A). InFIG. 14Ba gap718is shown between the shaft706and the locking portion so that in the preferred embodiments the contour of the locking portion is such that it is in frictional contact with the button shaft wedge714and helped in place by the button shaft wedge714.\n\nFIGS. 21A to 21Fillustrate various views of an embodiment of a lock button704for use with the rotatable hook assembly700. Lock button704may include a centrally positioned, substantially circular or round void712that is large enough for button receptacle718to protrude from. Half of a button shell800is shown inFIG. 21E, 700due to being a cross-sectional view. Lock button702may have a first button support member804which may be frictionally coupled to the button support720and a second button support member806which may be fictionally coupled to the button receptacle718. The first button support member804may have a first rim810. The second button support member806may have a second rim812. The button shell800may have a front chamber defining member814which defines a chamber for the button receptacle718. The front chamber defining member814may be circular or substantially circular in shape. As shown best inFIG. 21A, lock button704may have an upper left face820, an upper right face822, a lower left face824and a lower right face826. When a user presses on one or more of the upper left face820, an upper right face822, a lower left face824and a lower right face826of the lock button704, the lock button704engages the button receptacle718or button support720at either the second rim812or first rim810, respectively, thereby pushing the button shaft706backwards such that the button shaft wedge714no longer locks the locking portion2202in place such that the locking portion2202is free to be rotated counterclockwise or clockwise such that the bag hook2000may be rotated open thereby allowing access to the bag storage loop2230.\n\nIn some embodiments, a user may press on the lock button704such that the button704exerts pressure on the button support720, and the button shaft706is moved backwards thereby disengaging the button shaft wedge714from the locking portion2202of the bag hook2000. In some embodiments, a coil, spring708, or spring member may be positioned in a chamber defined by the back portion of the lock button704within the twist handle100. The spring708may be useful for returning the lock button704to its starting position after the lock button704has been moved to the rightward direction (with respect toFIG. 14B). When the lock button704is returned to its original position by the decompression of the spring708, the original position being shown inFIG. 14B, then the button shaft wedge714may be brought closer or sufficiently close to the locking portion202in which the lock button704may be frictionally engaged with the button shaft wedge714. The spring708may be coupled around a portion of the main body of the button shaft706and may be partly coiled so as to be disposed inside of a portion of the lock button704.\n\nReferring toFIGS. 10A to 10H, the suspension buffer300may have one or more back band members906,908which may be used to rest upon one or more back band member ridges260,262of the bag hook200, seeFIGS. 7A to 7C. A distal back band member ridge262is depicted inFIG. 19A, as also a proximal back band member ridge260. However, some embodiments have a second distal back band member ridge (not shown in the drawings) located from the first distal back band member ridge262at a distance substantially equal to the distance between the two back band members906and908. Additionally, some embodiments have a second proximal back band member ridge (not shown in the drawings) located at a distance from the first proximal back band member ridge260at a distance substantially equal to the distance between the two back band members906and908.\n\nReferring again toFIGS. 10A to 10H, the suspension buffer300may have at least one substantially horizontal channel940and at least three substantially vertical channels950, see particularlyFIG. 10A. In the preferred embodiment shown inFIGS. 10A to 10Hthe suspension buffer300may have three vertical channels950. Referring toFIG. 10F, an inner portion960of the suspension buffer300may be contoured to be arcuate to fit the contour of the bag hook200upon which it rides. Referring back toFIG. 10D, the suspension buffer300may have one bottom end912that is narrower than the top end914. In some embodiments the top end914is narrower than the bottom end912(not shown in the drawings). In some embodiments four buffer ridge pieces917a-dof the suspension buffer300may extend out from the main surface of the suspension buffer so as to form a suspension buffer ridge916(seeFIG. 10Fwith four buffer ridge pieces917a-dthat extend).\n\nHowever, in some embodiments, see for exampleFIGS. 11A-11H, the suspension buffer ridge916is not present since the four buffer ridge pieces (917a,917b,917c, and917d) are not present.FIGS. 11A-Hillustrate an alternative embodiment of a suspension buffer300B, wherein suspension buffer ridge916has been removed.\n\nReferring toFIG. 10D, the embodiment of a suspension buffer300has a first end piece920, a second end piece922, a first central end piece924, a second central end piece926, a third central end piece928, a fourth central end piece930, a first side piece932, and a second side piece934. As shown inFIG. 10D, a first vertical channel950afor engaging a substantially vertical bar of a shopping cart350(seeFIGS. 2 and 3) may be defined by920,924,928,917b,917a, and933.\n\nIn the preferred embodiments a second vertical channel950bfor engaging a substantially vertical bar of a shopping cart350may be defined by922,926,930,917c,917b,928,924and920Preferred embodiments the width of the second vertical channel may be between 0.1 mm and 5 mm in width or may be between 0.1 mm and 1 mm, 1 mm and 2 mm, 2 mm and 3 mm, or 1.5 mm and 2 mm in width. In some embodiments the lengths of the vertical channels950a,950band950cmay be between 35 mm and 70 mm, 40 mm and 50 mm, 51 mm and 57 mm, 53 mm and 65 mm.\n\nIn the preferred embodiments a third vertical channel950cfor engaging a substantially vertical bar of a shopping cart350may be defined by934,917d,917c,930,926and922.\n\nIn the preferred embodiments, a substantially horizontal channel940may be defined by932,924,926,934,917d,930,928, and917aand may be between 0.1 mm and 70 mm, 5 mm and 20 mm, 10 mm and 20 mm, 25 mm and 35 mm, 31 mm and 38 mm in length. The depth of the horizontal channel940may be between 2 mm and 15 mm, 8 mm and 12 mm, or 9 mm and 11 mm. The width of the horizontal channel940may be between 2 mm and 15 mm, 4 mm and 7 mm, 5 mm and 8 mm, 5 mm and 7 mm, and the upper width of the horizontal channel may be greater than the lower width of the horizontal channel such that the upper width minus the lower width may range between 0.01 mm and 10 mm, 1 mm and 2 mm, 1 mm and 4 mm, 0.5 mm and 1.5 mm.\n\nThe above specification, examples and data provide a description of the structure and use of exemplary implementations of the described systems, articles of manufacture and methods. It is important to note that many implementations can be made without departing from the spirit and scope of the invention.\n\nInFIGS. 13 to 21F, an alternative embodiment of a rotatable hook assembly700is illustrated. The primary distinction over the embodiment of a rotatable hook assembly10is the introduction of a push-button mechanism702configured to replace the entrapment tooth216and slot218of rotatable hook assembly10. The push-button mechanism702may include a lock button704shown with a shaft706. The shaft706fits within the twist1000or grasp102handle adjacent to entrapment bay110. As best shown in the cross-sectional view of the push-button locking mechanism702ofFIG. 14B, the shaft706may be placed through a spring708. The proximal end710of the shaft706may protrude through a central void712of the lock button704. The shaft706may have an end piece714located at a distal end716of the shaft706which acts as a wedge. In operation, the proximal end710of the shaft706, when pushed by a user finger or thumb at lock button704, applies force against the proximal end710of the shaft706then the entire shaft706moves toward the distal end716, thereby pushing the end piece714out from within a channel2218formed in locking portion2202of bag hook2000(seeFIGS. 19A-190), thereby allowing locking portion2202to be rotated out of entrapment bay110. In some embodiments, the twist handle has a two pronged component that may be rotationally attached to the bag handle allowing the bag handle to be rotated clockwise or counterclockwise.\n\nFIGS. 18A-18Eillustrate various views of an embodiment of a twist handle1000according to the present invention. More particularly,FIG. 18Aillustrates a right-side view of an embodiment of a twist handle1000, according to the present invention.FIG. 18Billustrates a cross sectional view of the twist handle1000shown inFIG. 18A, the cross sectional cut as indicated inFIG. 18A, with the arrows showing the direction of the cross section view.FIG. 18Cillustrates the cross sectional view indicated inFIG. 18Dof the twist handle shown inFIGS. 18A and 18B. The twist handle ofFIG. 18Cdefines an opening for half of the button shell ofFIG. 15.FIG. 18Dillustrates a bottom view of the twist handle shown inFIGS. 18A-18C.FIG. 18Dfurther indicates the cross section view ofFIG. 18Cwith arrows showing the direction of the view.FIG. 18Eshows a perspective view of the twist handle section ofFIG. 18C. More particularly,FIGS. 18A-18Eillustrate grasp handle1102, linear base member1104, opening1062for receiving a lock button (not shown, but see,704,FIG. 14B), entrapment bay1110, rotation bay1140and rotatable member1204.\n\nFIG. 22shows a perspective view of a rotatable hook assembly10attached to a bar352of a shopping cart350wherein the bar352on the cart wall302is larger than in the cart350shown inFIG. 2. As shown inFIG. 22the suspension buffer300is positioned on the opposite end of the bag hook200from that shown inFIG. 2.FIG. 22further illustrates grasp handle102, bag hook200, suspension buffer300, shopping cart wall302and cup holder170.\n\n",
            "length": 28147
        },
        {
            "patent_id": "10938036",
            "text": "MODE FOR CARRYING OUT THE INVENTION\n\nHereinafter, the present invention will be described in detail. It will be understood that words or terms used in the specification and claims shall not be interpreted as the meaning defined in commonly used dictionaries. It will be further understood that the words or terms should be interpreted as having a meaning that is consistent with their meaning in the context of the relevant art and the technical idea of the invention, based on the principle that an inventor may properly define the meaning of the words or terms to best explain the invention.\n\nTypically, a method of preparing a positive electrode material including an alumina coating layer in the form of a film has been suggested, in which aluminum (Al) is oxidized using a solvent such as alkoxide, a predetermined amount of positive electrode material powder is put in the aluminum oxide solution and mixed, and a high-temperature sintering process is then performed in a temperature range of about 400° C. to about 600° C. However, in the case that the above-described wet mixing process is used, since the alumina coating layer in the form of a film is partially present as a boehmite phase having low crystallinity, coating performance may be low. Furthermore, the mobility of lithium ions is reduced due to the alumina coating layer present on the entire surface of the positive electrode material, and this may eventually cause capacity loss of a lithium secondary battery, reduction of battery lifetime, and an increase in the risk of accidents.\n\nAccording to an embodiment of the present invention, there is provided a method of preparing a positive electrode material for a lithium secondary battery including the steps of:\n\na first step of synthesizing a lithium transition metal oxide represented by Chemical Formula 1;\n\na second step of preparing lithium transition metal oxide powder by grinding the lithium transition metal oxide;\n\na third step of preparing a positive electrode material including an alumina coating layer by mixing as well as dispersing the lithium transition metal oxide powder in an alumina nanosol; and\n\na fourth step of drying the positive electrode material,\nLi(1+a)(Ni(1−a−b−c)MnbCoc)On[Chemical Formula 1]\n\nwhere 0≤a≤0.1, 0≤b≤1, 0<c≤1, and n is an integer of 2 or 4.\n\nIn this case, the alumina coating layer may include a γ-alumina phase in an amount of 95 wt % or more, preferably 99 wt % or more, and more preferably 100 wt % based on a total weight of the alumina coating layer.\n\nIn the method of the present invention, as a typical example, the lithium transition metal oxide may be Li[Ni0.5Mn1.5-xCox]O4(0≤x≤0.1), Li(Ni0.6Mn0.2Co0.2O2), Li(Ni0.8Mn0.1Co0.1O2), Li(Ni0.5Mn0.3Co0.2O2), Li(Ni1/3Mn1/3Co1/3O2), or LiCoO2.\n\nAlso, in addition to the lithium transition metal oxide represented by Chemical Formula 1, the lithium transition metal oxide may include lithium transition metal oxides for a positive electrode material typically used in the art, specifically, ternary lithium transition metal oxides such as LiNi1−x−y−zCoxM1yM2zO2(where M1 and M2 are each independently any one selected from the group consisting of aluminum (Al), nickel (Ni), cobalt (Co), iron (Fe), manganese (Mn), vanadium (V), chromium (Cr), titanium (Ti), tungsten (W), tantalum (Ta), magnesium (Mg), and molybdenum (Mo), and x, y, and z are each independently an atomic fraction of oxide-forming elements, in which 0≤x<0.5, 0≤y<0.5, 0≤z<0.5, and x+y+z≤1), and a single material selected from the group consisting of LiNiO2(LNO), LiMnO2(LMO), and LiMn2O4, or a mixture of two or more thereof. The first step of synthesizing a lithium transition metal oxide may be performed by mixing a lithium precursor and other transition metal precursors in a mixer and then sintering the mixture. In this case, the mixing and sintering may be performed in a temperature range of 1,000° C. to 1,100° C. for about 6 hours to about 12 hours, specifically, 10 hours.\n\nAlso, according to the method of the present invention, in the second step, lithium transition metal oxide powder having a particle diameter of about 10 μm to about 30 μm, specifically, 18 μm, may be prepared by grinding the lithium transition metal oxide obtained in the first step. In the case that the particle diameter of the lithium transition metal oxide powder obtained in the second step is greater than 30 μm, surface resistance may be increased. In the case in which the particle diameter is less than 10 μm, a specific surface area may be increased, and thus, this may eventually cause the reduction of initial capacity and cycles in a subsequent process.\n\nAlso, in the method of the present invention, the dispersion process of the lithium transition metal oxide powder in the third step may be performed using a stirring mixer at a speed of 300 rpm.\n\nIn the third step, the lithium transition metal oxide powder and the alumina nanosol may be mixed at a weight ratio of 1:80 to 1:100. In the case that the mixing ratio of the alumina nanosol is less than 80 as a weight ratio, since semi-dry mixing may be difficult to be performed, surface roughness of the alumina coating layer may increase and coating performance may degrade. In contrast, in the case in which the mixing ratio of the alumina nanosol is greater than 100 as a weight ratio, drying time may be increased and a coating process may take longer.\n\nAlso, in the third step, the lithium transition metal oxide powder may be directly dispersed in the alumina nanosol or may be dispersed after a lithium transition metal oxide powder solution is prepared by spaying the lithium transition metal oxide powder in an organic solvent.\n\nIn this case, it is desirable to use the organic solvent having a low boiling point (bp) so that the organic solvent may be easily evaporated at low temperature. Typical examples of the organic solvent may be 1-methoxy-2-propanol, ethyl alcohol, methyl alcohol, or isopropyl alcohol. The organic solvent may be used in an amount of 70 wt % to 99 wt % based on a total weight of the positive electrode material. In the case that the amount of the organic solvent is greater than 99 wt % or less than 70 wt %, coating uniformity may be reduced.\n\nIn the method of the present invention, the drying of the fourth step may be performed by performing low-temperature sintering in a temperature range of 130° C. to 350° C., specifically, 150° C. to 300° C.\n\nAlso, the method of the present invention may further include a fifth step of sintering the dried positive electrode material after the fourth step.\n\nIn this case, the sintering of the fifth step may be performed by performing high-temperature sintering in a temperature range of 400° C. to 800° C.\n\nThat is, according to the method of the present invention, a γ-alumina coating layer having low surface roughness and excellent coating performance may be formed on the surface of the positive electrode material by only performing the drying of the fourth step. Furthermore, a better coating effect of the γ-alumina coating layer may be obtained by further performing the high-temperature sintering after the drying.\n\nThe alumina nanosol used in the method of preparing a positive electrode material of the present invention may be prepared by the following method including:\n\nmixing alumina nanopowder and a solvent to prepare an alumina nanopowder suspension; and dispersing the suspension with a bead mill to prepare an alumina nanosol,\n\nwherein the alumina nanosol includes a γ-alumina phase in an amount of 99% of more.\n\nThe dispersion may be performed by dispersing the solvent and the alumina nanopowder with a bead mill using a spray-type nozzle rotating at a high speed.\n\nIn this case, the dispersion of the suspension with the bead mill may be performed at a rotation speed of the center of 3,000 rpm (line speed of 10 m/s) or more. Also, a slurry input rate during the dispersion may be 600 cc/min, and the dispersion may be performed using a composition including 10 L of a dispersion solution. In the case that the rotation speed is less than the above value, dispersibility may decrease, and in the case in which the slurry input rate is greater than the above value, beads may be discharged. A diameter of the beads in the bead mill may be in a range of 0.05 mm to 0.1 mm.\n\nIn the method of preparing an alumina nanosol, it is desirable to use the solvent having a low by so as to satisfy fast drying conditions during the preparation of the alumina nanosol. Typical examples of the solvent may be organic solvents such as 1-methoxy-2-propanol, ethyl alcohol, methyl alcohol, or isopropyl alcohol.\n\nThe solvent may be included in an amount of 70 wt % to 99 wt % based on a total amount of the alumina nanosol. In the case that the amount of the solvent is greater than 99 wt %, processing time may be increased, and in the case in which the amount of the solvent is less than 70 wt %, since the concentration of Al is excessively high, an unstable coating layer may be formed.\n\nThe alumina nanopowder is γ-alumina nanopowder having a particle diameter of 1 nm to 50 nm, wherein the surface charge may be positive (+) and the alumina nanopowder may have low crystallinity.\n\nAlso, the prepared alumina nanosol may include alumina nanopowder having a particle diameter of 1 nm to 20 nm.\n\nThus, in the present invention, a γ-alumina coating layer having low surface roughness, excellent coating performance, and excellent lithium ion mobility may be formed on a portion of the surface of the positive electrode material by employing a semi-dry coating method using a γ-alumina nanosol.\n\nThat is, with respect to a method of preparing a positive electrode material including an alumina coating layer using a typical dry mixing method, a phenomenon may not only occur in which dust is generated during a mixing process, but also a uniform coating layer may not be formed because the surface of the positive electrode material is damaged by the dry mixing process. Also, with respect to a method of forming an alumina coating layer using a typical wet mixing method in which the alumina coating layer is prepared by oxidizing aluminum using a solvent such as alkoxide, since the alumina coating layer is partially present as a boehmite phase having low crystallinity, the alumina coating layer having low coating performance may be formed on the entire surface of the positive electrode material. In addition, since uniform coating may be difficult, the absorption and release of lithium ions may be affected.\n\nIn contrast, with respect to the semi-dry coating method using a γ-alumina nanosol of the present invention, since γ-alumina particles have very fine pores, high porosity, and a large specific surface area, the semi-dry coating method may improve coating effect by improving adsorption performance of the coating layer. Thus, different from a conventional case, the coating layer may have physical properties of being closely attached to a portion of the surfaces of the positive electrode material particles even if high-temperature sintering is not performed. Also, the γ-alumina coating layer formed on the portion of the surface of the positive electrode material of the present invention does not cover the entire surface of the positive electrode material, but is formed on the portion of the surface. Thus, since the alumina coating layer does not affect the oxidation-reduction reaction of lithium ions, mobility of lithium ions may be excellent. Therefore, capacity of the lithium secondary battery may be increased and cycle life characteristics at high temperature and high voltage may be secured.\n\nIn particular, since the γ-alumina coating layer formed on the portion of the surface of the positive electrode material of the present invention does not include a boehmite phase, the γ-alumina coating layer may selectively react with HF generated due to moisture included in a non-aqueous electrolyte solution to act as a scavenger as illustrated in the following Reaction Formula. Thus, compared with a typical alumina coating layer including a boehmite phase, the γ-alumina coating layer may exhibit excellent battery performance in terms of life, cycle, and output characteristics at room temperature and high temperature by preventing the damage to the surface of the positive electrode material and significantly improving the degradation of battery characteristics due to the remaining moisture included in the electrolyte solution (see Reaction Formula below).\nAl2O3+HF→AlF3+H2O  [Reaction Formula]\n\nAlso, according to an embodiment of the present invention, there is provided a positive electrode material for a secondary battery including:\n\nlithium transition metal oxide particles represented by Chemical Formula 1; and\n\nan alumina coating layer formed on surfaces of the lithium transition metal oxide particles and including a γ-alumina phase in an amount of 95% or more,\n\nwherein a coverage of the alumina coating layer is in a range of 30% to 50% based on a total surface area of the lithium transition metal oxide particles,\nLi(1+a)(Ni(1−a−b−c)MnbCoc)On[Chemical Formula 1]\n\nwhere 0≤a≤0.1, 0≤b≤1, 0<c≤1, and n is an integer of 2 or 4.\n\nWith respect to the positive electrode material of the present invention, the alumina coating layer does not cover the entire surface of the positive electrode material, but is partially coated on 30% to 50% of the entire surface area of the lithium transition metal oxide particles. Thus, since the alumina coating layer does not affect the absorption and release of lithium ions, excellent mobility of lithium ions may be obtained. In the case that the coverage is greater than 50%, the absorption and release of lithium ions may be affected, and in the case in which the coverage is less than 30%, since the coating area may be small, the number of cycles may be reduced due to a side reaction with the electrolyte solution.\n\nIn this case, the alumina coating layer is not concentrated on one side of the surface of the positive electrode material, but the alumina coating layer in the form of particles may be uniformly distributed (coated) on a portion of the surface of the positive electrode material.\n\nAlso, the alumina coating layer formed on the portion of the surface of the positive electrode material may have a monolayer or multilayer structure. In this case, a thickness of the alumina coating layer may be appropriately adjusted within a range for increasing life characteristics and high-temperature storage characteristics of the battery and is not particularly limited. However, in the case that the alumina coating layer is excessively thick, since the alumina coating layer may affect capacity and output characteristics, the thickness of the alumina coating layer may be 30 nm or less, for example, 20 nm or less.\n\nFurthermore, the alumina coating layer formed on the portion of the surface of the positive electrode material may have a surface roughness (Ra) of 10 nm or less over the entire surface.\n\nIn the present invention, aluminum in the alumina coating layer may be included in an amount of 5 ppm to 100 ppm based on the total weight of the positive electrode material. In the case that the amount of the aluminum is less than 5 ppm, since the amount of the aluminum used in surface coating is small, there may be difficulty in sufficiently forming the coating layer on the surface of the positive electrode material. In contrast, in the case in which the amount of the aluminum is greater than 100 ppm, since a thick coating layer is formed to decrease the mobility of lithium ions, resistance may increase and output characteristics may be affected.\n\nAlso, according to an embodiment of the present invention,\n\nthere is provided a positive electrode for a second battery including a positive electrode material and selectively, at least one additive of a conductive agent, a binder, and a filler,\n\nwherein the positive electrode material includes lithium transition metal oxide particles represented by Chemical Formula 1; and\n\nan alumina coating layer formed on surfaces of the lithium transition metal oxide particles and including a γ-alumina phase in an amount of 95% or more, in which a coverage of the alumina coating layer is in a range of 30% to 50% based on a total surface area of the lithium transition metal oxide particles.\n\nIn this case, the conductive agent is commonly added in an amount of 1 wt % to 30 wt % based on a total weight of a mixture including the positive electrode material.\n\nAny conductive agent may be used without particular limitation so long as it has suitable conductivity without causing adverse chemical changes in the batteries. For example, the conductive agent may include a conductive material such as: graphite, carbon black, acetylene black, Ketjen black, channel black, furnace black, lamp black, thermal black, or conductive fibers such as carbon fibers and metal fibers; metal powder such as fluorocarbon powder, aluminum powder, and nickel powder; conductive whiskers such as zinc oxide whiskers and potassium titanate whiskers; conductive metal oxide such as titanium oxide; or polyphenylene derivatives. Specific examples of a commercial conductive agent may include acetylene black-based products (Chevron Chemical Company, Denka black (Denka Singapore Private Limited), or Gulf Oil Company, Ketjen black, ethylene carbonate (EC)-based products (Armak Company), Vulcan XC-72 (Cabot Company), and Super P (Timcal Graphite & Carbon).\n\nThe binder is a component that assists in the binding between an active material and the conductive agent and in the binding with a current collector. The binder is commonly added in an amount of 1 wt % to 30 wt % based on the total weight of the mixture including the positive electrode material. Examples of the binder may include polyvinylidene fluoride, polyvinyl alcohol, carboxymethylcellulose (CMC), starch, hydroxypropylcellulose, regenerated cellulose, polyvinylpyrrolidone, tetrafluoroethylene, polyethylene, polypropylene, an ethylene-propylene-diene terpolymer (EPDM), a sulfonated EPDM, a styrene butadiene rubber, a fluoro rubber, various copolymers, and the like.\n\nThe filler is a component selectively used to inhibit expansion of an electrode. There is no particular limit to the filler, so long as it does not cause adverse chemical changes in the batteries and is a fibrous material. Examples of the filler may include olefin-based polymers such as polyethylene and polypropylene; and fibrous materials such as glass fibers and carbon fibers.\n\nThe present invention provides a positive electrode for a secondary battery prepared by coating a positive electrode current collector with a slurry, which is prepared by mixing the positive electrode material with a solvent such as N-methyl-2-pyrrolidone (NMP), and then drying and rolling the coated positive electrode current collector.\n\nThe positive electrode current collector is generally fabricated to have a thickness of about 3 μm to about 500 μm. The positive electrode current collector is not particularly limited so long as it has high conductivity without causing adverse chemical changes in the batteries. The positive electrode current collector may be formed of, for example, stainless steel, aluminum, nickel, titanium, fired carbon, or aluminum or stainless steel that is surface-treated with one of carbon, nickel, titanium, silver, or the like. The collector may have an uneven surface to improve the bonding strength of a positive electrode active material and may have any of various shapes such as that of a film, a sheet, a foil, a net, a porous body, a foam body, a non-woven fabric body, and the like.\n\nAlso, according to an embodiment of the present invention,\n\nthere is provided a lithium secondary battery including a positive electrode, a negative electrode, a separator disposed between the positive electrode and the negative electrode, and an electrolyte solution,\n\nwherein the positive electrode includes a positive electrode material represented by Chemical Formula 2,\nLi(1+a)(Ni(1−a−b−c)MnbCocM′x)On[Chemical Formula 2]\n\nwhere 0≤a≤0.1, 0≤b≤1, 0<c≤1, 0<x≤1, n is an integer of 2 or 4, and M′ is Al2O3having a gamma phase.\n\nIn this case, the lithium secondary battery may have an HF content of 900 ppm or less based on a total weight of the electrolyte solution after an activation process and initial charge and discharge.\n\nAlso, the lithium secondary battery may have an HF content of 100 ppm or less based on the total weight of the electrolyte solution after 10 charge and discharge cycles.\n\nIn the lithium secondary battery of the present invention, the γ-alumina coating layer coated on the surface of the positive electrode material may selectively react with HF generated due to moisture included in the non-aqueous electrolyte solution to act as a scavenger. For example, after a predetermined amount (5,000 ppm) of moisture is added to the electrolyte solution of the lithium secondary battery and positive electrode powders before and after Al2O3coating were added, if the HF content is measured after one week, the HF content is 5,000 ppm with respect to the secondary battery using the positive electrode powder on which a coating layer is not formed, but it may be understood that the HF content is decreased to less than 1,000 ppm, particularly, 900 ppm or less with respect to the secondary battery using the positive electrode powder coated with Al2O3.\n\nIn the lithium secondary battery, the negative electrode is prepared by coating a negative electrode current collector with a negative electrode material including a negative electrode active material and then drying the negative electrode current collector. If necessary, components, such as a conductive agent, a binder, and a filler, may be included in the negative electrode material.\n\nExamples of the negative electrode active material may include carbon and graphite materials such as natural graphite, artificial graphite, expanded graphite, carbon fibers, hard carbon, carbon black, carbon nanotubes, fullerenes and activated carbon; metals, such as Al, silicon (Si), tin (Sn), silver (Ag), bismuth (Bi), Mg, zinc (Zn), indium (In), germanium (Ge), lead (Pb), palladium (Pd), platinum (Pt), and Ti, which are alloyable with lithium, and compounds containing these elements; composites of carbon and graphite materials with a metal and a compound thereof; and lithium-containing nitrides. Among them, a carbon-based active material, a silicon-based active material, a tin-based active material or a silicon-carbon-based active material may be used, and these materials may be used alone or in combination of two or more thereof.\n\nThe negative electrode current collector is generally fabricated to have a thickness of about 3 μm to about 500 μm. The negative electrode current collector is not particularly limited so long as it has conductivity without causing adverse chemical changes in the batteries. The negative electrode current collector may be formed of, for example, copper, stainless steel, aluminum, nickel, titanium, fired carbon, copper or stainless steel that is surface-treated with one of carbon, nickel, titanium, silver, or the like, an aluminum-cadmium alloy, or the like. Also, like the positive electrode current collector, the negative electrode current collector may have a fine roughness surface to improve bonding strength with a negative electrode active material. The negative electrode current collector may have various shapes such as a film, a sheet, a foil, a net, a porous body, a foam body, a non-woven fabric body, and the like.\n\nThe separator is disposed between the positive electrode and the negative electrode, and a thin insulating film having high ion permeability and mechanical strength is used. The separator typically has a pore diameter of 0.01 μm to 10 μm and a thickness of 5 μm to 300 μm. For example, sheets or non-woven fabrics formed of an olefin-based polymer such as polypropylene; glass fibers or polyethylene, which have chemical resistance and hydrophobicity, are used as the separator. When a solid electrolyte, such as a polymer, is used as an electrolyte, the solid electrolyte may also serve as the separator.\n\nThe lithium salt-containing non-aqueous electrolyte solution is formed of an electrolyte and a lithium salt, and an organic solid electrolyte and an inorganic solid electrolyte in addition to a non-aqueous organic solvent may be used as the electrolyte solution.\n\nExamples of the non-aqueous organic solvent may include aprotic organic solvents, such as N-methyl-2-pyrrolidone, propylene carbonate, ethylene carbonate, butylene carbonate, dimethyl carbonate, diethyl carbonate, γ-butyrolactone, 1,2-dimethoxy ethane, tetrahydroxy franc, 2-methyl tetrahydrofuran, dimethyl sulfoxide, 1,3-dioxolane, formamide, diemthylformamide, dioxolane, acetonitrile, nitromethane, methyl formate, methyl acetate, phosphate triester, trimethoxy methane, a dioxolane derivative, sulfolane, methyl sulfolane, 1,3-dimethyl-2-imidazolidinone, a propylene carbonate derivative, a tetrahydrofuran derivative, ether, methyl propionate, and ethyl propionate.\n\nExamples of the organic solid electrolyte may include a polyethylene derivative, a polyethylene oxide derivative, a polypropylene oxide derivative, a phosphate ester polymer, poly agitation lysine, polyester sulfide, polyvinyl alcohol, polyvinylidene fluoride, and a polymer containing an ionic dissociation group.\n\nExamples of the inorganic solid electrolyte may include nitrides, halides, and sulfates of lithium (Li), such as Li3N, LiI, Li5NI2, Li3N—LiI—LiOH, LiSiO4, LiSiO4—LiI—LiOH, Li2SiS3, Li4SiO4, Li4SiO4—LiI—LiOH, and Li3PO4—Li2S—SiS2.\n\nThe lithium salt is a material that is readily soluble in the non-aqueous electrolyte and for example, may include LiCl, LiBr, LiI, LiClO4, LiBF4, LiB10Cl10, LiPF6, LiCF3SO3, LiCF3CO2, LiAsF6, LiSbF6, LiAlCl4, CH3SO3Li, CF3SO3Li, (CF3SO2)2NLi, chloroborane lithium, lower aliphatic carboxylic acid lithium, lithium tetraphenyl borate, and imide.\n\nAlso, in order to improve charge/discharge characteristics and flame retardancy, pyridine, triethylphosphite, triethanolamine, cyclic ether, ethylenediamine, n-glyme, hexaphosphoric triamide, a nitrobenzene derivative, sulfur, a quinone imine dye, N-substituted oxazolidinone, N,N-substituted imidazolidine, ethylene glycol dialkyl ether, an ammonium salt, pyrrole, 2-methoxy ethanol, and aluminum trichloride, for example, may be added to the electrolyte solution. In some cases, halogen-containing solvents, such as carbon tetrachloride and ethylene trifluoride, may be further included in order to impart incombustibility, carbon dioxide gas may be further included in order to improve high-temperature storage characteristics, and fluoro-ethylene carbonate (FEC) and propene sultone (PRS) may be further included.\n\nThe secondary battery may not only be used in a battery cell used as a power source of a small device, but may also be used as a unit cell in a medium and large sized battery module including a plurality of battery cells which is used as a power source of a medium and large sized device requiring high-temperature stability, cycle life characteristics, and high rate capability.\n\nPreferred examples of the medium and large sized device may be a power tool; an electric vehicle (EV) including an electric car, a hybrid electric vehicle (HEV), and a plug-in hybrid electric vehicle (PHEV); an electric two-wheeled vehicle including an E-bike and an E-scooter; an electric golf cart; and a power storage device, which move by the power of an electric motor, but the medium and large sized device is not limited thereto.\n\nAlthough the invention has been shown and described with reference to exemplary embodiments thereof, it will be understood that various modifications may be made therein without departing from the spirit and scope of the invention. Therefore, the scope of the present invention should not be limited to the above-described embodiments but should be determined by not only the appended claims but also the equivalents thereof.\n\nEXAMPLES\n\nPreparation Example 1: Preparation of Alumina Nanosol\n\n1,000 g of γ-alumina powder (Alu-C, size D50) and 9,000 g of 1-methoxy-2-propanol were mixed and then dispersed with a vertical bead mill (Apex mill) to prepare a γ-alumina nanosol including γ-alumina nanopowder having a particle diameter of 10 nm. The alumina nanosol was dried and X-ray diffraction (XRD) measurement was performed (seeFIG. 1).\n\nExample 1: Preparation of Positive Electrode Material Containing γ-Alumina Coating Layer (Low-Temperature Drying)\n\n48.25 g of Li2CO3and 101.75 g of Co3O4were put in a powder mixer and mixed for 5 minutes. Then, sintering was performed at a temperature of 1,000° C. for 10 hours in a sintering furnace. A cake obtained after the sintering was put in a grinder and ground to a diameter of 18 μm to prepare a lithium transition metal oxide (LiCoO2).\n\nNext, the alumina nanosol of Preparation Example 1 and the lithium transition metal oxide were put in a multi-purpose device (MP5) and mixed to prepare a positive electrode material including a γ-alumina coating layer. Then, the positive electrode material was dried at a temperature of 200° C. for 10 hours.FIG. 2is an electron microscope (SEM) image of the surface of the prepared positive electrode material.\n\nExample 2: Preparation of Positive Electrode Material Containing γ-Alumina Coating Layer (High-Temperature Sintering)\n\nA positive electrode material was prepared in the same manner as in Example 1 except that the positive electrode material prepared in Example 1 was further sintered at a temperature of about 500° C. for 10 hours.FIG. 3is an electron microscope (SEM) image of the surface of the prepared positive electrode material.\n\nExample 3: Secondary Battery Preparation\n\nThe positive electrode material having an alumina coating layer formed thereon prepared in Example 1, a conductive agent, and a binder were mixed at a weight ratio of 96:2:2 to prepare a positive electrode slurry. An Al foil was coated with the slurry and then rolled and dried to prepare a positive electrode for a secondary battery. The positive electrode was punched into a coin shape and a coin-type secondary battery was then prepared.\n\nLi metal was used as a negative electrode active material of the secondary battery, and an electrolyte solution was used in which 1 M LiPF6was dissolved in a carbonate electrolyte solution.\n\nExample 4: Secondary Battery Preparation\n\nThe positive electrode material having an alumina coating layer formed thereon prepared in Example 2, a conductive agent, and a binder were mixed at a weight ratio of 96:2:2 to prepare a positive electrode slurry. An Al foil was coated with the slurry and then rolled and dried to prepare a positive electrode for a secondary battery. The positive electrode was punched into a coin shape and a coin-type secondary battery was then prepared.\n\nLi metal was used as a negative electrode active material of the secondary battery, and an electrolyte solution was used in which 1 M LiPF6was dissolved in a carbonate electrolyte solution.\n\nComparative Example 1: Positive Electrode Material Having Alumina Coating Layer Including Boehmite Phase Formed Thereon (Low-Temperature Sintering)\n\nAn alumina solution was prepared by oxidizing aluminum (Al) using a solvent such as alkoxide, and a positive electrode material having an alumina coating layer formed thereon was then prepared by mixing as well as dispersing a predetermined amount of positive electrode material powder (LiCoO2) in the alumina solution.\n\nNext, the prepared positive electrode powder was dried at a temperature of 200° C. for 10 hours.FIG. 4is an electron microscope (SEM) image of the surface of the prepared positive electrode material.\n\nComparative Example 2: Preparation of Positive Electrode Material Having Alumina Coating Layer Including Boehmite Phase Formed Thereon (High-Temperature Sintering)\n\nA positive electrode material was prepared in the same manner as in Comparative Example 1 except that the positive electrode material prepared in Comparative Example 1 was further sintered at a temperature of about 500° C. for 10 hours.FIG. 5is an electron microscope (SEM) image of the surface of the prepared positive electrode material.\n\nComparative Example 3: Secondary Battery Preparation\n\nThe positive electrode material having an alumina coating layer formed thereon prepared in Comparative Example 1, a conductive agent, and a binder were mixed at a weight ratio of 96:2:2 to prepare a positive electrode slurry. An Al foil was coated with the slurry and then rolled and dried to prepare a positive electrode for a secondary battery. The positive electrode was punched into a coin shape and a coin-type secondary battery was then prepared. Li metal was used as a negative electrode active material, and an electrolyte solution was used in which 1 M LiPF6was dissolved in a carbonate electrolyte solution.\n\nComparative Example 4: Secondary Battery Preparation\n\nThe positive electrode material having an alumina coating layer formed thereon prepared in Comparative Example 2, a conductive agent, and a binder were mixed at a weight ratio of 96:2:2 to prepare a positive electrode slurry. An Al foil was coated with the slurry and then rolled and dried to prepare a positive electrode for a secondary battery. The positive electrode was punched into a coin shape and a coin-type secondary battery was then prepared. Li metal was used as a negative electrode active material, and an electrolyte solution was used in which 1 M LiPF6was dissolved in a carbonate electrolyte solution.\n\nExperimental Example 1. Surface Morphology Observation\n\nA surface of each positive electrode material prepared in Examples 1 and 2 and Comparative Examples 1 and 2 was observed with an electron microscope to measure a coverage of each alumina coating layer.\n\nAccording to the measurement results, it may be confirmed that alumina coating layers having a coverage of about 30% to about 50% were respectively formed on the surfaces of the positive electrode materials of Examples 1 and 2, but alumina coating layers in film shapes were respectively formed on the entire surfaces of the positive electrode materials of Comparative Examples 1 and 2.\n\nIn this case, surface roughness (Ra) of the surfaces of the positive electrode materials of Examples 1 and 2 was 10 nm (seeFIGS. 2 and 3), but since the positive electrode materials of Comparative Examples 1 and 2 subjected to low-temperature sintering had poor dispersibility so that large particles were present, it may be confirmed that coating performance was low, for example, surface roughness (Ra) of the surfaces of the positive electrode materials of Comparative Examples 1 and 2 was 100 nm (seeFIGS. 4 and 5).\n\nExperimental Example 2. Comparison of Scavenger Effect\n\nThe electrolyte solutions of the secondary batteries of Examples 3 and 4 and Comparative Examples 3 and 4 were exposed to the outside air to generate HF so that lithium secondary batteries were prepared in which an HF content was 10,500 ppm (amount of moisture of 10,000 ppm) based on the total weight of the electrolyte solution. Subsequently, the positive electrode materials prepared in Examples 1 and 2 were added to 100 g of each electrolyte solution in which the amount of moisture was maintained at a level of 10,000 ppm, and the HF content (concentration) remained in the electrolyte was measured after a predetermined time has passed. The results thereof are presented in Table 1.\n\nIn this case, the HF content was measured using a Metrohm 848/801 instrument, a pH level was identified by titrating an acid (HF) in the electrolyte solution with a basic solution, and thus, the concentration of HF may be evaluated.\n\nTABLE 1HF content ininitialHF contentHF contentHF contentelectrolyteafter storingafter storingafter storingHF contentsolution1 week2 weeks3 weeksExample 310,500 ppm890 ppm770 ppm650 ppmExample 410,500 ppm850 ppm760 ppm666 ppmComparative10,500 ppm8,010 ppm7,500 ppm7,000 ppmExample 3Comparative10,500 ppm5,100 ppm4,510 ppm4,320 ppmExample 4\n\nAs illustrated in Table 1, with respect to the secondary batteries of Comparative Examples 3 and 4, it may be understood that the reduction rate of the HF content in the electrolyte solution significantly decreased with time in comparison to that of Examples 3 and 4. As a result, it may be confirmed that the γ-alumina coating layer formed on the portion of the positive electrode material of the present invention acted as an HF scavenger.\n\nExperimental Example 3\n\nCycle life tests were performed on the secondary batteries prepared in Example 4 and Comparative Example 4, and the results thereof are presented inFIGS. 6 and 7. Specifically, capacity change test was performed for 50 cycles at 0.5 C/1 C and a voltage of 4.45 V at 45° C.\n\nReferring toFIGS. 6 and 7, with respect to the secondary battery of Example 4 based on 50 cycles, it may be confirmed that the reduction of capacity and cycle characteristics was improved in comparison to the secondary battery of Comparative Example 4. That is, it may be confirmed that the secondary batteries of the present invention did not have a big difference in the changes of capacity according to cycle, but, with respect to the secondary batteries of the comparative examples, cycle life characteristics were significantly reduced because the positive electrode material included insufficiently acted as an HF scavenger.\n\n",
            "length": 37619
        }
    ]
}