{
    "table_name": "WORLD_BANK_HEALTH_POPULATION.SERIES_SUMMARY",
    "table_fullname": "COVID19_OPEN_WORLD_BANK.WORLD_BANK_HEALTH_POPULATION.SERIES_SUMMARY",
    "column_names": [
        "related_indicators",
        "base_period",
        "series_code",
        "other_notes",
        "aggregation_method",
        "unit_of_measure",
        "periodicity",
        "general_comments",
        "topic",
        "short_definition",
        "long_definition",
        "source",
        "indicator_name",
        "limitations_and_exceptions",
        "notes_from_original_source",
        "development_relevance",
        "related_source_links",
        "license_type",
        "statistical_concept_and_methodology",
        "other_web_links"
    ],
    "column_types": [
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "In general indicator that are of interest and related to the specific series.",
        "Base period is the period of time for which data is used as the base of an index number or other ratio have been collected. This period is frequently one of a year but it may be as short as one day or as long as the average of a group of years.",
        "A number or a sequence of related statistical units arranged or occurring in temporal spatial or other order or succession. WDI carries mostly time series.",
        "A brief record of facts topics or thoughts written down and used to contextualize the series definition values and other characteristics.",
        "Aggregation methods are types of calculations used to group attribute values into a metric for each dimension value. For example for each region one may retrieve the total value of country entries (the sum of the series value for countries belonging to the region).",
        "A quantity used as a standard of measurement. Example: Units of time are second minute hour day week month year and decade.",
        "Applies to series recurring at regular intervals. Most of the time this term denotes that interval of recurrence.",
        "Other notes regarding the series which do not appear in Development relevance or Limitations or exceptions",
        "The matter dealt with in the context discourse or subject related to the series.",
        "Short statement of the exact meaning of a series.",
        "Extended statement of the exact meaning of a series.",
        "A place person or organization from which the series comes or can be obtained.",
        "Given name of a series.",
        "A limiting rule or circumstance that applies to usage of the series such as the scope of the survey collecting the data or missing years and countries.  It should also note when data are imputed or estimated",
        "A brief record of facts topics or thoughts written down and used to contextualize the series definition values and other characteristics.",
        "The relevance of a series refers to how the indicator’s data may be used to monitor particular aspects of development goals and programs for example the Sustainable Development Goals. The indicator may conclusively measure progress towards a particular objective or may act as a proxy or interpretation of a development aim.",
        "Internet address of related source page tool or knowledge base.",
        "Explains the rights conferred and restrictions imposed by the owner to the users of a series",
        "The abstract idea general statistical notions or a system of methods used to generate the series.",
        "Internet addresses of related pages tools or knowledge bases."
    ],
    "sample_rows": [
        {
            "series_code": "HD.HCI.OVRL.MA",
            "topic": "Public Sector: Policy & institutions",
            "indicator_name": "Human capital index (HCI), male (scale 0-1)",
            "short_definition": null,
            "long_definition": "The HCI calculates the contributions of health and education to worker productivity. The final index score ranges from zero to one and measures the productivity as a future worker of child born today relative to the benchmark of full health and complete education.",
            "unit_of_measure": null,
            "periodicity": null,
            "base_period": null,
            "other_notes": null,
            "aggregation_method": null,
            "limitations_and_exceptions": null,
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "World Bank staff calculations based on the methodology described in World Bank (2018). https://openknowledge.worldbank.org/handle/10986/30498",
            "statistical_concept_and_methodology": null,
            "development_relevance": null,
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        },
        {
            "series_code": "HD.HCI.OVRL.UB.FE",
            "topic": "Public Sector: Policy & institutions",
            "indicator_name": "Human capital index (HCI), female, upper bound (scale 0-1)",
            "short_definition": null,
            "long_definition": "The HCI upper bound reflects uncertainty in the measurement of the components and the overall index. It is obtained by recalculating the HCI using estimates of the upper bounds of each of the components of the HCI. The range between the upper and lower bound is the uncertainty interval. While the uncertainty intervals constructed here do not have a rigorous statistical interpretation, a rule of thumb is that if for two countries they overlap substantially, the differences between their HCI values are not likely to be practically meaningful.",
            "unit_of_measure": null,
            "periodicity": null,
            "base_period": null,
            "other_notes": null,
            "aggregation_method": null,
            "limitations_and_exceptions": null,
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "World Bank staff calculations based on the methodology described in World Bank (2018). https://openknowledge.worldbank.org/handle/10986/30498",
            "statistical_concept_and_methodology": null,
            "development_relevance": null,
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        },
        {
            "series_code": "HD.HCI.OVRL.UB.MA",
            "topic": "Public Sector: Policy & institutions",
            "indicator_name": "Human capital index (HCI), male, upper bound (scale 0-1)",
            "short_definition": null,
            "long_definition": "The HCI upper bound reflects uncertainty in the measurement of the components and the overall index. It is obtained by recalculating the HCI using estimates of the upper bounds of each of the components of the HCI. The range between the upper and lower bound is the uncertainty interval. While the uncertainty intervals constructed here do not have a rigorous statistical interpretation, a rule of thumb is that if for two countries they overlap substantially, the differences between their HCI values are not likely to be practically meaningful.",
            "unit_of_measure": null,
            "periodicity": null,
            "base_period": null,
            "other_notes": null,
            "aggregation_method": null,
            "limitations_and_exceptions": null,
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "World Bank staff calculations based on the methodology described in World Bank (2018). https://openknowledge.worldbank.org/handle/10986/30498",
            "statistical_concept_and_methodology": null,
            "development_relevance": null,
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        },
        {
            "series_code": "NY.GNP.PCAP.CD",
            "topic": "Background: Economy",
            "indicator_name": "GNI per capita, Atlas method (current US$)",
            "short_definition": null,
            "long_definition": "GNI per capita (formerly GNP per capita) is the gross national income, converted to U.S. dollars using the World Bank Atlas method, divided by the midyear population. GNI is the sum of value added by all resident producers plus any product taxes (less subsidies) not included in the valuation of output plus net receipts of primary income (compensation of employees and property income) from abroad. GNI, calculated in national currency, is usually converted to U.S. dollars at official exchange rates for comparisons across economies, although an alternative rate is used when the official exchange rate is judged to diverge by an exceptionally large margin from the rate actually applied in international transactions. To smooth fluctuations in prices and exchange rates, a special Atlas method of conversion is used by the World Bank. This applies a conversion factor that averages the exchange rate for a given year and the two preceding years, adjusted for differences in rates of inflation between the country, and through 2000, the G-5 countries (France, Germany, Japan, the United Kingdom, and the United States). From 2001, these countries include the Euro area, Japan, the United Kingdom, and the United States.",
            "unit_of_measure": null,
            "periodicity": "Annual",
            "base_period": null,
            "other_notes": null,
            "aggregation_method": "Weighted Average",
            "limitations_and_exceptions": null,
            "notes_from_original_source": null,
            "general_comments": null,
            "source": "World Bank national accounts data, and OECD National Accounts data files.",
            "statistical_concept_and_methodology": "The World Bank uses Atlas method GNI per capita in U.S. dollars to classify countries for analytical purposes and to determine borrowing eligibility. For more information, see the metadata for Atlas method GNI in current U.S. dollars (NY.GNP.ATLS.CD) and total population (SP.POP.TOTL).",
            "development_relevance": null,
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        },
        {
            "series_code": "SE.ADT.1524.LT.FM.ZS",
            "topic": "Background: Education",
            "indicator_name": "Literacy rate, youth (ages 15-24), gender parity index (GPI)",
            "short_definition": null,
            "long_definition": "Gender parity index for youth literacy rate is the ratio of females to males ages 15-24 who can both read and write with understanding a short simple statement about their everyday life.",
            "unit_of_measure": null,
            "periodicity": "Annual",
            "base_period": null,
            "other_notes": null,
            "aggregation_method": "Weighted average",
            "limitations_and_exceptions": "In practice, literacy is difficult to measure. Estimating literacy rates requires census or survey measurements under controlled conditions. Many countries report the number of literate people from self-reported data. Some use educational attainment data as a proxy but apply different lengths of school attendance or levels of completion. Ant there is a trend among recent national and international surveys toward using a direct reading test of literacy skills. Because definitions and methods of data collection differ across countries, data should be used cautiously.",
            "notes_from_original_source": null,
            "general_comments": "For aggregate data, each economy is classified based on the classification of World Bank Group's fiscal year 2022 (July 1, 2021-June 30, 2022).",
            "source": "UNESCO Institute for Statistics (http://uis.unesco.org/). Data as of June 2022.",
            "statistical_concept_and_methodology": "This indicator is calculated by dividing female youth literacy rate by male youth literacy rate. \n\nLiteracy statistics for most countries cover the population ages 15 and older, but some include younger ages or are confined to age ranges that tend to inflate literacy rates. The youth literacy rate for ages 15-24 reflects recent progress in education. It measures the accumulated outcomes of primary education over the previous 10 years or so by indicating the proportion of the population who have passed through the primary education system and acquired basic literacy and numeracy skills. Generally, literacy also encompasses numeracy, the ability to make simple arithmetic calculations.\n\nData on literacy are compiled by the UNESCO Institute for Statistics based on national censuses and household surveys and, for countries without recent literacy data, using the Global Age-Specific Literacy Projection Model (GALP). For detailed information, see www.uis.unesco.org.",
            "development_relevance": "Literacy rate is an outcome indicator to evaluate educational attainment. This data can predict the quality of future labor force and can be used in ensuring policies for life skills for men and women.\n\nIt can be also used as a proxy instrument to see the effectiveness of education system; a high literacy rate suggests the capacity of an education system to provide a large population with opportunities to acquire literacy skills. The accumulated achievement of education is fundamental for further intellectual growth and social and economic development, although it doesn't necessarily ensure the quality of education.\n\nThe Gender Parity Index (GPI) indicates parity between girls and boys. A GPI of less than 1 suggests girls are more disadvantaged than boys in learning opportunities and a GPI of greater than 1 suggests the other way around. Eliminating gender disparities in education would help increase the status and capabilities of women. Literate women implies that they can seek and use information for the betterment of the health, nutrition and education of their household members. Literate women are also empowered to play a meaningful role.",
            "related_source_links": null,
            "other_web_links": null,
            "related_indicators": null,
            "license_type": "CC BY-4.0"
        }
    ]
}