{
    "table_name": "NHTSA_TRAFFIC_FATALITIES.ACCIDENT_2016",
    "table_fullname": "NHTSA_TRAFFIC_FATALITIES_PLUS.NHTSA_TRAFFIC_FATALITIES.ACCIDENT_2016",
    "column_names": [
        "latitude",
        "hour_of_ems_arrival_at_hospital",
        "relation_to_trafficway_name",
        "national_highway_system",
        "related_factors_crash_level_2",
        "functional_system",
        "number_of_fatalities",
        "land_use_name",
        "number_of_persons_not_in_motor_vehicles_in_transport_mvit",
        "timestamp_of_crash",
        "relation_to_junction_specific_location_name",
        "atmospheric_conditions_2_name",
        "ownership",
        "related_factors_crash_level_1_name",
        "number_of_motor_vehicles_in_transport_mvit",
        "hour_of_crash",
        "related_factors_crash_level_3",
        "functional_system_name",
        "atmospheric_conditions_name",
        "year_of_crash",
        "minute_of_ems_arrival_at_hospital",
        "atmospheric_conditions_1_name",
        "number_of_forms_submitted_for_persons_not_in_motor_vehicles",
        "first_harmful_event",
        "atmospheric_conditions_1",
        "work_zone",
        "longitude",
        "route_signing_name",
        "atmospheric_conditions",
        "month_of_crash",
        "relation_to_junction_specific_location",
        "consecutive_number",
        "special_jurisdiction",
        "atmospheric_conditions_2",
        "trafficway_identifier_2",
        "hour_of_arrival_at_scene",
        "relation_to_junction_within_interchange_area",
        "state_name",
        "minute_of_notification",
        "special_jurisdiction_name",
        "manner_of_collision",
        "number_of_drunk_drivers",
        "ownership_name",
        "number_of_persons_in_motor_vehicles_in_transport_mvit",
        "first_harmful_event_name",
        "day_of_crash",
        "relation_to_trafficway",
        "type_of_intersection",
        "county",
        "related_factors_crash_level_1",
        "number_of_vehicle_forms_submitted_all",
        "related_factors_crash_level_2_name",
        "number_of_parked_working_vehicles",
        "trafficway_identifier",
        "light_condition_name",
        "hour_of_notification",
        "light_condition",
        "day_of_week",
        "minute_of_arrival_at_scene",
        "land_use",
        "number_of_forms_submitted_for_persons_in_motor_vehicles",
        "school_bus_related",
        "state_number",
        "manner_of_collision_name",
        "milepoint",
        "related_factors_crash_level_3_name",
        "minute_of_crash",
        "city",
        "route_signing",
        "rail_grade_crossing_identifier"
    ],
    "column_types": [
        "FLOAT",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "FLOAT",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT"
    ],
    "description": [
        "This element identifies the location of the crash using Global Position coordinates. This is the position of latitude. DDDDDD (DD.DDDD – Decimal Degrees) DD.DDDD Actual Degrees 77.7777 Not Reported 88.8888 Not Available (If State Exempt) 99.9999 Unknown",
        "This data element records the hour that emergency medical service arrived at the treatment facility to which it was transporting victims of the crash. 00-23 Hour -- Not Notified, Officially Cancelled or Not Transported (when HOSP_MIN = 00) -- Not Notified or Not Transported (when HOSP_MIN = 00) 88 Not Applicable or Not Notified 99 Unknown Hour 99 Officially Cancelled (when HOSP_MIN = 97) 99 Unknown if Transported (when HOSP_MIN = 98)",
        "This data element identifies the location of the crash as it relates to its position within or outside the trafficway based on the “First Harmful Event.”",
        "This data element identifies whether this crash occurred on a trafficway that is part of the National Highway System. 0 This Section is Not on the National Highway System 1 This Section is on the National Highway System 9 Unknown",
        "This data element records factors related to the crash expressed by the investigating officer. For more info on the codes, please look at <C32 Related Factors- Crash Level> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "01 (Interstate), 02 (Principal Arterial – Other Freeways and Expressways), 03 (Principal Arterial – Other), 04 (Minor Arterial), 05 (Major Collector), 06 (Minor Collector), 07 (Local), 96 (Trafficway Not in State Inventory), 98 (Not Reported), and 99 (Unknown).",
        "This data element records the number of fatally injured persons in the crash. 01-99 Number of Fatalities that Occurred in the Crash.",
        "1 (Rural), 2 (Urban), 6 (Trafficway Not in State Inventory), 8 (Not Reported) and 9 (Unknown).",
        "This data element is a count of the number of non-motorists in the crash. A non-motorist is defined as a pedestrian, a cyclist, an occupant of a motor vehicle not intransport, a person riding a horse, an occupant of an animal drawn conveyance, person associated with non-motorist conveyance (e.g., baby carriage, skate board, wheelchair), or an other non-motorist (e.g., person outside a trafficway, person in a house). 0-98 Number of Persons Not in Motor Vehicles in Transport",
        "This data element records the date and time on which the crash occurred.",
        "This data element identifies the crash's location with respect to presence in or proximity to components typically in junction or interchange areas. The coding of this data element is done in two sub-fields (see also C20A) and is based on the location of the “First Harmful Event” of the crash.",
        "This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material.",
        "For more info on the codes, please look at <C13 Ownership> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element records factors related to the crash expressed by the investigating officer.",
        "This data element is a count of the number of vehicles in-transport involved in the crash. Legally parked vehicles are not included. 001-999 Number of Vehicle Forms",
        "This data element records the hour at which the crash occurred. 00-23 Hour -- Not Applicable or Not Notified 99 Unknown",
        "This data element records factors related to the crash expressed by the investigating officer. For more info on the codes, please look at <C32 Related Factors- Crash Level> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "01 (Interstate), 02 (Principal Arterial – Other Freeways and Expressways), 03 (Principal Arterial – Other), 04 (Minor Arterial), 05 (Major Collector), 06 (Minor Collector), 07 (Local), 96 (Trafficway Not in State Inventory), 98 (Not Reported), and 99 (Unknown).",
        "This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material.",
        "This data element records the year in which the crash occurred. xxxx Year of the Crash",
        "This data element records the minutes after the hour that emergency medical service arrived at the treatment facility to which it was transporting victims of the crash. 00-59 Minute -- Not Notified, Officially Cancelled or Not Transported (when HOSP_HR = 00) -- Not Notified or Not Transported (when HOSP_HR = 00) 88 Not Applicable or Not Notified 96 Terminated Transport 97 Officially Cancelled 98 Unknown if Transported 99 Unknown Minutes",
        "This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material.",
        "This data element is the number of Person Forms (Not a Motor Vehicle Occupant) that are applicable to this case (i.e., non-occupants). 00-99 Number of Persons Not in Motor Vehicles",
        "This data element describes the first injury or damage producing event of the crash. For more info on the codes, please look at <C19 First Harmful Event> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material. For more info on the codes, please look at <C26 Atmospheric Conditions> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element identifies a motor vehicle traffic crash in which the first harmful event occurs within the boundaries of a work zone or on an approach to or exit from a work zone, resulting from an activity, behavior, or control related to the movement of the traffic units through the work zone. 0 None 1 Construction 2 Maintenance -- Construction or Maintenance 3 Utility 4 Work Zone, Type Unknown -- Not Reported",
        "This element identifies the location of the crash using Global Position coordinates. This is the position of longitude. DDDDDDD (DDD.DDDD – Decimal Degrees) DDD.DDDD Actual Degrees 777.7777 Not Reported 888.8888 Not Available (If State Exempt) 999.9999 Unknown",
        "This data element identifies the route signing of the trafficway on which the crash occurred.",
        "This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material. For more info on the codes, please look at <C26 Atmospheric Conditions> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element records the month in which the crash occurred. For more info on the codes, please look at <C8A Month of Crash> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element identifies the crash's location with respect to presence in or proximity to components typically in junction or interchange areas. The coding of this data element is done in two sub-fields (see also C20A) and is based on the location of the “First Harmful Event” of the crash. For more info on the codes, please look at <C21B Relation to Junction- Specific Location> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element is the unique case number assigned to each crash. It appears on each data file and is used to merge information from the data files together. xxxxxx Two Characters for State Code followed by Four Characters for Case Number",
        "This data element identifies if the location on the trafficway where the crash occurred qualifies as a Special Jurisdiction even though it may be patrolled by state, county or local police (e.g., all State highways running through Indian reservations are under the jurisdiction of the Indian reservation). 0 No Special Jurisdiction (Includes National Forests Since 2008) 1 National Park Service 2 Military 3 Indian Reservation 4 College/University Campus 5 Other Federal Properties (Since 1977) 8 Other (Since 1976) 9 Unknown",
        "This data element records the prevailing atmospheric conditions that existed at the time of the crash as indicated in the case material. For more info on the codes, please look at <C26 Atmospheric Conditions> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element records the trafficway on which the crash occurred. xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx Actual Posted Number, Assigned Number, or Common Name (30 characters) 999999999999999999999999999999 Unknown",
        "This data element records the hour that emergency medical service arrived on the crash scene. 00-23 Hour -- Not Notified or Officially Cancelled (when ARR_MIN = 00) -- Not Notified (when ARR_MIN = 00) 88 Not Applicable or Not Notified 99 Unknown Hour 99 Officially Cancelled (when ARR_MIN = 97) 99 Unknown if Arrived (when ARR_MIN = 98)",
        "This data element identifies the crash's location with respect to presence in an interchange area. The coding of this data element is done in two sub-fields (see also C20B) and is based on the location of the “First Harmful Event” of the crash. 0 No 1 Yes 8 Not Reported 9 Unknown",
        "This data element identifies the state in which the crash occurred. The codes are from the General Services Administration’s (GSA) publication of worldwide Geographic Location Codes (GLC).",
        "This data element records the minutes after the hour that emergency medical service was notified. 00-59 Minute -- Not Applicable or Not Notified (when NOT_HOUR = 00) 88 Not Applicable or Not Notified 98 Unknown if Notified 99 Unknown Minutes",
        "This data element identifies if the location on the trafficway where the crash occurred qualifies as a Special Jurisdiction even though it may be patrolled by state, county or local police (e.g., all State highways running through Indian reservations are under the jurisdiction of the Indian reservation).",
        "This data element describes the orientation of two motor vehicles in-transport when they are involved in the “First Harmful Event” of a collision crash. If the “First Harmful Event” is not a collision between two motor vehicles in-transport it is classified as such. For more info on the codes, please look at <C20 Manner of Collision> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element records the number of drunk drivers involved in the crash. 00-99 Number of Drunk Drivers Involved in the Fatal Crash.",
        "For more info on the codes, please look at <C13 Ownership> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element is a count of the number of motorists in the crash. A motorist is a driver, passenger or unknown occupant type of a motor vehicle in-transport. 0-999 Number of Persons in Motor Vehicles In-Transport",
        "This data element describes the first injury or damage producing event of the crash.",
        "This data element records the day of the month on which the crash occurred. 01-31 Day of the Month of the Crash -- Unknown",
        "This data element identifies the location of the crash as it relates to its position within or outside the trafficway based on the “First Harmful Event.” For more info on the codes, please look at <C23 Relation to Trafficway> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element identifies and allows separation of various intersection types. 1 Not an Intersection 2 Four-Way Intersection 3 T-Intersection 4 Y-Intersection 5 Traffic Circle 6 Roundabout 7 Five-Point, or More 10 L-Intersection 98 Not Reported 99 Unknown",
        "This data element records the location of the unstabilized event with regard to the County. The codes are from the General Services Administration’s (GSA) publication of worldwide Geographic Location Codes (GLC). 000 Not Applicable 001-996 Use GSA Geographical Codes 997 Other 998 Not Reported 999 Unknown",
        "This data element records factors related to the crash expressed by the investigating officer. For more info on the codes, please look at <C32 Related Factors- Crash Level> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "number_of_vehicle_forms_submitted_all",
        "This data element records factors related to the crash expressed by the investigating officer.",
        "This data element is a count of the number of parked and working vehicles involved in the crash. 0-999 Number of Parked/Working Vehicles in the Crash",
        "This data element records the trafficway on which the crash occurred. xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx Actual Posted Number, Assigned Number, or Common Name (30 characters) 999999999999999999999999999999 Unknown",
        "This data element records the type/level of light that existed at the time of the crash as indicated in the case material.",
        "This data element records the hour that emergency medical service was notified. 00-23 Hour -- Not Applicable or Not Notified (when NOT_MIN = 00) 88 Not Applicable or Not Notified 99 Unknown Hour 99 Unknown if Notified (when NOT_MIN = 98)",
        "This data element records the type/level of light that existed at the time of the crash as indicated in the case material. For more info on the codes, please look at <C25 Light Condition> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element records the day of the week on which the crash occurred. 1 Sunday 2 Monday 3 Tuesday 4 Wednesday 5 Thursday 6 Friday 7 Saturday -- Unknown",
        "This data element records the minutes after the hour that emergency medical service arrived on the crash scene. 00-59 Minute 00 -- Not Notified or Officially Cancelled (when ARR_HOUR = 00) -- Not Notified (when ARR_HOUR = 00) 88 Not Applicable or Not Notified 97 Officially Cancelled 98 Unknown if Arrived 99 Unknown Minutes",
        "1 (Rural), 2 (Urban), 6 (Trafficway Not in State Inventory), 8 (Not Reported) and 9 (Unknown).",
        "This data element is a count of the number of Person Level (Motor Vehicle Occupant) Forms that are applicable to this case (i.e., occupants). 000-999 Number of Person Forms",
        "This data element identifies if a school bus, or motor vehicle functioning as a school bus, is related to the crash. 0 No 1 Yes -- Not Reported",
        "This data element identifies the state in which the crash occurred. The codes are from the General Services Administration’s (GSA) publication of worldwide Geographic Location Codes (GLC). For more info on the codes, please look at <C1/V1/D1/PC1/P1/NM1 State Number> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
        "This data element describes the orientation of two motor vehicles in-transport when they are involved in the “First Harmful Event” of a collision crash. If the “First Harmful Event” is not a collision between two motor vehicles in-transport it is classified as such.",
        "This data element records the milepoint nearest to the location where the crash occurred. 00000 None xxxxx Actual to Nearest Tenth Mile (Assume decimal, e.g., 12345 = 1234.5) 99998 Not Reported 99999 Unknown",
        "This data element records factors related to the crash expressed by the investigating officer.",
        "This data element records the minutes after the hour at which the crash occurred. 00-59 Minute -- Not Applicable or Not Notified 99 Unknown",
        "This data element records the location of the unstabilized event with regard to the City. The codes are from the General Services Administration’s (GSA) publication of worldwide Geographic Location Codes (GLC). 0000 Not Applicable 0001-9996 GSA Geographical Codes 9997 Other 9898 Not Reported 9999 Unknown",
        "This data element identifies the route signing of the trafficway on which the crash occurred. 1 Interstate 2 U.S. Highway 3 State Highway 4 County Road 5 Local Street – Township 6 Local Street – Municipality 7 Local Street – Frontage Road (Since 1994) 8 Other 9 Unknown",
        "This data element identifies if the crash occurred in or near a rail grade crossing. 0000000 Not Applicable xxxxxxA Six Digits Followed by One Alphabetic Valid F.R.A. Code 9999999 Unknown"
    ],
    "sample_rows": [
        {
            "state_number": 16,
            "state_name": "Idaho",
            "consecutive_number": 160065,
            "number_of_vehicle_forms_submitted_all": 2,
            "number_of_motor_vehicles_in_transport_mvit": 1,
            "number_of_parked_working_vehicles": 1,
            "number_of_forms_submitted_for_persons_not_in_motor_vehicles": 0,
            "number_of_persons_not_in_motor_vehicles_in_transport_mvit": 1,
            "number_of_persons_in_motor_vehicles_in_transport_mvit": 2,
            "number_of_forms_submitted_for_persons_in_motor_vehicles": 3,
            "county": 53,
            "city": 0,
            "day_of_crash": 21,
            "month_of_crash": 5,
            "year_of_crash": 2016,
            "day_of_week": 7,
            "hour_of_crash": 18,
            "minute_of_crash": 5,
            "national_highway_system": 1,
            "land_use": 1,
            "land_use_name": "Rural",
            "functional_system": 1,
            "functional_system_name": "Interstate",
            "ownership": 1,
            "ownership_name": "State Highway Agency",
            "route_signing": 1,
            "route_signing_name": "Interstate",
            "trafficway_identifier": "I-84",
            "trafficway_identifier_2": "",
            "milepoint": 1809,
            "latitude": 42.58389167,
            "longitude": -114.31264722,
            "special_jurisdiction": 0,
            "special_jurisdiction_name": "No Special Jurisdiction (Includes National Forests Since 2008)",
            "first_harmful_event": 14,
            "first_harmful_event_name": "Parked Motor Vehicle (Not In Transport)",
            "manner_of_collision": 0,
            "manner_of_collision_name": "Not Collision with Motor Vehicle in Transport (Not Necessarily in Transport for\n2005-2009)",
            "relation_to_junction_within_interchange_area": "No",
            "relation_to_junction_specific_location": 1,
            "relation_to_junction_specific_location_name": "Non-Junction",
            "type_of_intersection": "Not an Intersection",
            "work_zone": "None",
            "relation_to_trafficway": 2,
            "relation_to_trafficway_name": "On Shoulder",
            "light_condition": 1,
            "light_condition_name": "Daylight",
            "atmospheric_conditions_1": 3,
            "atmospheric_conditions_1_name": "Sleet, Hail",
            "atmospheric_conditions_2": 2,
            "atmospheric_conditions_2_name": "Rain",
            "atmospheric_conditions": 3,
            "atmospheric_conditions_name": "Sleet, Hail",
            "school_bus_related": "No",
            "rail_grade_crossing_identifier": "0000000",
            "hour_of_notification": 18,
            "minute_of_notification": 9,
            "hour_of_arrival_at_scene": 18,
            "minute_of_arrival_at_scene": 17,
            "hour_of_ems_arrival_at_hospital": 99,
            "minute_of_ems_arrival_at_hospital": 99,
            "related_factors_crash_level_1": 19,
            "related_factors_crash_level_1_name": "Recent Previous Crash Scene Nearby (Since 1989)",
            "related_factors_crash_level_2": 0,
            "related_factors_crash_level_2_name": "None",
            "related_factors_crash_level_3": 0,
            "related_factors_crash_level_3_name": "None",
            "number_of_fatalities": 1,
            "number_of_drunk_drivers": 0,
            "timestamp_of_crash": 1463853900000000
        },
        {
            "state_number": 37,
            "state_name": "North Carolina",
            "consecutive_number": 370035,
            "number_of_vehicle_forms_submitted_all": 2,
            "number_of_motor_vehicles_in_transport_mvit": 1,
            "number_of_parked_working_vehicles": 1,
            "number_of_forms_submitted_for_persons_not_in_motor_vehicles": 0,
            "number_of_persons_not_in_motor_vehicles_in_transport_mvit": 1,
            "number_of_persons_in_motor_vehicles_in_transport_mvit": 4,
            "number_of_forms_submitted_for_persons_in_motor_vehicles": 5,
            "county": 97,
            "city": 0,
            "day_of_crash": 22,
            "month_of_crash": 1,
            "year_of_crash": 2016,
            "day_of_week": 6,
            "hour_of_crash": 13,
            "minute_of_crash": 50,
            "national_highway_system": 1,
            "land_use": 1,
            "land_use_name": "Rural",
            "functional_system": 1,
            "functional_system_name": "Interstate",
            "ownership": 1,
            "ownership_name": "State Highway Agency",
            "route_signing": 1,
            "route_signing_name": "Interstate",
            "trafficway_identifier": "I-77",
            "trafficway_identifier_2": "",
            "milepoint": 99999,
            "latitude": 35.71855278,
            "longitude": -80.85634167,
            "special_jurisdiction": 0,
            "special_jurisdiction_name": "No Special Jurisdiction (Includes National Forests Since 2008)",
            "first_harmful_event": 14,
            "first_harmful_event_name": "Parked Motor Vehicle (Not In Transport)",
            "manner_of_collision": 0,
            "manner_of_collision_name": "Not Collision with Motor Vehicle in Transport (Not Necessarily in Transport for\n2005-2009)",
            "relation_to_junction_within_interchange_area": "No",
            "relation_to_junction_specific_location": 1,
            "relation_to_junction_specific_location_name": "Non-Junction",
            "type_of_intersection": "Not an Intersection",
            "work_zone": "None",
            "relation_to_trafficway": 2,
            "relation_to_trafficway_name": "On Shoulder",
            "light_condition": 1,
            "light_condition_name": "Daylight",
            "atmospheric_conditions_1": 3,
            "atmospheric_conditions_1_name": "Sleet, Hail",
            "atmospheric_conditions_2": 12,
            "atmospheric_conditions_2_name": "Freezing Rain or Drizzle",
            "atmospheric_conditions": 3,
            "atmospheric_conditions_name": "Sleet, Hail",
            "school_bus_related": "No",
            "rail_grade_crossing_identifier": "0000000",
            "hour_of_notification": 14,
            "minute_of_notification": 0,
            "hour_of_arrival_at_scene": 14,
            "minute_of_arrival_at_scene": 4,
            "hour_of_ems_arrival_at_hospital": 99,
            "minute_of_ems_arrival_at_hospital": 99,
            "related_factors_crash_level_1": 0,
            "related_factors_crash_level_1_name": "None",
            "related_factors_crash_level_2": 0,
            "related_factors_crash_level_2_name": "None",
            "related_factors_crash_level_3": 0,
            "related_factors_crash_level_3_name": "None",
            "number_of_fatalities": 1,
            "number_of_drunk_drivers": 0,
            "timestamp_of_crash": 1453470600000000
        },
        {
            "state_number": 39,
            "state_name": "Ohio",
            "consecutive_number": 391029,
            "number_of_vehicle_forms_submitted_all": 1,
            "number_of_motor_vehicles_in_transport_mvit": 1,
            "number_of_parked_working_vehicles": 0,
            "number_of_forms_submitted_for_persons_not_in_motor_vehicles": 0,
            "number_of_persons_not_in_motor_vehicles_in_transport_mvit": 0,
            "number_of_persons_in_motor_vehicles_in_transport_mvit": 5,
            "number_of_forms_submitted_for_persons_in_motor_vehicles": 5,
            "county": 59,
            "city": 1260,
            "day_of_crash": 17,
            "month_of_crash": 12,
            "year_of_crash": 2016,
            "day_of_week": 7,
            "hour_of_crash": 1,
            "minute_of_crash": 45,
            "national_highway_system": 1,
            "land_use": 1,
            "land_use_name": "Rural",
            "functional_system": 1,
            "functional_system_name": "Interstate",
            "ownership": 1,
            "ownership_name": "State Highway Agency",
            "route_signing": 1,
            "route_signing_name": "Interstate",
            "trafficway_identifier": "I-70",
            "trafficway_identifier_2": "",
            "milepoint": 63,
            "latitude": 40.00832222,
            "longitude": -81.61759444,
            "special_jurisdiction": 0,
            "special_jurisdiction_name": "No Special Jurisdiction (Includes National Forests Since 2008)",
            "first_harmful_event": 35,
            "first_harmful_event_name": "Embankment",
            "manner_of_collision": 0,
            "manner_of_collision_name": "Not Collision with Motor Vehicle in Transport (Not Necessarily in Transport for\n2005-2009)",
            "relation_to_junction_within_interchange_area": "No",
            "relation_to_junction_specific_location": 1,
            "relation_to_junction_specific_location_name": "Non-Junction",
            "type_of_intersection": "Not an Intersection",
            "work_zone": "None",
            "relation_to_trafficway": 3,
            "relation_to_trafficway_name": "On Median",
            "light_condition": 2,
            "light_condition_name": "Dark – Not Lighted",
            "atmospheric_conditions_1": 3,
            "atmospheric_conditions_1_name": "Sleet, Hail",
            "atmospheric_conditions_2": 0,
            "atmospheric_conditions_2_name": "No Additional Atmospheric Conditions",
            "atmospheric_conditions": 3,
            "atmospheric_conditions_name": "Sleet, Hail",
            "school_bus_related": "No",
            "rail_grade_crossing_identifier": "0000000",
            "hour_of_notification": 1,
            "minute_of_notification": 51,
            "hour_of_arrival_at_scene": 1,
            "minute_of_arrival_at_scene": 54,
            "hour_of_ems_arrival_at_hospital": 2,
            "minute_of_ems_arrival_at_hospital": 55,
            "related_factors_crash_level_1": 0,
            "related_factors_crash_level_1_name": "None",
            "related_factors_crash_level_2": 0,
            "related_factors_crash_level_2_name": "None",
            "related_factors_crash_level_3": 0,
            "related_factors_crash_level_3_name": "None",
            "number_of_fatalities": 2,
            "number_of_drunk_drivers": 0,
            "timestamp_of_crash": 1481939100000000
        },
        {
            "state_number": 37,
            "state_name": "North Carolina",
            "consecutive_number": 370037,
            "number_of_vehicle_forms_submitted_all": 2,
            "number_of_motor_vehicles_in_transport_mvit": 2,
            "number_of_parked_working_vehicles": 0,
            "number_of_forms_submitted_for_persons_not_in_motor_vehicles": 0,
            "number_of_persons_not_in_motor_vehicles_in_transport_mvit": 0,
            "number_of_persons_in_motor_vehicles_in_transport_mvit": 3,
            "number_of_forms_submitted_for_persons_in_motor_vehicles": 3,
            "county": 101,
            "city": 0,
            "day_of_crash": 22,
            "month_of_crash": 1,
            "year_of_crash": 2016,
            "day_of_week": 6,
            "hour_of_crash": 8,
            "minute_of_crash": 21,
            "national_highway_system": 1,
            "land_use": 1,
            "land_use_name": "Rural",
            "functional_system": 1,
            "functional_system_name": "Interstate",
            "ownership": 1,
            "ownership_name": "State Highway Agency",
            "route_signing": 1,
            "route_signing_name": "Interstate",
            "trafficway_identifier": "I-95",
            "trafficway_identifier_2": "",
            "milepoint": 99999,
            "latitude": 35.56932222,
            "longitude": -78.16416944,
            "special_jurisdiction": 0,
            "special_jurisdiction_name": "No Special Jurisdiction (Includes National Forests Since 2008)",
            "first_harmful_event": 51,
            "first_harmful_event_name": "Jackknife (Harmful to This Vehicle)",
            "manner_of_collision": 0,
            "manner_of_collision_name": "Not Collision with Motor Vehicle in Transport (Not Necessarily in Transport for\n2005-2009)",
            "relation_to_junction_within_interchange_area": "No",
            "relation_to_junction_specific_location": 1,
            "relation_to_junction_specific_location_name": "Non-Junction",
            "type_of_intersection": "Not an Intersection",
            "work_zone": "None",
            "relation_to_trafficway": 1,
            "relation_to_trafficway_name": "On Roadway",
            "light_condition": 1,
            "light_condition_name": "Daylight",
            "atmospheric_conditions_1": 3,
            "atmospheric_conditions_1_name": "Sleet, Hail",
            "atmospheric_conditions_2": 12,
            "atmospheric_conditions_2_name": "Freezing Rain or Drizzle",
            "atmospheric_conditions": 3,
            "atmospheric_conditions_name": "Sleet, Hail",
            "school_bus_related": "No",
            "rail_grade_crossing_identifier": "0000000",
            "hour_of_notification": 8,
            "minute_of_notification": 4,
            "hour_of_arrival_at_scene": 8,
            "minute_of_arrival_at_scene": 14,
            "hour_of_ems_arrival_at_hospital": 9,
            "minute_of_ems_arrival_at_hospital": 38,
            "related_factors_crash_level_1": 0,
            "related_factors_crash_level_1_name": "None",
            "related_factors_crash_level_2": 0,
            "related_factors_crash_level_2_name": "None",
            "related_factors_crash_level_3": 0,
            "related_factors_crash_level_3_name": "None",
            "number_of_fatalities": 1,
            "number_of_drunk_drivers": 0,
            "timestamp_of_crash": 1453450860000000
        },
        {
            "state_number": 6,
            "state_name": "California",
            "consecutive_number": 62039,
            "number_of_vehicle_forms_submitted_all": 1,
            "number_of_motor_vehicles_in_transport_mvit": 1,
            "number_of_parked_working_vehicles": 0,
            "number_of_forms_submitted_for_persons_not_in_motor_vehicles": 0,
            "number_of_persons_not_in_motor_vehicles_in_transport_mvit": 0,
            "number_of_persons_in_motor_vehicles_in_transport_mvit": 2,
            "number_of_forms_submitted_for_persons_in_motor_vehicles": 2,
            "county": 65,
            "city": 0,
            "day_of_crash": 3,
            "month_of_crash": 12,
            "year_of_crash": 2016,
            "day_of_week": 7,
            "hour_of_crash": 5,
            "minute_of_crash": 2,
            "national_highway_system": 1,
            "land_use": 1,
            "land_use_name": "Rural",
            "functional_system": 1,
            "functional_system_name": "Interstate",
            "ownership": 1,
            "ownership_name": "State Highway Agency",
            "route_signing": 1,
            "route_signing_name": "Interstate",
            "trafficway_identifier": "I-10",
            "trafficway_identifier_2": "",
            "milepoint": 732,
            "latitude": 33.6753,
            "longitude": -115.94486389,
            "special_jurisdiction": 0,
            "special_jurisdiction_name": "No Special Jurisdiction (Includes National Forests Since 2008)",
            "first_harmful_event": 24,
            "first_harmful_event_name": "Guardrail Face",
            "manner_of_collision": 0,
            "manner_of_collision_name": "Not Collision with Motor Vehicle in Transport (Not Necessarily in Transport for\n2005-2009)",
            "relation_to_junction_within_interchange_area": "No",
            "relation_to_junction_specific_location": 1,
            "relation_to_junction_specific_location_name": "Non-Junction",
            "type_of_intersection": "Not an Intersection",
            "work_zone": "None",
            "relation_to_trafficway": 3,
            "relation_to_trafficway_name": "On Median",
            "light_condition": 2,
            "light_condition_name": "Dark – Not Lighted",
            "atmospheric_conditions_1": 6,
            "atmospheric_conditions_1_name": "Severe Crosswinds",
            "atmospheric_conditions_2": 0,
            "atmospheric_conditions_2_name": "No Additional Atmospheric Conditions",
            "atmospheric_conditions": 6,
            "atmospheric_conditions_name": "Severe Crosswinds",
            "school_bus_related": "No",
            "rail_grade_crossing_identifier": "0000000",
            "hour_of_notification": 99,
            "minute_of_notification": 99,
            "hour_of_arrival_at_scene": 99,
            "minute_of_arrival_at_scene": 99,
            "hour_of_ems_arrival_at_hospital": 88,
            "minute_of_ems_arrival_at_hospital": 88,
            "related_factors_crash_level_1": 0,
            "related_factors_crash_level_1_name": "None",
            "related_factors_crash_level_2": 0,
            "related_factors_crash_level_2_name": "None",
            "related_factors_crash_level_3": 0,
            "related_factors_crash_level_3_name": "None",
            "number_of_fatalities": 2,
            "number_of_drunk_drivers": 1,
            "timestamp_of_crash": 1480741320000000
        }
    ]
}