{
    "sample_rows": [
        {
            "FEMA_RECORD_ID": "bba9a6ab-25c0-4da1-be01-aad777adb402",
            "MISSION_ASSIGNMENT_ID": "3345EMWVCOELRD01",
            "AMENDMENT_ID": 0,
            "DISASTER_ID": "3345",
            "REQUESTING_AGENCY": "COE-LRD",
            "REQUESTED_DATE": "2012-07-01",
            "OBLIGATION_DATE": "2012-07-01",
            "PROJECTED_COMPLETION_DATE": "2012-07-05",
            "STATE_COST_SHARE_AMOUNT": 0.0,
            "STATE_COST_SHARE_PERCENT": 0.0,
            "FEDERAL_COST_SHARE_AMOUNT": 10000.0,
            "FEDERAL_COST_SHARE_PERCENT": 1.0,
            "REQUESTED_AMOUNT": 10000.0,
            "OBLIGATION_AMOUNT": 10000.0,
            "REQUESTED_ASSISTANCE_DESCRIPTION": "Deploy and provide Temporary Emergency Power SME's to State and/or local jurisdictions to aid in accomplishing their emergency power mission, at the direction and coordination of FEMA.",
            "STATEMENT_OF_WORK": "Deploy Type IV Temporary Emergency Power support personnel, to include deployment of one Subject Matter Expert five (5) 249th EN BN personnel (military) to provide limited technical support for localized events within a State or US Territory.  Coordinate with local government representatives to establish relationships and assistance in developing their emergency power requirements and/or needs.  Advise on the proper set-up, lay-out, and management generator staging area for FEMA generators under 800 kW and associated Bill of Materials (BOM) (e.g. wires, connectors, and small tools).  Conduct critical facilities pre-installation inspections or conduct safety inspections of installed generators.\r\n\r\nAnticipated assessment rates assume the critical facilities location and POC information are correct, and the facility POC¿s are available.  Generators and associated BOM will be supplied by FEMA and/or the local government.  The local government must have the capability to load/unload, prep, haul, install, operate, fuel, maintain, repair, and make generators fully mission capable before they are returned to FEMA.  \r\n\r\nAll equipment and supply purchases must be coordinated with FEMA.  Prior FEMA approval is necessary to ensure reimbursement.",
            "CITY": null,
            "STATE_GEO_ID": null,
            "ZIP_GEO_ID": null
        },
        {
            "FEMA_RECORD_ID": "8d97bf5b-c7f9-481c-9e7e-56ca1e3921c8",
            "MISSION_ASSIGNMENT_ID": "3345EMWVDOE01",
            "AMENDMENT_ID": 1,
            "DISASTER_ID": "3345",
            "REQUESTING_AGENCY": "DOE",
            "REQUESTED_DATE": "2012-07-02",
            "OBLIGATION_DATE": "2012-07-02",
            "PROJECTED_COMPLETION_DATE": "2012-07-07",
            "STATE_COST_SHARE_AMOUNT": 0.0,
            "STATE_COST_SHARE_PERCENT": 0.0,
            "FEDERAL_COST_SHARE_AMOUNT": 2000.0,
            "FEDERAL_COST_SHARE_PERCENT": 1.0,
            "REQUESTED_AMOUNT": 2000.0,
            "OBLIGATION_AMOUNT": 2000.0,
            "REQUESTED_ASSISTANCE_DESCRIPTION": "Amend to increase funding from $3000 to $5000\r\nActivate Department of Energy (DOE) to the FEMA HQ National Response Coordination Center (NRCC) to perform \r\nthe duties of emergency Support Function (ESF) #12 in support of post-declaration disaster operations in response to the severe weather in the Ohio Valley and Mid-Atlantic states.\r\n",
            "STATEMENT_OF_WORK": "Post-Declaration activation for appropriate DOE personnel to perform the functions of ESF #12 in the NRCC supporting National-level coordination efforts and Regional response activities at the direction and coordination of FEMA, beginning 6/30/2012.  This activation may include overtime and administrative costs.  Equipment purchases are not authorized under this Mission Assignment.  MA task orders will be issued for specific personnel.\r\n",
            "CITY": "Washington",
            "STATE_GEO_ID": "geoId/11",
            "ZIP_GEO_ID": "zip/20472"
        },
        {
            "FEMA_RECORD_ID": "98139914-ea4a-46d8-9e50-6bad04ad7105",
            "MISSION_ASSIGNMENT_ID": "3345EMWVDOE01",
            "AMENDMENT_ID": 2,
            "DISASTER_ID": "3345",
            "REQUESTING_AGENCY": "DOE",
            "REQUESTED_DATE": "2012-09-26",
            "OBLIGATION_DATE": "2012-10-01",
            "PROJECTED_COMPLETION_DATE": "2012-07-07",
            "STATE_COST_SHARE_AMOUNT": 0.0,
            "STATE_COST_SHARE_PERCENT": 0.0,
            "FEDERAL_COST_SHARE_AMOUNT": 381.37,
            "FEDERAL_COST_SHARE_PERCENT": 1.0,
            "REQUESTED_AMOUNT": 381.37,
            "OBLIGATION_AMOUNT": 381.37,
            "REQUESTED_ASSISTANCE_DESCRIPTION": "9/25/2012, Amendment #2: Add funding to cover costs of OFA activities.\r\n\r\nAmendment #1: Amend to increase funding from $3000 to $5000\r\n\r\nActivate Department of Energy (DOE) to the FEMA HQ National Response Coordination Center (NRCC) to perform \r\nthe duties of emergency Support Function (ESF) #12 in support of post-declaration disaster operations in response to the severe weather in the Ohio Valley and Mid-Atlantic states.\r\n",
            "STATEMENT_OF_WORK": "Post-Declaration activation for appropriate DOE personnel to perform the functions of ESF #12 in the NRCC supporting National-level coordination efforts and Regional response activities at the direction and coordination of FEMA, beginning 6/30/2012.  This activation may include overtime and administrative costs.  Equipment purchases are not authorized under this Mission Assignment.  MA task orders will be issued for specific personnel.\r\n",
            "CITY": "Washington",
            "STATE_GEO_ID": "geoId/11",
            "ZIP_GEO_ID": "zip/20472"
        },
        {
            "FEMA_RECORD_ID": "96652112-6336-4fe4-969e-09a2de04d475",
            "MISSION_ASSIGNMENT_ID": "3346EMOHCOELRD01",
            "AMENDMENT_ID": 0,
            "DISASTER_ID": "3346",
            "REQUESTING_AGENCY": "COE-LRD",
            "REQUESTED_DATE": "2012-07-01",
            "OBLIGATION_DATE": "2012-07-01",
            "PROJECTED_COMPLETION_DATE": "2012-07-07",
            "STATE_COST_SHARE_AMOUNT": 0.0,
            "STATE_COST_SHARE_PERCENT": 0.0,
            "FEDERAL_COST_SHARE_AMOUNT": 6000.0,
            "FEDERAL_COST_SHARE_PERCENT": 1.0,
            "REQUESTED_AMOUNT": 6000.0,
            "OBLIGATION_AMOUNT": 6000.0,
            "REQUESTED_ASSISTANCE_DESCRIPTION": "Activate U.S. Army Corps of Engineers (USACE) to the FEMA Region V Regional Response Coordination Center (RRCC), IMATs and or IOF to perform duties of Emergency Support Function (ESF) #3, in support of disaster operations in response to Severe Storms in Ohio.",
            "STATEMENT_OF_WORK": "Activation for appropriate USACE personnel to perform the functions of ESF #3 at the direction and coordination of FEMA. This activation may include support to the FEMA Region V RRCC,IOF, IMATs, and other teams (which may include support to ESF #5). ESF #3 Team Leader and support staff may be used, including Prime Power and site-specific administrative support, and / or other mission Subject Matter Experts, at the direction and coordination of FEMA. This may also include the activation of ESF #3 Support Agency representatives to serve as liaisons to the ESF #3 Management Team for public work/infrastructure assistance as required. Pre-Declaration MAs that exceed 7 to 10 days will require FEMA approval. A subsequent MA may be issued for Post-Declaration activation if necessary. Equipment purchases are not authorized under this Mission Assignment. MA task orders will be issued for specific personnel requirements, location(s), dates, and duration of assignment(s).",
            "CITY": null,
            "STATE_GEO_ID": null,
            "ZIP_GEO_ID": null
        },
        {
            "FEMA_RECORD_ID": "892185e9-4374-4e7e-a81b-15ece856ccb7",
            "MISSION_ASSIGNMENT_ID": "3346EMOHCOELRD02",
            "AMENDMENT_ID": 3,
            "DISASTER_ID": "3346",
            "REQUESTING_AGENCY": "COE-LRD",
            "REQUESTED_DATE": "2013-04-11",
            "OBLIGATION_DATE": "2013-04-22",
            "PROJECTED_COMPLETION_DATE": "2012-07-10",
            "STATE_COST_SHARE_AMOUNT": NaN,
            "STATE_COST_SHARE_PERCENT": NaN,
            "FEDERAL_COST_SHARE_AMOUNT": NaN,
            "FEDERAL_COST_SHARE_PERCENT": NaN,
            "REQUESTED_AMOUNT": -226969.84,
            "OBLIGATION_AMOUNT": -226969.84,
            "REQUESTED_ASSISTANCE_DESCRIPTION": "Amendment #3: De-obligate $226,969.84 per USACE email from CJ Infantino dated 04/08/13 to close out this MA.\r\n\r\nAmendment #2: Push date out to 10 July 2012 per USACE request.\r\n\r\nAmendment #1: Request additional funding of $250,000 to continue assessment, install and maintenance of generators as necessary.  \r\n\r\nActivate Type 3 elements associated with the Temporary Emergency Power mission to provide for event specific planning and preparation as directed by FEMA.",
            "STATEMENT_OF_WORK": "actions include deployment of Planning Response Team (PRT) and 249th deployment, State planning coordination,\r\ngenerator shipment and preparation, Deployable Tactical Operating System (DTOS) support, Advance Contracting Initiative (ACI) contractor mobilization and pre-installation actions. Coordinate with State representatives to establish relationships and confirm procedures for emergency power requirements and/or needs. Implement ACI or other contracting process, as required, to position generators and related resources. Generator shipment includes shipment and transportation (in coordination with FEMA Logistics, as appropriate) to Federal/State generator operations staging area. Assets will be returned to the Distribution Center (DC)/Remote Storage Site (RSS) stock fully mission capable in coordination with FEMA Logistics. Additionally, provide maintenance support to the DC/RSS to ensure operational readiness of generators. Generators and associated Bill of Materials (BOM) (e.g. wires, connectors and load banks) will be supplied by FEMA, Department of Defense, and/or leased from a contractor.",
            "CITY": "Columbus",
            "STATE_GEO_ID": "geoId/39",
            "ZIP_GEO_ID": "zip/43218"
        }
    ],
    "table_name": "FEMA_MISSION_ASSIGNMENT_INDEX",
    "table_fullname": "WEATHER__ENVIRONMENT.CYBERSYN.FEMA_MISSION_ASSIGNMENT_INDEX",
    "column_names": [
        "REQUESTED_ASSISTANCE_DESCRIPTION",
        "CITY",
        "STATE_COST_SHARE_PERCENT",
        "STATE_GEO_ID",
        "OBLIGATION_AMOUNT",
        "FEMA_RECORD_ID",
        "STATE_COST_SHARE_AMOUNT",
        "ZIP_GEO_ID",
        "PROJECTED_COMPLETION_DATE",
        "REQUESTED_DATE",
        "REQUESTED_AMOUNT",
        "FEDERAL_COST_SHARE_PERCENT",
        "OBLIGATION_DATE",
        "STATEMENT_OF_WORK",
        "MISSION_ASSIGNMENT_ID",
        "FEDERAL_COST_SHARE_AMOUNT",
        "DISASTER_ID",
        "AMENDMENT_ID",
        "REQUESTING_AGENCY"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "FLOAT",
        "TEXT",
        "FLOAT",
        "TEXT",
        "FLOAT",
        "TEXT",
        "DATE",
        "DATE",
        "FLOAT",
        "FLOAT",
        "DATE",
        "TEXT",
        "TEXT",
        "FLOAT",
        "TEXT",
        "NUMBER",
        "TEXT"
    ],
    "description": [
        "Additional information about the assistance request.",
        "Place of performance if available.",
        "Percentage of the cost for which the state or tribal government is responsible.",
        "Cybersyn's unique identifier for a state, joinable to GEOGRAPHY_INDEX.",
        "Total dollars amount obligated.",
        "Unique record identifier from FEMA for the mission assignment.",
        "Dollar amount of the cost for which the state or tribal government is responsible.",
        "Cybersyn's unique identifier for a zip code, joinable to GEOGRAPHY_INDEX.",
        "Estimated end of the mission. Subject to revision.",
        "Date a State or Tribe requested assistance.",
        "Total cost in dollars, as requested by state or tribal government.",
        "Percentage of the cost for which FEMA is responsible.",
        "Date the Mission Assignment was obligated.",
        "Description of the requested assistance.",
        "Identifier for request, used to aggregate funding across multiple days.",
        "Dollar amount of the cost for which FEMA is responsible.",
        "Sequentially FEMA-assigned number used to designate an event or incident declared as a disaster.",
        "Obligation requests may be modified to adjust or add funds. This number identifies those amendments. The value is 0 if there are no amendments.",
        "Name of the entity requesting assistance."
    ]
}