{
    "table_name": "txt",
    "table_fullname": "bigquery-public-data.sec_quarterly_financials.txt",
    "column_names": [
        "submission_number",
        "measure_tag",
        "version",
        "period_end_date",
        "num_quarters",
        "iprx",
        "language",
        "language_decimal",
        "duration_fraction",
        "date_fraction",
        "dimension_hash",
        "num_dimensions",
        "coregistrant",
        "escaped",
        "source_length",
        "text_length",
        "footnote",
        "footnote_length",
        "context",
        "value",
        "_PARTITIONTIME"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "STRING",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "INT64",
        "STRING",
        "BOOL",
        "INT64",
        "INT64",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "TIMESTAMP"
    ],
    "nested_column_names": [
        "submission_number",
        "measure_tag",
        "version",
        "period_end_date",
        "num_quarters",
        "iprx",
        "language",
        "language_decimal",
        "duration_fraction",
        "date_fraction",
        "dimension_hash",
        "num_dimensions",
        "coregistrant",
        "escaped",
        "source_length",
        "text_length",
        "footnote",
        "footnote_length",
        "context",
        "value"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "STRING",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "INT64",
        "STRING",
        "BOOL",
        "INT64",
        "INT64",
        "STRING",
        "INT64",
        "STRING",
        "STRING"
    ],
    "description": [
        "Accession Number. The 20-character string formed from the 18-digit number assigned by the Commission to each EDGAR submission. submission_number: [adsh]",
        "The unique identifier (name) for a tag in a specific taxonomy release. measure_tag: [tag]",
        "For a standard tag, an identifier for the taxonomy; otherwise the accession number where the tag was defined. For example, \\\"invest/2013\\\" indicates that the tag is defined in the 2013 INVEST taxonomy.",
        "The end date for the data value, rounded to the nearest month end. period_end_date:[ddate]",
        "The count of the number of quarters represented by the data value, rounded to the nearest whole number. A point in time value is represented by 0. num_quarters:[qtrs]",
        "A positive integer to distinguish different reported facts that otherwise would have the same primary key. For most purposes, data with iprx greater than 1 are not needed. The priority for the fact based on higher precision, closeness of the end date to a month end, and closeness of the duration to a multiple of three months. See fields dcml, durp and datp below.",
        "The ISO language code of the fact content. language:[lang]",
        "The value of the fact \\\"xml:lang\\\" attribute, en-US represented by 32767, other \\\"en\\\" dialects having lower values, and other languages lower still. language_decimal: [dcml]",
        "The difference between the reported fact duration and the quarter duration (qtrs), expressed as a fraction of 1. For example, a fact with duration of 120 days rounded to a 91-day quarter has a durp value of 29/91 = +0.3187. duration_fraction: [durp]",
        "The difference between the reported fact date and the month-end rounded date (ddate), expressed as a fraction of 1. For example, a fact reported for 29/Dec, with ddate rounded to 31/Dec, has a datp value of minus 2/31 = -0.0645. date_fraction: [datp]",
        "The 32-byte hexadecimal key for the dimensional information in the DIM data set. dimension_hash: [dimh]",
        "Small integer representing the number of dimensions, useful for sorting. Note that this value is function of the dimension segments. num_dimensions: [dimn]",
        "If specified, indicates a specific co-registrant, the parent company, or other entity (e.g., guarantor). NULL indicates the consolidated entity. Note that this value is a function of the dimension segments. coregistrant: [coreg]",
        "Flag indicating whether the value has had tags removed.",
        "Number of bytes in the original, unprocessed value. Zero indicates a NULL value. source_length: [srclen]",
        "The original length of the whitespace normalized value, which may have been greater than 8192. text_length: [txtlen]",
        "The plain text of any superscripted footnotes on the value, as shown on the page, truncated to 512 characters, or if there is no footnote, then this field will be blank.",
        "Number of bytes in the plain text of the footnote prior to truncation. footnote_length: [footlen]",
        "The value of the contextRef attribute in the source XBRL document, which can be used to recover the original HTML tagging if desired.",
        "The value, with all whitespace normalized, that is, all sequences of line feeds, carriage returns, tabs, non-breaking spaces, and spaces having been collapsed to a single space, and no leading or trailing spaces. Escaped XML that appears in EDGAR \\\"Text Block\\\" tags is processed to remove all mark-up (comments, processing instructions, elements, attributes). The value is truncated to a maximum number of bytes. The resulting text is not intended for end user display but only for text analysis applications."
    ],
    "sample_rows": [
        {
            "submission_number": "0001193125-16-628942",
            "measure_tag": "AcquisitionRelatedOtherExpensesPolicy",
            "version": "0001193125-16-628942",
            "period_end_date": 20160531,
            "num_quarters": 4,
            "iprx": 0,
            "language": "en-US",
            "language_decimal": 32767,
            "duration_fraction": 0.0,
            "date_fraction": 0.0,
            "dimension_hash": "0x00000000",
            "num_dimensions": 0,
            "coregistrant": null,
            "escaped": true,
            "source_length": 46908,
            "text_length": 1392,
            "footnote": null,
            "footnote_length": 0,
            "context": "D-FY2016",
            "value": "Acquisition Related and Other Expenses Acquisition related and other expenses consist of personnel related costs for transitional and certain other employees, stock-based compensation expenses, integration related professional services, certain business combination adjustments including certain adjustments after the measurement period has ended and certain other operating items, net. Stock-based compensation expenses included in acquisition related and other expenses resulted from unvested stock options and restricted stock -based awards assumed from acquisitions whereby vesting was accelerated upon termination of the employees pursuant to the original terms of those stock options and restricted stock -based awards. Year Ended May 31, (in millions) 2016 2015 2014 Transitional and other employee related costs $ 45 $ 57 $ 27 Stock-based compensation 3 5 10 Professional fees and other, net 10 (35) 20 Business combination adjustments, net (16) 184 (16) Total acquisition related and other expenses $ 42 $ 211 $ 41 Included in acquisition related and other expenses for fiscal 2016 and 2015 were an acquisition related benefit of $19 million and a litigation related benefit of $53 million, respectively. Further, acquisition related and other expenses for fiscal 2015 included a loss of $186 million related to goodwill impairment (refer to Note 7 below for additional information)."
        },
        {
            "submission_number": "0001409375-16-000039",
            "measure_tag": "OtherLongTermAssetsPolicyTextBlock",
            "version": "0001409375-16-000039",
            "period_end_date": 20160331,
            "num_quarters": 4,
            "iprx": 0,
            "language": "en-US",
            "language_decimal": 32767,
            "duration_fraction": 0.0,
            "date_fraction": 0.0,
            "dimension_hash": "0x00000000",
            "num_dimensions": 0,
            "coregistrant": null,
            "escaped": true,
            "source_length": 575,
            "text_length": 128,
            "footnote": null,
            "footnote_length": 0,
            "context": "FD2015Q4YTD",
            "value": "Deferred financing costs related to debt issuances are allocated to interest expense over the life of the debt ( 1 to 3 years )."
        },
        {
            "submission_number": "0000101830-16-000066",
            "measure_tag": "ScheduleofSupplementalBalanceSheetDisclosureTableTextBlock",
            "version": "0000101830-16-000066",
            "period_end_date": 20160331,
            "num_quarters": 4,
            "iprx": 0,
            "language": "en-US",
            "language_decimal": 32767,
            "duration_fraction": 0.0,
            "date_fraction": 0.0,
            "dimension_hash": "0x00000000",
            "num_dimensions": 0,
            "coregistrant": null,
            "escaped": true,
            "source_length": 64982,
            "text_length": 1516,
            "footnote": null,
            "footnote_length": 0,
            "context": "FD2015Q4YTD",
            "value": "March 31, March 31, 2016 2015 (in millions) Accounts and notes receivable, net Trade $ 899 $ 1,037 Unbilled trade and other 239 1,457 Less allowances for doubtful accounts and deferred interest (39 ) (204 ) $ 1,099 $ 2,290 Prepaid expenses and other current assets Prepaid expenses $ 366 $ 401 Deferred purchase price for Receivables Facility 1,155 1,198 Deferred charges and other 399 291 $ 1,920 $ 1,890 Other assets Deferred purchase price for Handset Sale-Leaseback Tranche 1 $ 116 $  Unbilled trade installment receivables, net  361 Investments 187 151 Other 425 376 $ 728 $ 888 Accounts payable (1) Trade $ 2,567 $ 3,786 Accrued interconnection costs 142 198 Capital expenditures and other 190 363 $ 2,899 $ 4,347 Accrued expenses and other current liabilities Deferred revenues $ 1,456 $ 1,385 Accrued taxes 232 238 Payroll and related 339 589 Severance, lease and other exit costs 288 223 Accrued interest 532 525 Accrued capital expenditures 149 705 Other 1,378 1,628 $ 4,374 $ 5,293 Other liabilities Deferred rental income-communications towers $ 218 $ 229 Deferred rent 478 366 Asset retirement obligations 550 584 Unfavorable lease liabilities 658 856 Post-retirement benefits and other non-current employee related liabilities 994 987 Other 1,104 929 $ 4,002 $ 3,951 ______________________ (1) Includes liabilities in the amounts of $66 million and $90 million as of March 31, 2016 and 2015 , respectively, for checks issued in excess of associated bank balances but not yet presented for collection."
        },
        {
            "submission_number": "0000101830-16-000066",
            "measure_tag": "ScheduleOfIncomeTaxExpenseBenefitAllocatedToOtherItemsTextBlock",
            "version": "0000101830-16-000066",
            "period_end_date": 20160331,
            "num_quarters": 4,
            "iprx": 0,
            "language": "en-US",
            "language_decimal": 32767,
            "duration_fraction": 0.0,
            "date_fraction": 0.0,
            "dimension_hash": "0x00000000",
            "num_dimensions": 0,
            "coregistrant": null,
            "escaped": true,
            "source_length": 24388,
            "text_length": 586,
            "footnote": null,
            "footnote_length": 0,
            "context": "FD2015Q4YTD",
            "value": "Income tax (expense) benefit allocated to other items was as follows: Successor Predecessor Year Ended March 31, Year Ended March 31, Three Months Ended March 31, Year Ended December 31, 191 Days Ended July 10, Three Months Ended March 31, 2016 2015 2014 2013 2013 2013 (Unaudited) (in millions) Unrecognized net periodic pension and other postretirement benefit cost (1) $  $  $  $ (58 ) $ (18 ) $ (10 ) Unrealized holding gains/losses on securities (1) $  $  $ (1 ) $ (3 ) $  $ (1 ) _______________ (1) These amounts have been recognized in accumulated other comprehensive loss."
        },
        {
            "submission_number": "0000101830-16-000066",
            "measure_tag": "StockholdersEquityAndEarningsPerShareTextBlock",
            "version": "0000101830-16-000066",
            "period_end_date": 20160331,
            "num_quarters": 4,
            "iprx": 0,
            "language": "en-US",
            "language_decimal": 32767,
            "duration_fraction": 0.0,
            "date_fraction": 0.0,
            "dimension_hash": "0x00000000",
            "num_dimensions": 0,
            "coregistrant": null,
            "escaped": true,
            "source_length": 20169,
            "text_length": 3276,
            "footnote": null,
            "footnote_length": 0,
            "context": "FD2015Q4YTD",
            "value": "Stockholders' Equity and Per Share Data Our certificate of incorporation authorizes 10,020,000,000 shares of capital stock as follows:  9,000,000,000 shares of common stock, par value $0.01 per share;  1,000,000,000 shares of non-voting common stock, par value $0.01 per share; and  20,000,000 shares of preferred stock, par value $0.0001 per share. Classes of Common Stock Voting Common Stock The holders of our common stock are entitled to one vote per share on all matters submitted for action by the stockholders. There were approximately 4.0 billion shares of common stock outstanding as of March 31, 2016 . Treasury Shares Shares of common stock repurchased by us are recorded at cost as treasury shares and result in a reduction of stockholders' equity. We reissue treasury shares as part of our stockholder approved stock-based compensation programs, as well as upon conversion of outstanding securities that are convertible into common stock. When shares are reissued, we determine the cost using the FIFO method. Dividends We did not declare any dividends on our common shares for all periods presented in the consolidated financial statements. We are currently restricted from paying cash dividends by the terms of our revolving bank credit facility, EDC Agreement and all other equipment credit facilities (see Note 9. Long-Term Debt, Financing and Capital Lease Obligations) . Accumulated Other Comprehensive Loss The components of accumulated other comprehensive loss, net of tax were as follows: March 31, 2016 2015 (in millions) Unrecognized net periodic pension and postretirement benefit cost $ (407 ) $ (388 ) Unrealized net gains related to investments  1 Foreign currency translation adjustments (32 ) (21 ) Accumulated other comprehensive loss $ (439 ) $ (408 ) Per Share Data Basic net loss per common share is calculated by dividing net loss by the weighted average number of common shares outstanding during the period. Diluted net loss per common share adjusts basic net loss per common share, computed using the treas"
        }
    ]
}