{
    "table_name": "NEW_YORK_SUBWAY.ROUTES",
    "table_fullname": "NEW_YORK_PLUS.NEW_YORK_SUBWAY.ROUTES",
    "column_names": [
        "route_long_name",
        "route_describe",
        "route_type",
        "route_short_name",
        "route_id"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "Contains the full name of a route. This name is generally more descriptive than the name from route_short_name and often includes the route's destination or stop.",
        "",
        "\"Describes the type of transportation used on a route. The following are valid values for this field:  -  light_rail: Streetcar or light rail. Used for any light rail or street-level system within a metropolitan area. -  subway: Subway or metro. Used for any underground rail system within a metropolitan area. -  rail: Used for intercity or long-distance travel. -  bus: Used for short- and long-distance bus routes. -  ferry: Used for short- and long-distance boat service. -  cable_car: Used for street-level cable cars where the cable runs beneath the car. -  tram: Gondola or suspended cable car. Typically used for aerial cable cars where the car is suspended from the cable. -  funicular: Used for any rail system that moves on steep inclines with a cable traction system.\"",
        "Contains the short name of a route. This is a short, abstract identifier like 32, 100X, or Green that riders use to identify a route, but which doesn't give any indication of what places the route serves.",
        "Unique identifier for each route. A single route will have multiple trips"
    ],
    "sample_rows": [
        {
            "route_id": "GS",
            "route_short_name": "S",
            "route_long_name": "42 St Shuttle",
            "route_describe": "Operates in Manhattan between Grand Central and Times Square. The shuttle provides a free transfer between 4, 5, 6, and 7 service at Grand Central-42 St and A, C, E, N, Q, R, W, 1, 2, 3, and 7 service at Times Square-42 St. The shuttle runs at all times except during late nights, from about 12 midnight to 6 AM.",
            "route_type": "1"
        },
        {
            "route_id": "E",
            "route_short_name": "E",
            "route_long_name": "8 Avenue Local",
            "route_describe": "Trains operate between Jamaica Center (Parsons/Archer), Queens, and World Trade Center, Manhattan, at all times. E trains operate express in Queens at all times except late nights when they operate local.",
            "route_type": "1"
        },
        {
            "route_id": "W",
            "route_short_name": "W",
            "route_long_name": "Broadway Local",
            "route_describe": "Trains operate from Astoria-Ditmars Boulevard, Queens, to Whitehall St, Manhattan, on weekdays only.",
            "route_type": "1"
        },
        {
            "route_id": "N",
            "route_short_name": "N",
            "route_long_name": "Broadway Local",
            "route_describe": "Trains operate from Astoria-Ditmars Boulevard, Queens, to Stillwell Avenue, Brooklyn, at all times. N trains in Manhattan operate along Broadway and across the Manhattan Bridge to and from Brooklyn. Trains in Brooklyn operate along 4th Avenue, then through Borough Park and Gravesend. Trains typically operate local in Queens and express in Manhattan and Brooklyn. Late night trains operate local in Manhattan and to/from Brooklyn via Whitehall St, Manhattan. Weekends N trains operate local in Manhattan.",
            "route_type": "1"
        },
        {
            "route_id": "7",
            "route_short_name": "7",
            "route_long_name": "Flushing Local",
            "route_describe": "Trains operate between Main St-Flushing, Queens, and 34th-Hudson Yards, Manhattan, at all times. ",
            "route_type": "1"
        }
    ]
}