{
    "table_name": "PATENTSVIEW.BRF_SUM_TEXT",
    "table_fullname": "PATENTSVIEW.PATENTSVIEW.BRF_SUM_TEXT",
    "column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "trk41aa0c2vx03i8zta2low1w",
            "patent_id": "8340917",
            "text": "BACKGROUND Research in many areas of biotechnology, such as drug discovery, disease analysis, and crop improvements, involves matching fragments of sequences that are generated from a sample, with long sequences that represent biological components. For example, the human genome is a double helix of sequences of nucleotides, where one sequence is a complement of the other. There are 4 nucleotides in DNA sequences, more in RNA and protein sequences. Each nucleotide in a DNA sequence is represented by a character from the alphabet {a,c,t,g}. Each strand of the double helix that constitutes the human genome is a sequence of more than 3 billion characters. The 2 strands are not independent. For each character position in one strand, there is a complementary character in the corresponding position of the second strand. The characters a and t are complements of one another, and the characters c and g are complements of one another. Each character is also called a base, hence a genomic sequence is often said to contain more than 3 billion base-pairs (a base and its complement). An average laboratory test of a DNA sample takes hours to days, and typically generates over 100 million test fragments, each having a small number of letters, usually between 36 and 500 letters. Although test fragments are in the form of a single strand, a test fragment must be matched against both strands because it is unknown from which strand the test fragment originates. Typically, the test fragments are individually matched to selected chromosomes in a process that may take many hours or days. Matching between the fragments and the chromosomes typically allows for 1 or 2 errors in the match, such as mismatched letters or surplus characters in the fragment, to account for experimental errors. Some algorithms that perform fragment matching while allowing for errors are called BLAST algorithms. BLAST algorithms utilize in-memory analysis and are computationally intensive. Thus, they are generally inadequate for the high numbers of fragments that are generated for matching."
        },
        {
            "uuid": "3su3q8p4ekjd6xhnx2t4jys8t",
            "patent_id": "9223704",
            "text": "BACKGROUND The present disclosure relates to a memory access control circuit, and more particularly, to a memory access control circuit, prefetch circuit, memory device and information processing system for gaining burst access to a memory. A processor uses a memory both as an instruction storage area and as a data storage area. Therefore, it is necessary for the processor to access the memory highly frequently during the execution of a program. In order to reduce the burden on the memory resulting from such frequent accesses, a cache memory is provided between the processor and memory. A cache memory manages a plurality of continuous words as a line. Therefore, the plurality of words are filled altogether at the time of a cache mishit. At this time, a burst transfer is used to transfer data from the memory. In order to achieve transfer of a plurality of words using a burst transfer, a system is known which can change the sequence of the words to be transferred by using the wraparound function adapted to wrap around the addresses in a specific range. For example, a data processor has been proposed which allows different types of burst transfer such as four-burst wrap (WRAP4), eight-burst wrap (WRAP8) and 16-burst wrap (WRAP16) to be specified (refer, for example, to Japanese Patent Laid-Open No. 2006-155488). As the memory becomes increasingly layered, a prefetch buffer may be provided between the cache memory and memory. In this case, the size in which the prefetch buffer is managed is likely larger than the line size of the cache memory, thus resulting in a larger burst transfer size. For example, if the processor requests a four-burst wrap, it is likely that the prefetch buffer may request a 16-burst wrap to the memory. If the wraparound function is used in this case, and if the start address is the third word as illustrated in FIG. 7A , the remaining zeroth to second words are not transferred quickly, thus causing the processor to stall. The present disclosure has been made in light of the foregoing, and it is desirable, when generating a wraparound memory access request, different in size from the original, to perform start address conversion so as to reduce the processor stall cycles. According to a first mode of the present disclosure, there are provided a memory access control circuit, prefetch buffer, memory device and information processing system. Each of the memory access control circuit, memory device and information processing system includes a determination section, request generation section and address conversion section. The determination section determines whether a target requested by a first wraparound memory access request from a processor is stored in the prefetch buffer. The request generation section generates a second wraparound memory access request including the target if it is determined that the target is not stored in the prefetch buffer. The address conversion section converts the start address of the first wraparound memory access request according to predetermined rules for use as a start address of the second wraparound memory access request. This speeds up the time it takes to complete the response to the first wraparound memory access request, thus providing reduced processor stall cycles. Further, in the first mode, the address conversion section may achieve the address conversion by replacing a lower bit portion of the unit of burst of the start address of the first wraparound memory access request with a predetermined value. In this case, the address conversion section may achieve the address conversion by replacing, of the start address of the first wraparound memory access request, the lower bit portion appropriate in length to the wraparound size of the first wraparound memory access request with the predetermined value. Further, the address conversion section may achieve the address conversion by replacing the lower bit portion of the start address of the first wraparound memory access request with zeros. In particular, if the first wraparound memory access request is intended to request a four-burst wraparound, and if the second wraparound memory access request is intended to request a 16-burst wraparound, the address conversion section may achieve the address conversion by replacing the lower two bits of the unit of burst of the start address of the first wraparound memory access request with zeros. Further, if the first wraparound memory access request is intended to request a four-burst wraparound, and if the second wraparound memory access request is intended to request an eight-burst wraparound, the address conversion section may achieve the address conversion by replacing the lower two bits of the unit of burst of the start address of the first wraparound memory access request with zeros. Still further, if the first wraparound memory access request is intended to request an eight-burst wraparound, and if the second wraparound memory access request is intended to request a 16-burst wraparound, the address conversion section may achieve the address conversion by replacing the lower three bits of the unit of burst of the start address of the first wraparound memory access request with zeros. The present disclosure performs start address conversion when generating a wraparound memory access request, different in size from the original, thus providing reduced processor stall cycles."
        },
        {
            "uuid": "b0qs060fwm3tavltiwk2ye9wl",
            "patent_id": "4140085",
            "text": "The invention relates to a method and an apparatus for controlling the proportion of fuel and air in a combustible fuel-air mixture fed to an internal combustion engine. More particularly, the invention relates to an apparatus in which an oxygen sensor (.lambda.-sensor) monitors the exhaust gas composition and generates a signal which is used in influencing the fuel-air ratio. For this purpose, the sensor signal is compared with a set-point or threshold value. Known in the art are systems which determine the duration of fuel injection control pulses by disposing in the exhaust system a .lambda.-sensor which generates an electrical signal that alternates abruptly between a higher and lower voltage depending on whether the mixture fed to the engine is rich or lean. This output signal is used as the actual value in a control loop and is used by the fuel injection system to determine the duration of the control pulses used to actuate the injection valves. The basic duration of the fuel injection control pulses is determined on the basis of two major variables, i.e., the engine rpm and the air flow rate aspirated by the engine. The fuel injection control pulses are generated in synchronism with crankshaft rotations. In this previously proposed system, an attempt is made to maintain the .lambda. control in the critical temperature domain, where the sensor has a very high internal resistance and is capable only to generate signals which are substantially shifted in voltage, by permitting the threshold or set-point voltage with which the sensor output is compared to follow the changing sensor potential. In this process, however, considerable non-linearities are produced. It is also particularly disadvantageous that aging an a dispersion of the characteristics of the sensor make the adjustment and the control process very difficult in this critical temperature domain. It is a principal object of the present invention to provide a fuel injection system with a method and an apparatus to permit reliable controlled operation of the fuel injection system even at relatively low oxygen sensor temperatures. It is a further object of the invention to provide a circuit for carrying out this method which is simply constructed and relatively inexpensive. Yet another object of the invention is to provide a method and an apparatus which permits the engine warm-up with .lambda. control and with favorable exhaust gas compositions. Yet another object of the invention is to provide a method and an apparatus for comparing the sensor voltage with a fixed set-point threshold, thereby preventing a dependence of changes in the characteristics of the sensor due to aging or dispersion. These and other objects are attained according to the invention by providing a method and an apparatus in which the proportion of fuel and air in a fuel-air mixture is controlled by providing an oxygen sensor which generates an actual value signal and by further providing a closed control loop which permits a precise adjustment of the proportions of the fuel-air ratio. The invention provides that the changing internal resistance of the .lambda.-sensor is monitored and that the .lambda.-sensor is supplied with a changing current so as to linearize the output voltage generated by the .lambda.-sensor and to counteract any distortion in the output voltage. The invention then provides a comparison of the sensor output voltage with an opposing comparison voltage. A special circuit responds to the changing DC voltage from the sensor and supplies an appropriate compensation current to the sensor. The invention will be better understood as well as further objects and advantages thereof become more apparent from the ensuing detailed description of two preferred exemplary embodiments of the invention taken in conjunction with the drawing."
        },
        {
            "uuid": "tqszodoh1hdqy84ugu3qbxpky",
            "patent_id": "5753729",
            "text": "The invention relates to coating compositions stabilized against damage by light, heat and oxygen, which contain as stabilizer a 2-(2'-hydroxyphenyl)-1,3-pyrimidine derivative, to new compounds of the 2-(2'hydroxyphenyl)-1,3-pyrimidine type, to their use for stabilizing organic material and to corresponding compositions. If it is desired to increase the light stability of an organic material, especially a coating, it is conventional to add a light stabilizer. One class of light stabilizers which is very frequently employed is that of the UV absorbers, which protect the material by absorbing the damaging radiation via chromophores. The most commonly used types of UV absorbers are 2-hydroxybenzophenones and 2-(2-hydroxyphenyl)benzotriazoles. In more recent literature, triphenyl-triazines are also mentioned as stabilizers for coating materials, for example in the publications U.S. Pat. No. 4,619,956, EP-A-434,608, EP-A-442,847 and EP-A-502,816, or as stabilizers for polycarbonate (U.S. Pat. No. 5,288,778). Some o-hydroxy-substituted triphenylpyrimidines have also already been proposed as light stabilizers. U.S. Pat. No. 3,442,898 describes the protective action of some compounds of this type against UV radiation in, for example, acetylcellulose, polyamide, polyvinyl chloride and polypropylene. The teaching of U.S. Pat. No. 4,895,981 comprises their use as light stabilizers for polyester fibre materials. Heller and Blattmann, Pure Appl. Chem. 36, 141 (1973) report on the use of some o-hydroxy-substituted triphenylpyrimidines in polyester. They come to the conclusion that these compounds, in polyester, have a comparatively small light stabilization effect and contribute to the accelerated discolouration of the substrate. It has now been found that certain 2-(2'-hydroxyphenyl)-1,3-pyrimidine derivatives are surprisingly good stabilizers for coating compositions. The invention relates to a coating composition comprising A) a binder based on an organic polymer and B) as stabilizer against damage by light, heat and oxygen, a compound of the formula I ##STR2## in which R.sub.1 and R.sup.2 independently of one another are H; OH; C.sub.1 -C.sub.12 alkyl; cyclohexyl or tritluoromethyl; R.sup.3 and R.sup.4 independently of one another have one of the definitions of R.sup.7 or are OR.sup.7 or halogen; R.sup.5 has one of the definitions given for R.sup.7 or is halogen; --O--CO--R.sup.12 ; --O--SO.sub.2 --R.sup.13 or --O--R.sup.7 ; R.sup.6 is H; C.sub.2 -C.sub.18 alkenyl; --X--Z.sup.3 ; benzoyl which is unsubstituted or substituted on the phenyl ring by methyl, halogen, --CN or methoxy; --C(Z.sup.3).dbd.N--Z.sup.3 ; --CH(Z.sup.3)--NH--Z.sup.3 ; a radical of the formula ##STR3## or a radical of the formula ##STR4## R.sup.7 is hydrogen; C.sub.1 -C.sub.18 alkyl; C.sub.5 -C.sub.18 alkyloxycarbonyl; or C.sub.2 -C.sub.18 alkenyl; or R.sup.7 is C.sub.1 -C.sub.18 alkyl which is substituted by OH, C.sub.1 -C.sub.18 alkoxy, C.sub.2 -C.sub.18 alkanoyl, C.sub.2 -C.sub.8 alkenyloxy, halogen, --COOH, --COOR.sup.8, --CONH.sub.2, --CONHR.sup.9, --CON(R.sup.9)(R.sup.10), --NH.sub.2, --NHR.sup.9, --N(R.sup.9)(R.sup.10), --NHCOR.sup.11, --CN, --OCOR.sup.1, a group of the formula ##STR5## and/or phenoxy which is unsubstituted or is substituted by C.sub.1 -C.sub.18 alkyl, C.sub.1 -C.sub.18 alkoxy or halogen; or R.sup.7 is C.sub.4 -C.sub.20 alkyl which is interrupted by O and substituted by OH or C.sub.1 -C.sub.12 alkoxy; glycidyl; C.sub.5 -C.sub.8 cycloalkyl; cyclohexyl which is substituted by OH, C.sub.1 -C.sub.4 alkyl or --OCOR.sup.11 ; or C.sub.7 -C.sub.11 phenylalkyl which is unsubstituted or substituted by OH, Cl or CH.sub.3 ; R.sup.8 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.6 hydroxyalkyl; C.sub.3 -C.sub.18 alkenyl; C.sub.3 -C.sub.20 alkyl which is interrupted by O, N or S and/or substituted by OH; C.sub.1 -C.sub.4 alkyl which is substituted by --P(O)(OR.sup.14).sub.2, --N(R.sup.9)(R.sup.10) or --OCOR.sup.11 and/or OH; glycidyl; cyclohexyl or C.sub.7 -C.sub.11 phenylalkyl; or is a group of the formula ##STR6## R.sup.9 and R.sup.10 independently of one another are C.sub.1 -C.sub.12 alkyl; C.sub.3 -C.sub.12 alkoxyalkyl; C.sub.4 -C.sub.16 dialkylaminoalkyl or C.sub.5 -C.sub.12 cycloalkyl or R.sup.9 and R.sup.10 together are C.sub.3 -C.sub.9 alkylene or -oxaalkylene or -azaalkylene; R.sup.11 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkenyl or phenyl; R.sup.12 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkeny; phenyl; or --R.sup.15 --O--CO--R.sup.11 ; or is a group of the formula ##STR7## R.sup.13 is C.sub.1 -C.sub.12 alkyl; phenyl; naphthyl or C.sub.7 -C.sub.14 alkylphenyl; and R.sup.14 is C.sub.1 -C.sub.12 alkyl or phenyl; R.sup.15 is C.sub.1 -C.sub.18 alkylene or C.sub.2 -C.sub.18 alkenylene; R.sup.16 is hydrogen; oxide; C.sub.1 -C.sub.8 alkanoyl; C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 -hydroxyalkyl; C.sub.3 -C.sub.18 hydroxyalkyl which is interrupted by O; C.sub.1 -C.sub.18 alkoxy; C.sub.5 -C.sub.8 cycloalkyl; C.sub.5 -C.sub.8 cycloalkoxy; C.sub.7 -C.sub.11 lphenylalkyl; C.sub.7 -C.sub.11 phenylalkyl which is substituted on the phenyl ring by from 1 to 3 radicals C.sub.1 -C.sub.4 -alkyl or C.sub.1 -C.sub.8 alkanoyl; or C.sub.7 -C.sub.11 phenylalkoxy; X is a direct bond or --CO--; Z.sup.1 and Z.sup.2 independently of one another are C.sub.1 -C.sub.12 alkyl or together are C.sub.4 -C.sub.10 alkylene which may be interrupted by an oxygen atom; Z.sup.3 is C.sub.1 -C.sub.20 -Alkyl; and Z.sup.4 is hydrogen or methyl. A halogen substituent is --F, --Cl, --Br or --I; it is preferably --Cl or --Br, especially --Cl. In formula I the line protruding into the phenyl ring and carrying the symbol R.sup.6 is a substituent which is located at one of the three remaining free positions, in the o-, m- or p-position to the phenolic OH group. The substituent R.sup.6 is preferably in the o- or p-position to the phenolic OH group, especially in the p-position. R.sup.6 includes, for example, hydrogen, C.sub.1 -C.sub.12 alkyl; C.sub.6 -C.sub.18 alkanoyl; benzoyl; methylbenzoyl; dimethylbenzoyl; benzoyl which is substituted by --Cl, --Br, --CN or --OCH.sub.3 ; .alpha.-methylbenzyl; .alpha.,.alpha.-dimethylbenzyl; N,N-dialkylaniinomethyl; 1-piperidylmethyl; 1-(4-oxapiperidyl)methyl; an imide of an acyl radical; and .alpha.-(N-alkylamino)alkyl. R.sup.6 is preferably hydrogen, C.sub.1 -C.sub.6 alkyl, benzoyl, .alpha.-methylbenzyl, allyl or a radical of the formula ##STR8## or ##STR9## for example hydrogen or C.sub.1 -C.sub.6 -alkyl or allyl, particularly hydrogen or methyl and especially hydrogen. Alkyl R.sup.1, R.sup.2, R.sup.3, R.sup.4, R.sup.5, R.sup.6, R.sup.7, R.sup.8, R.sup.9, R.sup.10, R.sup.11, R.sup.12, R.sup.13, R.sup.14, R.sup.16, Z.sup.1 and Z.sup.2 in the context of the definitions given is branched or unbranched alkyl such as methyl, ethyl, propyl, isopropyl, n-butyl, sec-butyl, isobutyl, t-butyl, 2-ethylbutyl, n-pentyl, isopentyl, 1-methylpentyl, 1,3-dimethylbutyl, n-hexyl, 1-methylhexyl, n-heptyl, isoheptyl, 1,1,3,3-tetramethylbutyl, 1-methylheptyl, 3-methylheptyl, n-octyl, 2-ethylhexyl, 1,1,3-trimethylhexyl, 1,1,3,3-tetramethylpentyl, nonyl, decyl, undecyl, 1-methylundecyl, dodecyl, 1,1,3,3,5,5-hexamethylhexyl, tridecyl, tetradecyl,pentadecyl, hexadecyl, heptadecyl and octadecyl. Alkyl R.sup.1, R.sup.2, R.sup.3, R.sup.4, R.sup.5, R.sup.6, R.sup.8, R.sup.9, R.sup.10, R.sup.11, R.sup.12, R.sup.13, R.sup.14 and R.sup.16 is preferably C.sub.1 -C.sub.8 alkyl, especially C.sub.1 -C.sub.4 alkyl such as methyl or tert-butyl, in particular methyl. R.sup.6 as alkanoyl is, for example, acetyl, propionyl, butyryl, valeryl, caproyl, caprylyl, caprinyl, lauroyl, myristyl, palmitoyl, or stearyl; C.sub.6 -C.sub.18 -alkanoyl is preferred. Examples of C.sub.1-C.sub.18 alkoxy R.sup.3, R.sup.4, R.sup.5 and R.sup.16 are methoxy, ethoxy, propoxy, isopropoxy, butoxy, isobutoxy, tert-butoxy, pentoxy, hexoxy, heptoxy, octyloxy, nonyloxy, decyloxy, undecyloxy, dodecyloxy, tridecyloxy, tetradecyloxy, pentadecyloxy, hexadecyloxy, heptadecyloxy or octadecyloxy; preference is given to C.sub.4 -C.sub.12 alkoxy, for example n-butoxy, n-pentoxy, n-hexoxy, n-heptoxy, n-octyloxy, 1-ethylhexyloxy, n-nonyloxy and n-decyloxy. Substituted C.sub.1 -C.sub.12 alkyloxy R.sup.3, R.sup.4 and R.sup.5 is preferably alkoxyalkyloxy, hydroxyalkyloxy interrupted by O, alkyloxy substituted by ##STR10## or ##STR11## or alkyloxy which is substituted by alkenyloyloxy and/or hydroxyl; particularly interesting examples of R.sup.3, R.sup.4 and R.sup.5 are --OCH.sub.2 CH.sub.2 OCOCH.dbd.CH.sub.2, --OCH.sub.2 CH(OH)C.sub.8 H.sub.17, --OCH.sub.2 CH(OH)C.sub.12 H.sub.25, --OCH.sub.2 CH(OH)CH.sub.2 OC.sub.8 H .sub.17, --OCH.sub.2 CH(OH)CH.sub.2 O--(CH.sub.2 .paren close-st..sub.12-14 CH.sub.3, --OCH.sub.2 CH(OH)CH.sub.2 OCOC(CH.sub.3).dbd.H.sub.2, --OCH.sub.2 CH(OH)CH.sub.2 OCOCH.dbd.CH.sub.2, ##STR12## R.sup.1, R.sup.2, R.sup.3 and R.sup.4 are particularly preferably hydrogen or methyl. Of particular interest are compounds in which the radicals R.sup.1, R.sup.2, R.sup.3 and R.sup.4 are identical. C.sub.3 -C.sub.18 -Alkenyl R.sup.7, R.sup.8, R.sup.11 and R.sup.12 comprises, inter alia, allyl, isopropenyl, 2-butenyl, 3-butenyl, isobutenyl, n-penta-2,4-dienyl, 3-methyl-but-2-enyl, n-oct-2-enyl, n-dodec-2-enyl, iso-dodecenyl, n-octadec-2-enyl and n-octadec-4-enyl. For R.sup.7, R.sup.11 and R.sup.12 the definition of vinyl is also possible. Alkenyl R.sup.11 and R.sup.12 is particularly preferably --CH.dbd.CH.sub.2 or --C(CH.sub.3).dbd.CH.sub.2. Unsubstituted or substituted C.sub.5 -C.sub.8 cycloalkyl R.sup.7 is for example cyclopentyl, cyclohexyl, cycloheptyl, cyclooctyl, methylcyclohexyl or acetyloxycyclohexyl; cyclohexyl is preferred. R.sup.16 is preferably hydrogen, C.sub.1 -C.sub.8 alkyl, C.sub.2 -C.sub.4 hydroxyalkyl, C.sub.1 -C.sub.18 alkoxy, C.sub.5 -C.sub.8 gcycloalkoxy or substituted or unsubstituted C.sub.7 -C.sub.9 phenylalkyl; it is in particular hydrogen, methyl, C.sub.4 -C.sub.12 alkoxy, hydroxyethyl or cyclohexyloxy. Cycloalkyloxy R.sup.16 is preferably cyclohexyloxy; substituted or unsubstituted C.sub.7 -C.sub.11 phenylalkyl R.sup.16 is preferably benzyl, .alpha.-methylbenzyl or methylphenyl-methyl. Where alkyl radicals carry further substituents, or where individual radicals are alkylene, free valencies and bonds to substituents may extend from the same or from different carbon atoms. Bonds to heteroatoms preferably extend from different carbon atoms. Consequently, substituted C.sub.1 -C.sub.12 alkyl R.sup.7 is for example hydroxyalkyl such as 2-hydroxyethyl, 3-hydroxypropyl or 2-hydroxypropyl; alkoxyhydroxyalkyl such as 2-hydroxy-3-methoxypropyl, 2-hydroxy-3-ethoxypropyl, 2-hydroxy-3-butoxypropyl, 2-hydroxy-3-hexoxypropyl or 2-hydroxy-3-(2-ethylhexyloxy)propyl; alkoxycarbonylalkyl such as methoxycarbonylmethyl, ethoxycarbonylmethyl, butoxycarbonylmethyl, octyloxycarbonylmethyl, 1-octyloxycarbonyl-1-methylmethyl, 1-octyloxycarbonyl-1-ethylmethyl or 1-octyloxycarbonyl-1-hexylmethyl; or alkanoyloxyalkyl or alkenoyloxyalkyl such as 2-(acetyloxy)ethyl, 2-acryloxyethyl or 2-methacryloxyethyl; or for example 3-acryloxy- or 3-methacryloxy-2-hydroxypropyl. C.sub.1 -C.sub.18 Alkylene R.sup.15 is for example methylene, ethylene, propylene, butylene, pentylene, hexylene, heptylene, octylene, nonylene, decylene, undecylene, dodecylene, tridecylene, tetradecylene, pentadecylene, hexadecylene, heptadecylene, octadecylene; C.sub.2 -C.sub.18 alkylene or C.sub.4 -C.sub.12 alkenylene is preferred. Particular preference is given to terminal radicals, i.e. the free valencies are located at the ends of the longest carbon chain. Preferred coatina compositions are those in which the component (B) employed is a compound of the formula Ia ##STR13## in which R.sup.3 and R.sup.4 independently of one another are --H; --OH; C.sub.1 -C.sub.18 alkoxy; --Cl; or --Br or may have one of the definitions of R.sup.7 ; R.sup.5 has one of the definitions given for R.sup.7 or is --Cl; --Br; --O--CO--R.sup.12 ; or --O--R.sup.7 ; R.sup.7 is C.sub.1 -C.sub.18 alkyl; or C.sub.3 -C18alkenyl; or R.sup.7 is C.sub.1 -C.sub.12 alkyl which is substituted by --OH, C.sub.1 -C.sub.18 alkoxy, --COOR.sub.8, --NHCOR.sub.11, --CN, --OCOR.sup.11, a group of the formula ##STR14## and/or phenoxy; or R.sup.7 is C.sub.4 -C.sub.20 alkyl which is interrupted by from 1 to 6 --O-- and substituted by --OH or C.sub.1 -C.sub.12 alkoxy; glycidyl; C.sub.5 -C.sub.8 cycloalkyl; or C.sub.7 -C.sub.11 phenylalkyl; R.sup.8 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.6 hydroxyalkyl; C.sub.3 -C.sub.18 alkenyl; or is a group of the formula ##STR15## R.sup.11 is C.sub.1 -C.sub.18 alkyl or C.sub.2 -C.sub.18 alkenyl; R.sup.12 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkenyl; or --R.sup.15 --O--CO--R.sup.11 ; or is a group of the formula ##STR16## R.sup.15 is C.sub.1-C.sub.18 alkylene or C.sub.4 -C.sub.18 alkenyene; and R.sup.16 is hydrogen; C.sub.2 -C.sub.8 alkanoyl; C.sub.1 -C.sub.12 alkyl; C.sub.1 -C.sub.12 alkoxy; C.sub.5 -C.sub.8 cycloalkyl; C.sub.5 -C.sub.8 cycloalkoxy; or C.sub.7 -C.sub.11 phenylalkyl. The compounds of the formula I which are particularly preferably used as component (B) are those in which R.sup.1 is hydrogen or OH or C.sub.1 -C.sub.4 alkyl; and R.sup.2 is hydrogen or C.sub.1 -C.sub.4 alkyl; R.sup.3 and R.sup.4 independently of one another are hydrogen or --OH or have one of the definitions of R.sup.7 or are OR.sup.7 ; R.sup.5 has one of the definitions given for R.sup.7 or is Cl; --Br; --O--CO--R.sup.2 ; or --O--R.sup.7 ; R.sup.6 is hydrogen or C.sub.1 -C.sub.6 alkyl or allyl; R.sup.7 is C.sub.1 -C.sub.18 alkyl; or C.sub.3 -C.sub.18 alkenyl; or R.sup.7 is C.sub.1 -C.sub.12 alkyl which is substituted by --OH, C.sub.1 -C.sub.18 alkoxy, --COOR.sup.8, a group of the formula ##STR17## and/or --OCOR.sup.11 ; or R.sup.7 is C.sub.7 -C.sub.18 alkyl which is interrupted by from 1 to 6 --O-- and substituted by --OH; C.sub.5 -C.sub.8 cycloalkyl; or C.sub.7 -C.sub.11 phenylalkyl; R.sup.8 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.6 hydroxyalkyl; or C.sub.3 -C.sub.18 alkenyl; or is a group of the formula ##STR18## R.sup.11 is C.sub.1 -C.sub.18 alkyl or C.sub.2 -C.sub.18 alkenyl; R.sup.12 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkenyl; --R.sup.15 --O--CO--CH.dbd.CH.sub.2 ; or --R.sup.15 --O--CO--C(CH.sub.3).dbd.CH.sub.2 ; or is a group of the formula ##STR19## R.sup.15 is C.sub.2 -C.sub.18 alkylene; and R.sup.16 is hydrogen; oxide; C.sub.2 -C.sub.8 alkanoyl; C.sub.1 -C.sub.12 alkyl; hydroxyethyl; C.sub.1 -C.sub.12 alkoxy; C.sub.5 -C.sub.8 cycloalkyl; C.sub.5 -C.sub.8 cycloalkoxy; or C.sub.7 -C.sub.11 phenylalkyl. Among such compounds, particular preference is given to those in which R.sup.1 and R.sup.2 independently of one another are hydrogen or methyl; R.sup.3 and R.sup.4 independently of one another are hydrogen; methyl; or C.sub.1 -C.sub.12 alkyl which is substituted by --OH, C.sub.1 -C.sub.18 alkoxy, --COOR.sup.8 and/or --OCOR.sup.11 ; or are C.sub.1 -C.sub.12 alkoxy which is substituted by --OH, C.sub.1 -C.sub.8 alkoxy, --COOR.sup.8 and/or --OCOR.sup.11 ; R.sup.5 is C.sub.1 -C.sub.18 alkyl; C.sub.3 -C.sub.18 alkenyl; --Cl; --Br; --O--CO--R.sup.12 ; or --O--R.sup.7 ; R.sup.6 is hydrogen or C.sub.1 -C.sub.6 alkyl or allyl; R.sup.7 is C.sub.1 -C.sub.18 alkyl; or C.sub.3 -C.sub.18 alkenyl; or R.sup.7 is C.sub.1 -C.sub.12 alkyl which is substituted by --OH, C.sub.1 -C.sub.18 alkoxy, --COOR.sup.8, a group of the formula ##STR20## and/or --OCOR.sup.11 ; or R.sup.7 is C.sub.7 -C.sub.18 alkyl which is interrupted by from 1 to 3 --O-- and substituted by --OH; R.sup.16 is hydrogen; acetyl; C.sub.1 -C.sub.8 alkyl; C.sub.4 -C.sub.12 alkoxy; C.sub.5 -C.sub.8 cycloalkyl; C.sub.5 -C.sub.8 cycloalkoxy; or benzyl. A particularly emphatic interest is shown in coating compositions comprising as component (B) a compound of the formula I in which R.sup.1 and R.sup.2 independently of one another are hydrogen or methyl; R.sup.3 and R.sup.4 independently of one another are hydrogen, methyl or methoxy and R.sup.6 is hydrogen. Of outstanding interest as component (B) are compounds of the formula I in which R.sup.1 and R.sup.2 are identical and are hydrogen or methyl; R.sup.3 and R.sup.4 are identical and are hydrogen or methyl or methoxy; R.sup.5 is --O--R.sup.7 ; R.sup.6 is hydrogen; R.sup.7 is C.sub.1 -C.sub.18 alkyl; or R.sup.7 is C.sub.1 -C.sub.12 alkyl which is substituted by --OH, C.sub.1 -C.sub.18 alkoxy, --COOR.sup.8, --OCOR.sup.11 and/or a group of the formula ##STR21## R.sup.8 is C.sub.1 -C.sub.12 alkyl; and R.sup.11 is C.sub.1 -C.sub.12 alkyl. The coating composition according to the invention preferably comprises 0.01-10 parts by weight of B, in particular 0.05-10 parts by weight of B and especially 0.1-5 parts by weight of B per 100 parts by weight of solid binder A. A suitable binder (component A) may in principle be any of those common in industry, for example those as described in Ullmann's Encyclopedia of Industrial Chemistry, 5th Ed., Vol. A18, pp. 368-426, VCH, Weinheim 1991. In general it is a film-forming binder based on a thermoplastic or thermosettable resin, predominantly on a thermosettable resin. Examples of these are alkyd, acrylic, polyester, phenolic, melamine, epoxy and polyurethane resins and mixtures thereof. Component A may be a cold-curable or a heat-curable binder; the addition of a curing catalyst may be advantageous. Examples of catalysts suitable for accelerating the curing of the binder are described in Ullmann's Encyclopedia of Industrial Chemistry, Vol. A 18, p. 469, VCH Verlagsgesellschaft, Weinheim 1991. Preferred coating compositions are those in which component A is a binder comprising a functional acrylate resin and a crosslinking agent. Examples of coating compositions containing specific binders are: 1. coating materials based on cold- or hot-crosslinkable alkyd, acrylate, polyester, epoxy or melamine resins or mixtures of these resins, with or without the addition of a curing catalyst; 2. two-component polyurethane coating materials based on hydroxyl group-containing acrylate, polyester or polyether resins and aliphatic or aromatic polyisocyanates; 3. one-component polyurethane coating materials based on blocked polyisocyanates which are deblocked during the baking procedure; 4. two-component coating materials based on (poly)ketimines and aliphatic or aromatic polyisocyanates; 5. two-component coating materials based on (poly)ketimines and an unsaturated acrylate resin or a polyacetoacetate resin or a methacrylamidoglycolate methyl ester; 6. two-component coating materials based on carboxyl or amino group-containing polyacrylates and polyepoxides; 7. two-component coatino materials based on anhydride group-containing acrylate resins and a polyhydroxy or polyamino component; 8. two-component coating materials based on (poly)oxazolines and anhydride group-containing acrylate resins or unsaturated acrylate resins or aliphatic or aromatic polyisocyanates; 9. two-component coating materials based on unsaturated polyacrylates and polymalonates; 10. thermoplastic polyacrylate coating materials based on thermoplastic acrylate resins or acrylate resins which crosslink under the action of external crosslinking agents, in combination with etherified melamine resins; 11. coating systems based on siloxane-modified or tluorine-modified acrylate resins. The coating compositions according to the invention may also be radiation-curable coating compositions. In this case the binder essentially comprises monomeric or oligomeric compounds having ethylenically unsaturated bonds, which are cured after application by UV radiation or electron beams, i.e. are converted into a crosslinked, high molecular weight form. Corresponding systems are described in the abovementioned publication, Ullmann's Encyclopedia of Industrial Chemistry, 5th Ed., Vol. A18, pages 451-453. In radiation-curable coatina compositions the compounds of the formula I may also be employed without the addition of sterically hindered amines. The coating composition according to the invention preferably contains--in addition to components A and B--as component C, a light stabilizer of the sterically hindered amine and/or 2-hydroxyplhenyl-2H-benzolriazole type, such as, for example, those given in the list below under headings 2.1 and 2.6. In order to achieve maximum light resistance, the addition of sterically hindered amines as given in the stated list under 2.6, is of special advantage. The invention therefore also relates to a coating composition which contains in addition to components A and B, as component C, a light stabilizer of the sterically hindered amine type. It is preferably a 2,2,6,6-tetraalkylpiperidine derivative which contains at least one group of the formula ##STR22## in which R is hydrogen or methyl, especially hydrogen. Component C is preferably used in a quantity of 0.05-5 parts by weight per 100 parts by weight of the solid binder. Examples of tetraalkylpiperidine derivatives which can be used as component C are given in U.S. Pat. No. 5,073,278; of special importance are those listed in columns 3-21 under sections a) to f). The sections of this patent document indicated are considered part of this description. It is particularly expedient to employ the following tetraalkylpiperidine derivatives: bis(2,2,6,6-tetramethylpiperid-4-yl)succinate, bis(2,2,6,6-tetramethylpiperid-4-yl)sebacate, bis(1,2,2,6,6-pentamethylpiperid-4-yl)sebacate, di(1,2,2,6,6-pentamethylpiperid-4-yl)butyl(3,5-di-tert-butyl-4-hydroxybenzy l)malonate, bis(1-octyloxy-2,2,6,6-tetramethylpiperid-4-yl)sebacate, tetra(2,2,6,6-tetramethylpiperid-4-yl)butane-1,2,3,4-tetracarboxylate, tetra(1,2,2,6,6-pentamethylpiperid-4-yl)butane-1,2,3,4-tetracarboxylate, 2,2,4,4-tetramethyl-7-oxa-3,20-diaza-21-oxodispiro5.1.11.2!heneicosane, 8-acetyl-3-dodecyl-1,3,8-triaza-7,7,9,9-tetramethylspiro4.5!decane-2,4-dio ne, or a compoud of the formulae ##STR23## where R= ##STR24## where R=where m is 5-50. In addition to components A and B, the coating composition may also contain further components, for example solvents, pigments, dyes, plasticizers, stabilizers, thixotropic agents, drying catalysts and/or levelling assistants. Examples of possible components are those described in Ullmann's Encyclopedia of Industrial Chemistry, 5th Ed., Vol. A18. pp. 429-471, VCH, Weinheim 1991. Examples of possible drying catalysts or curing catalysts are organometallic compounds, amines, resins containing amino groups, and/or phosphines. Organometallic compounds are, for example, metal carboxylates, especially those of the metals Pb, Mn, Co, Zn, Zr or Cu, or metal chelates, especially those of the metals Al, Ti or Zr, or organometallic compounds such as organotin compounds. Examples of metal carboxylates are the stearates of Pb, Mn or Zn, the octanoates of Co, Zn or Cu, the naphthenates of Mn and Co or the corresponding linoleates, resinates or tallates. Examples of metal chelates are the aluminium, titanium or zirconium chelates of acetylacetone, ethyl acetoacetate, salicylaldehyde, salicylaldoxime, o-hydroxyacetophenone or ethyl trifluoroacetoacetate and the alkoxides of these metals. Examples of organotin compounds are dibutyltin oxide, dibutyltin dilaurate or dibutyltin dioctanoate. Examples of amines are in particular tertiary amines such as tributylamine, triethanolamine, N-methyldiethanolamine, N-dimethylethanolamine, N-ethylmorpholine, N-methylmorpholine or diazabicyclooctane (triethylenediamine) and their salts. Other examples are quaternary ammonium salts, for example trimethylbenzylammonium chloride. Resins containing amino groups are simultaneously binder and curing catalyst. Examples of these are acrylate copolymers which contain amino groups. The curing catalyst used can also be a phosphine, for example triphenylphosphine. The coating compositions according to the invention can be applied to any desired substrates, for example to metal, wood, plastic or ceramic materials. They are preferably used as topcoat in the finishing of cars. If the topcoat consists of two coats, the bottom coat being pigmented and the upper coat being non-pigmented, then the coating composition according to the invention can be used for the upper or the bottom coat or for both coats, but preferably for the upper coat. The coating compositions according to the invention can be applied to the substrates by the conventional methods, for example by brushing, spraying, flowcoating, dipping or electrophoresis; see also Ullmann's Encylopedia of Industrial Chemistry, 5th Ed., Vol. A18. pp. 491-500. Depending on the binder system the coatings can be cured at room temperature or by heating. The coatings are preferably cured at 50.degree.-150.degree. C.; higher temperatures may be employed for powder coatings. The coatings obtained in accordance with the invention have an outstanding resistance to the damaging effects of light, oxygen and heat; in particular, reference should be made to the good lightfastness and weathering resistance of the resulting coatings, for example paints. The invention therefore relates also to a coating, in particular a varnish, which is stabilized by containing the compound of the formula I according to the invention against damaging effects of light, oxygen and heat. The varnish is preferably a topcoat for cars. The invention also relates to a method of stabilizing a coating based on organic polymers against damage by light, oxygen and/or heat, which comprises admixing with the coating composition a compound of the formula I, and to the use of compounds of the formula I in coating compositions as stabilizers against damage by light, oxygen and/or heat. In a further embodiment of the method, the binders used are those in which a compound of the formula I is incorporated by copolymerization or copolycondensation. Compounds suitable for this purpose are those of the formula I in which the radical R.sup.5 contains a copolymerizable, ethylenically unsaturated group or a functional group suitable for copolycondensation. In this case the coating composition can only comprise component A. The coating, compositions usually contain an organic solvent or solvent mixture in which the binder is soluble. The coating composition may, however, also be an aqueous solution or dispersion. The vehicle may also be a mixture of an organic solvent and water. The coating, composition may also be a high-solids coating or can be solvent-free (powder coating). The pigments can be inorganic, organic or metallic pigments. The coating compositions according to the invention preferably contain no pigments and are used as clearcoat. A likewise preferred use of the coating composition is as a topcoat for applications in the automotive industry, especially as the pigmented or non-pigmented topcoat of the coating system. However, its use for underlying layers is also possible. Some of the compounds of the formula I described above as component (B) are new compounds. The invention consequently also relates to compounds of the formula Ib ##STR25## in which R.sup.1 and R.sup.2 independently of one another are H; OH; C.sub.1 -C.sub.12 alkyl; cyclohexyl or trifluoromethyl; R.sup.3 and R.sup.4 independently of one another are hydrogen; --OH; C.sub.1 -C.sub.3 alkyl; C.sub.1 -C.sub.3 alkoxy; or halogen or have one of the definitions of R.sup.7 or are OR.sup.7 ; R.sup.5 has one of the definitions given for R.sup.7 or is halogen; C.sub.1 -C.sub.3 alkyl; --O--CO--R.sup.2 ; --O--SO.sub.2 --R.sup.13 or --O--R.sup.7 ; R.sup.6 is H; C.sub.2 -C.sub.18 alkenyl; --X--Z.sup.3 ; benzoyl which is unsubstituted or substituted on the phenyl ring by methyl, halogen, --CN or methoxy; --C(Z.sup.3).dbd.N--Z.sup.3 ; --CH(Z.sup.3)--NH--Z.sup.3 ; a radical of the formula ##STR26## or a radical of the formula ##STR27## R.sup.7 is C.sub.4 -C.sub.18 alkyl or C.sub.2 -C.sub.18 alkenyl or C.sub.5 -C.sub.18 alkyloxycarbonyl; or R.sup.7 is C.sub.1-C.sub.18 alkyl which is substituted by OH, C.sub.1 -C.sub.18 alkoxy, C.sub.2 -C.sub.18 alkanoyl, halogen, --COOH, --COOR.sup.8, --CONH.sub.2, --CONHR.sup.9, --CON(R.sup.9)(R.sup.10), --NH.sub.2, --NHR.sup.9, --N(R.sup.9)(R.sup.10), --NHCOR.sup.11, --CN, --OCOR.sup.11, a group of the formula ##STR28## and/or phenoxy which is unsubstituted or is substituted by C.sub.1 -C.sub.18 alkyl, C.sub.1 -C.sub.18 alkoxy or halogen; or R.sup.7 is C.sub.4 -C.sub.20 alkyl which is interrupted by O and substituted by OH or C.sub.1 -C.sub.12 alkoxy; glycidyl; C.sub.5 -C.sub.8 cycloalkyl; cyclohexyl which is substituted by OH, C.sub.1 -C.sub.4 alkyl or --OCOR.sup.11 ; or C.sub.7 -C.sub.11 -phenylalkyl which is unsubstituted or substituted by OH, Cl or CH.sub.3 ; R.sup.8 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.6 hydroxyalkyl; C.sub.3 -C.sub.18 alkenyl; C.sub.3 -C.sub.20 alkyl which is interrupted by O, N or S and/or substituted by OH; C.sub.1 -C.sub.4 alkyl which is substituted by --P(O)(OR.sup.14).sub.2, --N(R.sup.9)(R.sup.10) or --OCOR.sup.11 and/or OH; glycidyl; cyclohexyl or C.sub.7 -C.sub.11 phenylalkyl; or is a group of the formula ##STR29## R.sup.9 and R.sup.10 independently of one another are C.sub.1 -C.sub.12 alkyl; C.sub.3 -C.sub.12 alkoxyalkyl; C.sub.4 -C.sub.16 dialkylaminoalkyl or C.sub.5 -C.sub.12 cycloalkyl or R.sup.9 and R.sup.10 together are C.sub.3 -C.sub.9 alkylene or -oxaalkylene or -azaalkylene; R.sup.11 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkenyl or phenyl; R.sup.12 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkenyl; phenyl; or --R.sup.15 --O--CO--R.sup.11 ; or is a group of the formula ##STR30## R.sup.13 is C.sub.1 -C.sub.12 alkyl; phenyl; naphthyl or C.sub.7 -C.sub.14 alkylphenyl; and R.sup.14 is C.sub.1 -C.sub.12 alkyl or phenyl; R.sup.15 is C.sub.1 -C.sub.18 alkylene or C.sub.2 -C.sub.18 alkenylene; R.sup.16 is hydrogen; oxide; C.sub.1 -C.sub.8 alkanoyl; C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 hydroxyalkyl; C.sub.3 -C.sub.18 hydroxyalkyl which is interrupted by O; C.sub.1 -C.sub.18 -alkoxy; C.sub.5 -C.sub.8 cycloalkyl; C.sub.5 -C.sub.8 -cycloalkoxy; C.sub.7 -C.sub.11 phenylalkyl; C.sub.7 -C.sub.11 phenylalkyl which is substituted on the phenyl ring by from 1 to 3 radicals C.sub.1 -C.sub.4 alkyl or C.sub.1 -C.sub.8 alkanoyl; or C.sub.7 -C.sub.11 phenylalkoxy; X is a direct bond or --CO--; Z.sup.1 and Z.sup.2 independently of one another are C.sub.1 -C.sub.12 alkyl or together are C.sub.4 -C.sub.10 alkylene which may be interrupted by an oxygen atom; Z.sup.3 is C.sub.1 -C.sub.20 -Alkyl; and Z.sup.4 is hydrogen or methyl; PAL with the exception of a compound of the formula I in which 2 of the radicals R.sup.3, R.sup.4 and R.sup.5 are alkoxy and the third radical has a definition other than alkoxy. The preferred definitions of the radicals to R.sup.1 to R.sup.16 in the compounds of the formula Ib are essentially the same as those for the corresponding radicals in the compounds of the formula I. In compounds of the formula Ib, R.sup.1, R.sup.2, R.sup.3 and R.sup.4 independently of one another are preferably H, C.sub.1 -C.sub.4 alkoxy or C.sub.1 -C.sub.4 alkyl, especially H or methyl. R.sup.5 in compounds of the formula Ib is preferably --O--R.sup.7. Preferred compounds of the formula Ib are those in which R.sup.1 and R.sup.2 independently of one another are H; OH; C.sub.1 -C.sub.12 alkyl; cyclohexyl or trifluoromethyl; R.sup.3 and R.sup.4 independently of one another are hydrogen; --OH; C.sub.1 -C.sub.18 alkyl; C.sub.1 -C.sub.18 alkoxy; or halogen or may have one of the definitions of R.sup.7 ; R.sup.5 has one of the definitions given for R.sup.7 or is halogen; --O--CO--R.sup.12 ; --O--SO.sub.2 --R.sup.3 or --O--R.sup.7 ; R.sup.6 is H or C.sub.1 -C.sub.12 alkyl; R.sup.7 is C.sub.2 -C.sub.18 alkenyl; or R.sup.7 is C.sub.1 -C.sub.12 alkyl which is substituted by OH, C.sub.1 -C.sub.18 alkoxy, halogen, --COOH, --COOR.sup.8, --CONH.sub.2, --CONHR.sup.9, --CON(R.sup.9)(R.sup.10), --NH.sub.2, --NHR.sup.9, --N(R.sup.9)(R.sup.10), --NHCOR.sup.11, --CN, --OCOR.sup.11 and/or phenoxy which is unsubstituted or is substituted by C.sub.1 -C.sub.18 alkyl, C.sub.1 -C.sub.18 alkoxy or halogen; or R.sup.7 is C.sub.4 -C.sub.20 alkyl which is interrupted by one or more O and substituted by OH or C.sub.1 -C.sub.12 alkoxy; glycidyl; C.sub.5 -C.sub.8 cycloalkyl; cyclohexyl which is substituted by OH, C.sub.1 -C.sub.4 alkyl or --OCOR.sup.11 ; or C.sub.7 -C.sub.11 phenylalkyl which is unsubstituted or substituted by OH, Cl or CH.sub.3 ; R.sup.8 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.6 hydroxyalkyl; C.sub.3 -C.sub.18 alkenyl; C.sub.3 -C.sub.20 alkyl which is interrupted by O, N or S and/or substituted by OH; C.sub.1 -C.sub.4 alkyl which is substituted by --P(O)(OR.sup.14).sub.2, --N(R.sup.9)(R.sup.10) or --OCOR.sup.11 and/or OH; glycidyl; cyclohexyl or C.sub.7 -C.sub.11 phenylalkyl; R.sup.9 and R.sup.10 independently of one another are C.sub.1 -C.sub.12 alkyl; C.sub.3 -C.sub.12 alkoxyalkyl; C.sub.4 -C.sub.16 -dialkylaminoalkyl or C.sub.5 -C.sub.12 cycloalkyl or R.sup.9 and R.sup.10 together are C.sub.3 -C.sub.9 alkylene or -oxaalkylene or -azaalkylene; R.sup.11 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkenyl or phenyl; R.sup.12 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkenyl; phenyl; or --R.sup.15 --O--CO--R.sup.11 ; or is a group of the formula ##STR31## R.sup.13 is C.sub.1 -C.sub.12 alkyl; phenyl; naphthyl or C.sub.7 -C.sub.14 alkylphenyl; and R.sup.14 is C.sub.1 -C.sub.12 alkyl or phenyl; R.sup.15 is C.sub.1 -C.sub.18 alkylene or C.sub.2 -C.sub.18 alkenylene; R.sup.16 is hydrogen; C.sub.1 -C.sub.8 alkanoyl; C.sub.1 -C.sub.18 alkyl; C.sub.1 -C.sub.18 alkoxy; C.sub.5 -C.sub.8 cycloalkyl; C.sub.5 -C.sub.8 cycloalkoxy; C.sub.7 -C.sub.11 phenylalkyl; C.sub.7 -C.sub.11 phenylalkyl which is substituted on the phenyl ring by from 1 to 3 radicals C.sub.1 -C.sub.4 alkyl or C.sub.1 -C.sub.8 alkanoyl; or C.sub.7 -C.sub.11 phenylalkoxy; and X is a direct bond or --CO--. Particularly preferred compounds of the formula Ib are those in which R.sup.1 and R.sup.2 independently of one another are hydrogen or C.sub.1 -C.sub.4 alkyl; R.sup.3 and R.sup.4 independently of one another are hydrogen; C.sub.1 -C.sub.3 alkyl; C.sub.1 -C.sub.3 alkoxy or halogen or have one of the definitions of R.sup.7 or are OR.sup.7 ; R.sup.5 has one of the definitions given for R.sup.7 or is halogen; --O--CO--R.sup.12 or --O--R.sup.7 ; R.sup.6 is in the o-position to R.sup.5 and in the p-position to --OH and is hydrogen, C.sub.1 -C.sub.6 alkyl, allyl, C.sub.6 -C.sub.18 alkanoyl, benzoyl or -methylbenzyl; R.sup.7 is C.sub.4 -C.sub.18 alkyl or C.sub.2 -C.sub.18 alkenyl; or R.sup.7 is C.sub.1 -C.sub.12 alkyl which is substituted by OH, C.sub.1 -C.sub.18 alkoxy, --COOR.sup.8, a group of the formula ##STR32## and/or --OCOR.sup.11 ; or R.sup.7 is C.sub.7 -C.sub.18 alkyl which is interrupted by from 1 to 6 --O-- and substituted by OH; C.sub.5 -C.sub.8 cycloalkyl; or C.sub.7 -C.sub.11 phenylalkyl; R.sup.8 is C.sub.1 -C.sub.18 alkyl; C.sub.3 -C.sub.18 alkenyl or a group of the formula ##STR33## R.sup.11 is C.sub.1 -C.sub.18 alkyl or C.sub.2 -C.sub.18 alkenyl; R.sup.12 is C.sub.1 -C.sub.18 alkyl; C.sub.2 -C.sub.18 alkenyl; --R.sup.15 --O--CO--CH.dbd.CH.sub.2 ; or --R.sup.15 --O--CO--C(CH.sub.3).dbd.CH.sub.2 ; or is a group of the formula ##STR34## R.sup.15 is C.sub.2 -C.sub.18 alkylene; and R.sup.16 is hydrogen; oxide; C.sub.2 -C.sub.8 alkanoyl; C.sub.1 -C.sub.12 alkyl; hydroxyethyl; C.sub.1 -C.sub.18 alkoxy; C.sub.5 -C.sub.8 cycloalkyl; C.sub.5 -C.sub.8 cycloalkoxy; or C.sub.7 -C.sub.11 phenylalkyl. Among these, compounds of emphatic significance are those in which R.sup.1 and R.sup.2 independently of one another are hydrogen or C.sub.1 -C.sub.4 alkyl; R.sup.3 and R.sup.4 independently of one another are hydrogen or C.sub.1 -C.sub.4 alkoxy or C.sub.1 -C.sub.4 alkyl; R.sup.5 is --O--R.sup.7 ; R.sup.6 is in the o-position to R.sup.5 and in the p-position to OH and is hydrogen or C.sub.1 -C.sub.6 alkyl or allyl; R.sup.7 is C.sub.4 -C.sub.18 alkyl or C.sub.3 -C.sub.18 alkenyl; or R.sup.7 is C.sub.1 -C.sub.12 alkyl which is substituted by OH, C.sub.1 -C.sub.18 alkoxy, --COOR.sup.8, a group of the formula ##STR35## and/or --OCOR.sup.11 ; R.sup.8 is C.sub.1 -C.sub.18 alkyl; and R.sup.11 is C.sub.1 -C.sub.18 alkyl or C.sub.2 -C.sub.3 alkenyl. The compounds of the formula I Ia and Ib can be prepared in correspondence with or in analogy to one of the methods indicated in U.S. Pat. No. 3,442,898, by Friedel-Crafts addition of halopyrimidines onto appropriate phenols. This is advantageously carried out by reacting one equivalent of a compound of the formula (A) ##STR36## in which R' and R\"\" independently of one another are each --Cl or ##STR37## in which R.sup.1 is not hydroxyl, with the quantity of equivalents of the corresponding phenol of the formula (B) ##STR38## and, if desired, of the formula (C) ##STR39## as there are chlorine atoms in formula (A). Where different phenols are reacted, the overall reaction is preferably carried out over two or more stages, so that initially one phenol is reacted with the compound of the formula (A), the reaction product is then reacted with another phenol, and the product resulting therefrom is reacted if appropriate with the third phenol. If the end product of the formula I, Ia or Ib is derived, for example, from triresorcinylpyrimidine, then, in accordance with the indications in U.S. Pat. No. 3,442,898, 2,4,6-trichloropyrimidine as the compound of the formula (A) can be reacted in one stage with resorcinol as the compound of the formula (B). The starting, materials are reacted in a manner known per se by reacting them in an inert solvent in the presence of anhydrous AlCl.sub.3. Aluminium trichloride and phenol are in this case advantageously employed in excess; for example, aluminium trichloride can be used in a 5-15% molar excess and the phenol in a 1-30%, in particular in a 5-20%, molar excess. Where the compound of the formula (A) contains 1 chlorine atom, 1-1.3 mol, for example, of compound (B) per mole of compound (A) can be employed for the reaction; where the compound of the formula (A) contains 2 or 3 chlorine atoms, then generally the two-fold or three-fold quantity of phenol is used. Examples of suitable solvents are hydrocarbons, chlorinated hydrocarbons or nitrated aromatic hydrocarbons; high-boiling hydrocarbons are preferred, such as ligroin, toluene or xylene. The temperature is in general not critical; the temperatures usually employed are between 20.degree. C. and the boiling point of the solvent, for example between 50.degree. C. and 150.degree. C. The product can be worked up by common methods, for example by filtration and drying; if required, further purification steps such as recrystallization can be carried out. Free phenolic hydroxyl groups of the reaction product, especially in the p-position to the pyrimidine ring, can subsequently be etherified or esterified in a known manner; cf. also U.S. Pat. No. 3,442,898. For the preparation of the phenol ethers, the free phenols are preferably reacted with epoxides or halides, especially with glycidyl compounds or appropriate chlorides or bromides. The starting compounds of the formula (A) are known or can be prepared by known methods or in analogy to the known compounds. Examples of possible starting compounds are the known amino-aryl-pyrimidines, whose synthesis is described, inter alia, by D. Simon et al., J. Heterocyclic Chem. 22, 1551 (1985). The exchange of amino on the pyrimidine ring for --OH, and also the exchange of hydroxyl for halogen to form the halopyrimidines, is described in, for example, D. J. Brown and P. Waring, Austr. J. Chem. 26, 443 (1973) and U.S. Pat. No. 3,442,898. A further method for the preparation of starting compounds of the formula (A) in which at least one of the substituents R' and R' is not --Cl is the reaction of 2,4,6-trichloropyrimidine with a correspondingly substituted phenylmagnesium halide (Grignard reaction). The reaction can likewise be carried out in a known manner, by first reacting a compound of the formula ##STR40## in which X' is Cl or Br with metallic magnesium in an ether, for example in diethyl ether or in tetrahydrofuran (THF), in order to prepare the phenylmagnesium halide. This reagent is then reacted with 2,4,6-trichloropyrimidine to give the compound of the formula (A), preferably with the exclusion of oxygen and moisture. The subsequent work-up can in turn be carried out in a known manner, for example by dilution with an organic solvent, such as toluene, hydrolysis of the residual phenylmagnesium halide with aqueous HCl, and separation, drying and concentration of the organic phase. Some of the compounds obtained of the formula (A) are new compounds which are likewise a subject of the invention. These are compounds of the formula (A') ##STR41## in which R.sup.1' is H; C.sub.1 -C.sub.12 alkyl; cyclohexyl or trifluoromethyl; and R.sup.3' is C.sub.1 -C.sub.18 alkyl; C.sub.1 -C.sub.18 alkoxy; C.sub.2 -C.sub.18 alkenyl; halogen; C.sub.3 -C.sub.18 alkoxy which is interrupted by --O--; or cyclohexyl. Among these, those compounds of formula (A') are preferred in which R.sup.1' is hydrogen or C.sub.1 -C.sub.4 alkyl and R.sup.3' is C.sub.1 -C.sub.18 alkyl or C.sub.1 -C.sub.18 alkoxy or Cl, for example C.sub.1 -C.sub.4 alkyl or C.sub.1 -C.sub.4 alkoxy or Cl, especially methyl, methoxy or Cl. The compounds of the formula Ib according to the invention can be used as stabilizers for organic materials against damage by light, oxygen or heat. The compounds according to the invention are especially suitable as light stabilizers. Examples of the materials to be stabilized are oils, fats, waxes, cosmetics, biocides or photographic materials. A utility of particular interest is in polymeric materials, for example in plastics, rubbers, paints or adhesives. Examples of polymers and other substrates which can be stabilized in this way are the following: 1. Polymers of monoolefins and diolefins, for example polypropylene, polyisobutylene, polybut-1-ene, poly-4-methylpent-1-ene, polyisoprene or polybutadiene, as well as polymers of cycloolefins, for instance of cyclopentene or norbornene, polyethylene (which optionally can be crosslinked), for example high density polyethylene (HDPE), low density polyethylene (LDPE), linear low density polyethylene (LLDPE), branched low density polyethylene (BLDPE). Polyolefins, i.e. the polymers of monoolefins exemplified in the preceding paragraph, preferably polyethylene and polypropylene, can be prepared by different, and especially by the following, methods: a) radical polymerisation (normally under high pressure and at elevated temperature). b) catalytic polymerisation using a catalyst that normally contains one or more than one metal of groups IVb, Vb, VIb or VIII of the Periodic Table. These metals usually have one or more than one ligand, typically oxides, halides, alcoholates, esters, ethers, amines, alkyls, alkenyls and/or aryls that may be either .pi.- or .sigma.-coordinated. These metal complexes may be in the free form or fixed on substrates, typically on activated magnesium chloride, titanium(III) chloride, alumina or silicon oxide. These catalysts may be soluble or insoluble in the polymerisation medium. The catalysts can be used by themselves in the polymerisation or further activators may be used, typically metal alkyls, metal hydrides, metal alkyl halides, metal alkyl oxides or metal alkyloxanes, said metals being elements of groups Ia, IIa and/or IIIa of the Periodic Table. The activators may be modified conveniently with further ester, ether, amine or silyl ether groups. These catalyst systems are usually termed Phillips, Standard Oil Indiana, Ziegler (-Natta), TNZ (DuPont), metallocene or single site catalysts (SSC). 2. Mixtures of the polymers mentioned under 1), for example mixtures of polypropylene with polyisobutylene, polypropylene with polyethylene (for example PP/HDPE, PP/LDPE) and mixtures of different types of polyethylene (for example LDPE/HDPE). 3. Copolymers of monoolefins and diolefins with each other or with other vinyl monomers, for example ethylene/propylene copolymers, linear low density polyethylene (LLDPE) and mixtures thereof with low density polyethylene (LDPE), propylene/but-1-ene copolymers, propylene/isobutylene copolymers, ethylene/but-1-ene copolymers, ethylene/hexene copolymers, ethylene/methylpentene copolymers, ethylene/heptene copolymers, ethylene/octene copolymers, propylene/butadiene copolymers, isobutylene/-isoprene copolymers, ethylene/alkyl acrylate copolymers, ethylene/alkyl methacrylate copolymers, ethylene/vinyl acetate copolymers and their copolymers with carbon monoxide or ethylene/acrylic acid copolymers and their salts (ionomers) as well as terpolymers of ethylene with propylene and a diene such as hexadiene, dicyclopentadiene or ethylidene-norbornene; and mixtures of such copolymers with one another and with polymers mentioned in 1) above, for example polypropylene/ethylene-propylene copolymers, LDPE/ethylene-vinyl acetate copolymers (EVA), LDPE/ethylene-acrylic acid copolymers (EAA), LLDPE/EVA, LLDPE/EAA and alternating or random polyalkylene/carbon monoxide copolymers and mixtures thereof with other polymers, for example polyamides. 4. Hydrocarbon resins (for example C.sub.5 -C.sub.9) including hydrogenated modifications thereof (e.g. tackifiers) and mixtures of polyalkylenes and starch. 5. Polystyrene, poly(p-methylstyrene), poly(.alpha.-methylstyrene). 6. Copolymers of styrene or .alpha.-methylstyrene with dienes or acrylic derivatives, for example styrene/butadiene, styrene/acrylonitrile, styrene/alkyl methacrylate, styrene/butadiene/alkyl acrylate, styrene/butadiene/alkyl methacrylate, styrene/maleic anhydride, styrene/acrylonitrile/methyl acrylate; mixtures of high impact strength of styrene copolymers and another polymer, for example a polyacrylate, a diene polymer or an ethylene/propylene/diene terpolymer; and block copolymers of styrene such as styrene/butadiene/strene, styrene/isoprene/styrene, styrene/ethylene/butylene/styrene or styrene/ethylene/propylene/styrene. 7. Graft copolymers of styrene or .alpha.-methylstyrene, for example styrene on polybutadiene, styrene on polybutadiene-styrene or polybutadiene-acrylonitrile copolymers; styrene and acrylonitrile (or methacrylonitrile) on polybutadiene; styrene, acrylonitrile and methyl methacrylate on polybutadiene; styrene and maleic anhydride on polybutadiene; styrene, acrylonitrile and maleic anhydride or maleimide on polybutadiene; styrene and maleimide on polybutadiene; styrene and alkyl acrylates or methacrylates on polybutadiene; styrene and acrylonitrile on ethylene/propylene/diene terpolymers; styrene and acrylonitrile on polyalkyl acrylates or polyalkyl methacrylates, styrene and acrylonitrile on acrylate/butadiene copolymers, as well as mixtures thereof with the copolymers listed under 6), for example the copolymer mixtures known as ABS, MBS, ASA or AES polymers. 8. Halogen-containing polymers such as polychloroprene, chlorinated rubbers, chlorinated or sulfochlorinated polyethylene, copolymers of ethylene and chlorinated ethylene, epichlorohydrin homo- and copolymers, especially polymers of halogen-containing vinyl compounds, for example polyvinyl chloride, polyvinylidene chloride, polyvinyl fluoride, polyvinylidene fluoride, as well as copolymers thereof such as vinyl chloride/vinylidene chloride, vinyl chloride/vinyl acetate or vinylidene chloride/vinyl acetate copolymers. 9. Polymers derived from .alpha.,.beta.-unsaturated acids and derivatives thereof such as polyacrylates and polymethacrylates; polymethyl methacrylates, polyacrylamides and polyacrylonitriles, impact-modified with butyl acrylate. 10. Copolymers of the monomers mentioned under 9) with each other or with other unsaturated monomers, for example acrylonitrile/butadiene copolymers, acrylonitrile/alkyl acrylate copolymers, acrylonitrile/alkoxyalkyl acrylate or acrylonitrile/vinyl halide copolymers or acrylonitrile/alkyl methacrylate/butadiene terpolymers. 11. Polymers derived from unsaturated alcohols and amines or the acyl derivatives or acetals thereof, for example polyvinyl alcohol, polyvinyl acetate, polyvinyl stearate, polyvinyl benzoate, polyvinyl maleate, polyvinyl butyral, polyallyl phthalate or polyallyl melamine; as well as their copolymers with olefins mentioned in 1) above. 12. Homopolymers and copolymers of cyclic ethers such as polyalkylene glycols, polyethylene oxide, polypropylene oxide or copolymers thereof with bisglycidyl ethers. 13. Polyacetals such as polyoxymethylene and those polyoxymethylenes which contain ethylene oxide as a comonomer; polyacetals modified with thermoplastic polyurethanes, acrylates or MBS. 14. Polyphenylene oxides and sulfides, and mixtures of polyphenylene oxides with styrene polymers or polyamides. 15. Polyurethanes derived from hydroxyl-terminated polyethers, polyesters or polybutadienes on the one hand and aliphatic or aromatic polyisocyanates on the other, as well as precursors thereof. 16. Polyamides and copolyamides derived from diamines and dicarboxylic acids and/or from aminocarboxylic acids or the corresponding lactams, for example polyamide 4, polyamide 6, polyamide 6/6, 6/10, 6/9, 6/12, 4/6, 12/12, polyamide 11, polyamide 12, aromatic polyamides starting from m-xylene diamine and adipic acid; polyamides prepared from hexamethylenediamine and isophthalic or/and terephthalic acid and with or without an elastomer as modifier, for example poly-2,4,4,-trimethylhexamethylene terephthalamide or poly-m-phenylene isophthalamide; and also block copolymers of the aforementioned polyamides with polyolefins, olefin copolymers, ionomers or chemically bonded or grafted elastomers; or with polyethers, e.g. with polyethylene glycol, polypropylene glycol or polytetramethylene glycol; as well as polyamides or copolyamides modified with EPDM or ABS; and polyamides condensed during processing (RIM polyamide systems). 17. Polyureas, polyimides, polyamide-imides and polybenzimidazoles. 18. Polyesters derived from dicarboxylic acids and diols and/or from hydroxycarboxylic acids or the corresponding lactones, for example polyethylene terephthalate, polybutylene terephthalate, poly-1,4-dimethylolcyclohexane terephthalate and polyhydroxybenzoates, as well as block copolyether esters derived from hydroxyl-terminated polyethers; and also polyesters modified with polycarbonates or MBS. 19. Polycarbonates and polyester carbonates. 20. Polysulfones, polyether sulfones and polyether ketones. 21. Crosslinked polymers derived from aldehydes on the one hand and phenols, ureas and melamines on the other hand, such as phenol/formaldehyde resins, urea/formaldehyde resins and melamine/formaldehyde resins. 22. Drying and non-drying alkyd resins. 23. Unsaturated polyester resins derived from copolyesters of saturated and unsaturated dicarboxylic acids with polyhydric alcohols and vinyl compounds as crosslinking agents, and also halogen-containing modifications thereof of low flammability. 24. Crosslinkable acrylic resins derived from substituted acrylates, for example epoxy acrylates, urethane acrylates or polyester acrylates. 25. Alkyd resins, polyester resins and acrylate resins crosslinked with melamine resins, urea resins, polyisocyanates or epoxy resins. 26. Crosslinked epoxy resins derived from polyepoxides, for example from bisglycidyl ethers or from cycloaliphatic diepoxides. 27. Natural polymers such as cellulose, rubber, gelatin and chemically modified homologous derivatives thereof, for example cellulose acetates, cellulose propionates and cellu lose butyrates, or the cellulose ethers such as methyl cellulose; as well as rosins and their derivatives. 28. Blends of the aforementioned polymers (polyblends), for example PP/EPDM, Poly-amide/EPDM or ABS, PVC/EVA, PVC/ABS, PVC/MBS, PC/ABS, PBTP/ABS, PC/ASA, PC/PBT, PVC/CPE, PVC/acrylates, POM/thermoplastic PUR, PC/thermoplastic PUR, POM/acrylate, POM/MBS, PPO/HIPS, PPO/PA 6.6 and copolymers, PA/HDPE, PA/PP, PA/PPO. The invention therefore also relates to a composition comprising A) an organic material which is sensitive to damage by light, oxygen and/or heat, and B) as stabilizer, a compound of the formula Ib. The compounds of the formula Ib according to the invention can be employed with particular advantage in compositions which contain as component A a synthetic organic polymer, especially a thermoplastic polymer or a photographic material. Examples of suitable thermoplastic polymers are polyolefins and polymers which contain heteroatoms in the principal chain. Preferred compositions are those in which component A is a photographic material or a thermoplastic polymer which contains nitrogen, oxygen and/or sulfur, especially nitrogen or oxygen, in the principal chain. Polymers which contain heteroatoms in the principal chain are in particular polymers containing O, S and/or N. Examples of such polymers are the following classes of thermoplastic polymers: 1. Polyacetals, such as polyoxymethylene, and those polyoxymethylenes which contain comonomers such as, for example, ethylene oxide; polyacetals which are modified with thermoplastic polyurethanes, acrylates or MBS. 2. Polyphenylene oxides and polyphenylene sulfides and mixtures thereof with styrene polymers or polyamides. 3. Polyamides and copolyamides, for example those derived from diamines and dicarboxylic acids and/or from aminocarboxylic acids or the corresponding lactones, such as polyamide 4, polyamide 6, polyamide 6/6, 6/10, 6/9, 6/12, 4/6, polyamide 11, polyamide 12, aromatic polyamides based on m-xylene, diamine and adipic acid; polyamides prepared from hexamethylenediamine and iso- and/or terephthalic acid and, if desired, an elastomer as modifier, for example poly-2,4,4-trimethylhexamethyleneterephthalamide, poly-m-phenyleneisophthalamide; block copolymers of the abovementioned polyamides with polyolefins, olefin copolymers, ionomers or chemically bonded or grafted elastomers; or with polyethers, for example with polyethylene glycol, polypropylene glycol or polytetramethylene glycol; additionally, polyamides or copolyamides modified with EPDM or ABS; and polyamides condensed during processing (RIM polyamide systems). 4. Polyureas, polyimides, polyamide-imides and polybenzimidazoles. 5. Polyesters, for example those derived from dicarboxyhc acids and dialcohols and/or from hydroxycarboxylic acids or the corresponding lactones, such as polyethylene terephthalate, polybutylene terephthalate, poly-1,4-dimethylolcyclohexane terephthalate, polyhydroxybenzoates, and block polyether-esters derived from polyethers having terminal hydroxyl groups; also, polyesters modified with polycarbonates or MBS. 6. Polycarbonates and polyester carbonates, especially aromatic polycarbonates such as those based on 2,2-bis(4-hydroxyphenyl)propane or 1,1-bis(4-hydroxyphenyl )cyclolhexane. 7. Polysulfones, polyether sulfones and polyether ketones, especially aromatic polymers from this class. 8. Mixtures (polyblends) of these polymers with one another or with other polymers, for example with polyolefins, polyacrylates, polydienes or other elastomers as impact modifiers. Preferred among these are the polycarbonates, polyesters, polyamides, polyacetals, polyphenylene oxides and polyphenylene sulfides, but especially the polycarbonates. This should be understood as referring in particular to those polymers whose constitutional repeating unit is of the formula ##STR42## in which A is a divalent phenolic radical. Examples of A are given, inter alia, in U.S. Pat. No. 4,960,863 and DE-A-3,922,496. A may, for example be derived from hydroquinone, resorcinol, from dihydroxybiphenyls or bisphenols in the broadest sense such as bis(hydroxyphenyl)alkanes, bis(hydroxyphenyl)cycloalkanes, bis(hydroxyphenyl) sulfides, bis(hydroxyphenyl) ethers, bis(hydroxyphenyl) ketones, bis(hydroxyphenyl) sulfones, bis(hydroxyphenyl) sulfoxides, .alpha..alpha.'-bis(hydroxyphenyl)diisopropylbenzenes, for example from the compounds 2,2-bis(4-hydroxyphenyl)propane, 2,2-bis(3,5-dimethyl-4-hydroxyphenyl)propane, 2,2-bis(3,5-dichloro-4-hydroxyphenyl)propane, 2,2-bis(3,5-dibromo-4-hydroxyphenyl)propane, 1,1-bis(4-hydroxyphenyl)cyclohexane or ##STR43## Other compositions of interest are those in which component (A) is a polyolefin, for example polyethylene or polypropylene. The invention also relates to a method of stabilizing organic material against damage by light, oxygen and/or heat, which comprises adding to this material a compound of the formula Ib as stabilizer, and to the use of compounds of the formula Ib for stabilizing organic material. The quantity of stabilizer to be used depends on the organic material to be stabilized and on the intended use of the stabilized material. In general, the composition according to the invention contains from 0.01 to 15, in particular from 0.05 to 10 and especially from 0.1 to 5 parts by weight of the stabilizer (component B) per 100 parts by weight of component A. Incorporation into the organic polymers, for example into the synthetic organic and, in particular, thermoplastic polymers can be effected by adding the compounds according to the invention and, if desired, other additives by the methods conventional in industry. Incorporation can be effected advantageously before or during shaping, for example by mixing the pulverulent components or by adding the stabilizer to the melt or solution of the polymer, or by applying the dissolved or dispersed compounds to the polymer, followed if desired by the evaporation of the solvent. In the case of elastomers, these may also be stabilized as latices. A further possibility for incorporating the compounds according to the invention into polymers consists in their addition before or during the polymerization of the corresponding monomers or before crosslinking. The compounds according to the invention or mixtures thereof can also be added to the plastics to be stabilized in the form of a masterbatch which contains these compounds in, for example, a concentration of from 2.5 to 25% by weight. The compounds according to the invention are advantageously incorporated by the following possible methods: as emulsion or dispersion (e.g. to latices or emulsion polymers) as a dry mixture during the mixing of additional components or polymer mixtures by direct addition to the processing apparatus (e.g. extruder, internal mixer etc.) as solution or melt. The resulting stabilized polymer compositions can be converted, by the conventional methods such as hot pressing, spinning, extrusion or injection moulding, into shaped articles such as fibres, films, strips, plates, webbed plates, vessels, pipes and other profiles. The invention therefore also relates to the use of the polymer composition according to the invention for the production of a shaped article. The utility of the compositions in multilayer systems is also of interest. In this case a polymer composition according to the invention having a relatively high content of stabilizer of the formula Ib, for example 5-15% by weight, is applied in a thin layer (10-100 .mu.m) to a shaped article made from a polymer which contains little or no stabilizer of the formula Ib. Application can be carried out simultaneously with the shaping of the basic structure, for example by so-called coextrusion. The composition can also be applied, however, to the ready-formed basic structure, for example by lamination with a film or by coating with a solution. The external layer of layers of the finished article have the function of a UV filter which protects the interior or the article inside against UV light. The external layer preferably contains 5-15% by weight, in particular 5-10% by weight, of at least one stabilizer of the formula Ib. The use of the polymer composition according to the invention for the production of multilayer systems, where the external layer(s) comprise a polymer composition according to the invention in a thickness of 10-100 .mu.m whereas the inner layer contains little or no stabilizer of the formula Ib, is therefore a further subject of the invention. The use of a polymer composition according to the invention in which component A is a polycarbonate for the production of multilayer systems is of particular interest. The polymers stabilized in this way are distinguished by high resistance to weathering and especially by high resistance to UV light. By this means they show long-term retention, even when used outdoors, of their mechanical properties and their colour and gloss. The stabilizer (component B) may also be a mixture of two or more compounds according to the invention. The organic materials, stabilized coating compositions or compositions according to the invention may also contain, in addition to the stabilizer of the formula I, Ia or Ib, other stabilizers or other additives, for example antioxidants, further light stabilizers, metal deactivators, phosphites or phosphonites. Examples of these are the following stabilizers: 1.1. Alkylated monophenols, for example 2,6-di-tert-butyl-4-methylphenol, 2-tert-butyl-4,6-dimethylphenol, 2,6-di-tert-butyl-4-ethylphenol, 2,6-di-tert-butyl-4-n-butylphenol, 2,6-di-tert-butyl-4-isobutylphenol, 2,6-dicyclopentyl-4-methylphenol, 2-(.alpha.methycyclo-hexyl)-4,6-dimethylphenol, 2,6-dioctadecyl-4-methylphenol, 2,4,6-tricyclohexylphenol, 2,6-di-tert-butyl-4-methoxymethylphenol, 2,6-di-nonyl-4-methylphenol, 2,4-dimethyl-6-(1'-methylundec-1'-yl)phenol, 2,4-di-methyl-6-(1'-methylheptadec-1'-yl) phenol, 2,4-di-methyl-6-(1'-methyltridec-1'-yl)phenol and mixtures thereof. 1.2. Alkylthiomethylphenols, for example 2,4-dioctylthiomethyl-6-tert-butylphenol, 2,4-dioctylthiomethyl-6-methylphenol, 2,4-dioctylthiomethyl-6-ethylphenol, 2,6-di-do-decylthiomethyl-4-nonylphenol. 1.3. Hydroquinones and alkvlated hydroguinones, for example 2,6-di-tert-butyl-4-methoxyphenol, 2,5-di-tert-butylhydroquinone, 2,5-di-tert-amylhydroquinone, 2,6-di-phenyl-4-octadecyloxyphenol, 2,6-di-tert-butylhydroquinone, 2,5-di-tert-butyl-4-hydroxy-anisole, 3,5-di-tert-butyl-4-hydroxyanisole, 3,5-di-tert-butyl-4-hydroxyphenyl stearate, bis-(3,5-di-tert-butyl-4-hydroxyphenyl) adipate. 1.4. Tocopherols, for example .alpha.-tocopherol, .beta.-tocopherol, .gamma.-tocopherol, .delta.-tocopherol and mixtures thereof (Vitamin E). 1.5. Hydroxylated thiodiphenyl ethers, for example 2,2'-thiobis(6-tert-butyl-4-methyl-phenol), 2,2'-thiobis(4-octylphenol), 4,4'-thiobis(6-tert-butyl-3-methylphenol), 4,4'-thio-bis (6-tert-butyl-2-methylphenol), 4,4'-thiobis-(3,6-di-sec-amylphenol), 4,4'-bis-(2,6-dim-ethyl-4-hydroxyphenyl) disulfide. 1.6. Alkylidenebisphenols, for example 2,2'-methylenebis(6-tert-butyl-4-methylphenol), 2,2'-methylenebis(6-tert-butyl-4-ethylphenol), 2,2'-methylenebis4-methyl-6-(.alpha.-methyl-coclohexy)phenol!, 2,2'-methylenebis(4-methyl-6-cyclohexylphenol), 2,2'-methylene-bis(6-nonyl-4-methylphenol), 2,2'-methylenebis(4,6-di-tert-butylphenol), 2,2'-ethylidene-bis(4,6-di-tert-butylphenol), 2,2'-ethylidenebis(6-tert-butyl-4-isobutylphenol), 2,2'-methy-lenebis6-(.alpha.-methylbenzyl)-4-nonylphenol!, 2,2'-methylenebis6-(.alpha.,.alpha.-dimethylbenzyl)-4-nonylphenol!, 4,4'-methylenebis(2,6-di-tert-butylphenol), 4,4'-methylenebis(6-tert-butyl-2-methylphenol), 1,1-bis(5-tert-butyl-4-hydroxy-2-methylphenyl)butane, 2,6-bis(3-tert-butyl-5-methyl-2-hydroxybenzyl)-4-methylphenol, 1,1,3-tris(5-tert-butyl-4-hydroxy-2-methylpheny)butane, 1,1-bis(5-tert-butyl-4-hydroxy-2-methyl-phenyl)-3-n-dodecylmer-captobutane , ethylene glycol bis3,3-bis(3'-tert-butyl-4'-hydroxyphenyl)butyrate!, bis (3-tert-butyl-4-hydroxy-5-methyl-phenyl)dicyclopentadiene, bis2-(3'-tert-butyl-2'-hydroxy-5'-methylbenzyl)-6-tert-butyl-4-methylphen yl!terephthalate, 1,1-bis-(3,5-dimethyl-2-hydroxyphenyl)butane, 2,2-bis-(3,5-di-tert-butyl-4-hydroxyphenyl)propane, 2,2-bis-(5-tert-butyl-4-hydroxy2-methylphenyl)-4-n-dodecylmercaptobutane, 1,1,5,5-tetra-(5-tert-butyl-4-hydroxy2-methylphenyl) pentane. 1.7. O--, N--and S-benzyl compounds, for example 3,5,3',5'-tetra-tert-butyl-4,4'-dihydroxy-dibenzyl ether, octadecyl-4-hydroxy-3,5-dimethylbenzylmercaptoacetate, tris-(3,5-di-tert-butyl-4-hydroxybenzyl)amine, bis(4-tert-butyl-3-hydroxy-2,6-dimethylbenzyl)dithio-terephthalate, bis(3,5-di-tert-butyl-4-hydroxybenzyl)sulfide, isooctyl-3,5di-tert-butyl-4-hydroxybenzylmercaptoacetate. 1.8. Hydroxybenzylated malonates, for example dioctadecyl-2,2-bis-(3,5-di-tert-butyl-2- hydroxybenzyl)-malonate, di-octadecyl-2-(3-tert-butyl-4-hydroxy-5-methylbenzyl)-malonate, di-dodecylmercaptoethyl-2,2-bis-(3,5-di-tert-butyl-4-hydroxybenzyl)malonat e, bis-4-(1,1,3,3-tetramethylbutyl)phenyl-2,2-bis(3,5-di-tert-butyl-4-hydrox ybenzyl)malonate. 1.9. Aromatic hydroxybenzyl compounds, for example 1,3,5-tris-(3,5-di-tert-butyl-4-hy-droxybenzyl)-2,4,6-trimethylbenzene, 1,4-bis(3,5-di-tert-butyl-4-hydroxybenzyl)-2,3,5,6-tetramethylbenzene, 2,4,6-tris(3,5-di-tert-butyl-4-hydroxybenzyl)phenol. 1.10. Triazine Compounds, for example 2,4-bis(octylmercapto)-6-(3,5-di-tert-butyl-4-hydroxyanilino)- 1,3,5-triazine, 2-octylmercapto-4,6-bis(3,5-di-tert-butyl-4-hydroxy-anilino)-1,3,5-triazin e, 2-octylmercapto-4,6-bis(3,5-di-tert-butyl-4-hydroxyphenoxy)-1,3,5-triazine , 2,4,6-tris(3,5-di-tert-butyl-4-hydroxyphenoxy)-1,2,3-triazine, 1,3,5-tris-(3,5-di-tert-butyl-4-hydroxyben"
        },
        {
            "uuid": "8exjqcsq8zhh7qrcwl2cs9k8s",
            "patent_id": "7944184",
            "text": "The present invention relates to a high voltage direct current (HVDC) system, and more particularly to a static compensator (STATCOM) for an HVDC system. BACKGROUND INFORMATION Although HVDC systems are an idea power generator without inertia, they generate a harmonic wave and consume invalid power. To resolve these problems, a harmonic wave filter, an invalid power compensator such as static VAR (voltage amperes reactive) compensator or STATCOM, and a synchronous phase modifier have been used. However, the invalid power compensator is not associated with the HVDC suitably and a control performance is not secure enough. FIG. 1 illustrates a conventional synchronous power generator system. A turbine 1 - 1 controls a frequency and valid power of the synchronous power generator system. An exciter 1 - 3 controls invalid power and voltages of the synchronous power generator system. The valid power of the synchronous power generator system is expressed by a first area 1 - 5 , and the invalid power of the synchronous generator system is expressed by a second area 1 - 4 . FIG. 2 is a circuitry diagram showing a conventional hybrid active filter as an example of a power filter for 12-pulse HVDC system. In a passive filter, as time goes by, filter parameters are fluctuated due to the degradation. The passive filter is operatively associated with impedance of a system, which are not known exactly. This causes the stability of the system to be reduced. In contrast to this, because an active filter removes a harmonic wave of the system using a switching element, it has an advantage that may overcome sensitivity to parameters of the passive filter. Further, the hybrid active filter has low impedance at a specific harmonic wave and significantly great impedance of a filter at a fundamental frequency. Accordingly, there is a little electric current inputted from an alternating current power source side. Since the hybrid active filter supplies an electric current to the system at a specific harmonic wave to be removed and a voltage of the harmonic wave is zero, power consumption is small. FIG. 3 is a view showing a control algorithm of the conventional hybrid active filter shown in FIG. 2 , which removes specific harmonic waves such as eleventh and thirteenth harmonic waves. The control algorithm of the hybrid active filter is an algorithm to generate a packing command signal in a phase A switching element of a passive filter. The hybrid passive filter receives a voltage V a 4 - 1 measured in a phase A of the system as an input of a Fast Fourier Transform (FFT), and extracts a magnitude V 11a and a phase θ 11a ( 4 - 2 ) of the eleventh harmonic wave, and a magnitude V 13a and a phase θ 13a ( 4 - 3 ) of the thirteenth harmonic wave. The control system controls a harmonic wave voltage component to zero by two PI controllers. Outputs of the two PI controllers are changed to amounts of time areas, and the amounts of time areas are added to each other to become a voltage form of f 11 (t) ( 4 - 4 ). In the same manner, a control system is provided to calculate a voltage command f 13 (t) ( 4 - 6 ) for removing the thirteenth harmonic wave ( 4 - 7 ). In conclusion, the two voltage commands are added to each other to become a voltage command f(t) ( 4 - 5 ) of the phase A. The same algorithm is used to calculate respective voltage command in phases B and C. In other words, the control algorithm indicated in the hybrid passive filter separates the magnitudes and the phases of the eleventh and thirteen harmonic waves by the FFT, and controls the hybrid passive filter so that the respective separated harmonic components become zero. FIG. 4 is a circuitry diagram showing a conventional HVDC system having an STATCOM. The conventional HVDC system includes an HVDC 5 - 1 , a STATCOM 5 - 2 , a harmonic filter 5 - 3 , and a capacitor 5 - 4 . The HVDC 5 - 1 controls valid power. The STATCOM 5 - 2 compensates and controls invalid power. The harmonic filter 5 - 3 removes a harmonic wave generated by the HDVC 5 - 1 . There are three type HVDC systems having an HVDC. A first type HVDC system includes only the HDVC system 5 - 1 and a STATCOM 5 - 2 . In this type, the STATCOM 5 - 2 removes a harmonic wave generated by the HDVC 5 - 1 and compensates and controls an invalid power. A second type HVDC system includes an HVDC 5 - 1 , a STATCOM 5 - 2 , a harmonic filter 5 - 3 , and a capacitor 5 - 4 . In this type, the STATCOM 5 - 2 controls an invalid power with high precision. Further, the STATCOM 5 - 2 adsorbs the invalid power at excessive operation as an auxiliary function. A third type HVDC system includes a twelfth filter 5 - 5 instead of the eleventh and thirteenth filters 5 - 3 in the second type HVDC system. In the third type HVDC system, the STATCOM functions to compensate detuning of the filter. Example embodiments of the present invention provide a static compensator apparatus for a HVDC system, which may control harmonic wave compensation at high passive speed to meet operating characteristics of the HVDC system. Example embodiments of the present invention provide a static compensator apparatus for a high voltage direct current system including: a static compensator being turned-on in a normal mode, and for compensating for invalid power and removing a harmonic wave generated by the high voltage direct current system; a static compensator controller for controlling an operation of the static compensator; and a diesel power generator operating complementarily to the static compensator and being turned-on when the high voltage direct current system starts. The static compensator controller may include: a signal detector for calculating a phase voltage and a phase of a fundamental wave based on a system phase voltage in an FFT manner; a control unit for generating Q and H command part values based on the phase voltage and the phase of a fundamental wave from the signal detector; and a firing unit for comparing the Q and H command part values with a chopping wave, and for generating control voltages to control the operation of the static compensator according to the comparison result. Further features and aspects of example embodiments of the present invention are described in more detail below with reference to the appended Figures."
        }
    ]
}