{
    "table_name": "CLAIM",
    "table_fullname": "PATENTSVIEW.PATENTSVIEW.CLAIM",
    "column_names": [
        "uuid",
        "text",
        "sequence",
        "dependent",
        "patent_id",
        "exemplary"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "f14iorboawm0ew4zxz095hkf1",
            "patent_id": "5080217",
            "text": "The apparatus of claim 11 further comprising:means for coupling said guide rails to said support fingers and to said lateral guide means, said coupling means permitting movement of said support fingers relative to said slots in a pair of mutually orthogonal directions whereby the width and depth of the transport channel may be varied.",
            "dependent": "-1",
            "sequence": "13",
            "exemplary": "False"
        },
        {
            "uuid": "br6in9paqszb9k8q5qcskbwrr",
            "patent_id": "6936475",
            "text": "13. A fusion protein of the formula: wherein GFP is green fluorescent protein; AEQ is aequorin; and LINKER is a polypeptide of 5-63 amino acids; wherein the linker includes the amino acid sequence Ser Gly Leu Arg Ser [SEQ ID NO: 26].",
            "dependent": "-1",
            "sequence": "13",
            "exemplary": "False"
        },
        {
            "uuid": "uo09zb52i0ms8tkn08uke4nl6",
            "patent_id": "5934028",
            "text": "A seismic isolator as set forth in claim 10 wherein said first ends of second and third links are of a configuration for welding to said frame.",
            "dependent": "-1",
            "sequence": "13",
            "exemplary": "False"
        },
        {
            "uuid": "ncjwzvisu6x44ai88utr6px9d",
            "patent_id": "6601158",
            "text": "The apparatus of claim 11, wherein each of the pluralities of extension value allows the output of the combining circuit to provide an output consistent with a different multi-sequence generator.",
            "dependent": "-1",
            "sequence": "13",
            "exemplary": "False"
        },
        {
            "uuid": "cftodyxd2112579yr15i3umz7",
            "patent_id": "9746405",
            "text": "13. A method for detecting free elements in a ceramic matrix composite component, the method comprising: providing a computed tomography device, comprising: positioning the ceramic matrix composite component between the radiation source and the first grating; rotating the ceramic matrix composite component orthogonally to one or both of the first grating and the second grating; stepping the first grating or the second grating at each component position in the plurality of component positions to provide phase steps; incrementally rotating one or both of the ceramic matrix composite component and the computed tomography device to provide a plurality of component positions; directing radiation from the radiation source to the detector at each phase step of each component position in the plurality of component positions to acquire information from the ceramic matrix composite component; generating phase contrast and dark field contrast images corresponding to variations in density with the information from the ceramic matrix composite component; correlating the variations in density to at least one free element; and displaying distribution of the at least one free element within the ceramic matrix composite component wherein the rotating of the component orthogonally provides information relating to plies of the ceramic matrix composite component other than 90 degree plies of the ceramic matrix composite component and the incrementally rotating provides 360 degree views of the ceramic matrix composite component.",
            "dependent": "-1",
            "sequence": "13",
            "exemplary": "False"
        }
    ]
}