{
    "table_name": "DRAW_DESC_TEXT_2021",
    "table_fullname": "PATENTSVIEW.PATENTSVIEW.DRAW_DESC_TEXT_2021",
    "column_names": [
        "text",
        "sequence",
        "uuid",
        "patent_id"
    ],
    "column_types": [
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "72404f44-9964-11eb-9615-121df0c29c1e",
            "patent_id": "D908485",
            "text": "FIG. 9 is a top view of the design of FIG. 6 ;",
            "sequence": 10
        },
        {
            "uuid": "73f4ba4a-9964-11eb-9615-121df0c29c1e",
            "patent_id": "10904214",
            "text": "FIG. 9 is a logic flow diagram of assessing a security risk and performing a security response in accordance with the present invention.",
            "sequence": 10
        },
        {
            "uuid": "7254487e-9964-11eb-9615-121df0c29c1e",
            "patent_id": "D909004",
            "text": "FIG. 10 is a bottom view of the remote control device shown in FIG. 7 .",
            "sequence": 10
        },
        {
            "uuid": "a5934620-4015-11ec-b427-12de62d610b1",
            "patent_id": "11106815",
            "text": "FIG. 4C shows a process for searching for information housed in the system in instances where a field level method of data encryption is utilized.",
            "sequence": 10
        },
        {
            "uuid": "ab01dfd9-4019-11ec-b427-12de62d610b1",
            "patent_id": "11123047",
            "text": "FIGS. 8A, 8B, 8C illustrate results of ex vivo imaging experiments in the abdominal aorta of a rabbit following AF750 NIR fluorophore injected into the artery wall. FIG. 8A : Three imaging sessions of the same region of the vessel were performed with catheter placed in different intraluminal positions. Representative ultrasound image of the vessel cross section obtained from each position is presented in black and white colors. Each colored circular ring represents corresponding raw NIRF or corrected NIRF signals, and are depicted on the interior of the IVUS catheter, as well as externally around the vessel wall. FIG. 8B : Representation of the raw and corrected NIRF two dimensional images obtained in different intraluminal positions. FIG. 8C Comparison between raw and corrected NIRF signals in pullback position 6 mm. All scale bars 1 mm.",
            "sequence": 10
        }
    ]
}