{
    "table_name": "PATENTSVIEW.GOVERNMENT_INTEREST",
    "table_fullname": "PATENTSVIEW.PATENTSVIEW.GOVERNMENT_INTEREST",
    "column_names": [
        "patent_id",
        "gi_statement"
    ],
    "column_types": [
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null
    ],
    "sample_rows": [
        {
            "patent_id": "10593821",
            "gi_statement": "ACKNOWLEDGEMENT OF GOVERNMENT SUPPORT This invention was made with Government support under Grant no. IIP-1134849, Grant no. 1357419, and Grant no. DGE1110007, awarded by the National Science Foundation. The Government has certain rights in this invention."
        },
        {
            "patent_id": "8377831",
            "gi_statement": "ACKNOWLEDGEMENTS This invention was made with government support under funding by the Department of Energy Basic Energy Sciences (DE-FG02-01ER15255) and the National Science Foundation (CTS-0207781). The government may have certain rights in the invention."
        },
        {
            "patent_id": "7448441",
            "gi_statement": "CONTRACTUAL ORIGIN OF THE INVENTION The United States Government has rights in this invention under Contract No. DE-AC36-99GO10337 between the U.S. Department of Energy and the National Renewable Energy Laboratory, a division of Midwest Research Institute."
        },
        {
            "patent_id": "7067022",
            "gi_statement": "CONTRACTUAL ORIGIN OF THE INVENTION This invention was made with United States Government support under contract number DE-AC07-99ID13727, awarded by the. United States Department of Energy. The United States Government has certain rights in the invention."
        },
        {
            "patent_id": "6863021",
            "gi_statement": "CROSS-REFERENCE TO RELATED DOCUMENTS This invention was made with government support under contract F33615-99-C-2961 awarded by the US Army Space and Missile Defense Command. The United States Government may therefore have certain rights to this invention."
        }
    ]
}