{
    "table_name": "POSTS_QUESTIONS",
    "table_fullname": "STACKOVERFLOW.STACKOVERFLOW.POSTS_QUESTIONS",
    "column_names": [
        "last_edit_date",
        "owner_display_name",
        "accepted_answer_id",
        "owner_user_id",
        "tags",
        "last_activity_date",
        "body",
        "title",
        "view_count",
        "community_owned_date",
        "creation_date",
        "post_type_id",
        "answer_count",
        "last_editor_display_name",
        "id",
        "last_editor_user_id",
        "comment_count",
        "favorite_count",
        "parent_id",
        "score"
    ],
    "column_types": [
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "NUMBER",
        "TEXT",
        "NUMBER"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "id": 5501349,
            "title": "Open website in the user's default browser without letting them launch anything else?",
            "body": "<p>I would like to open a website in a user's default web browser, however since the url is user-defined I would also like to prevent them from doing anything other than opening a website.</p>\n\n<p>I have seen people use <code>Process.Start(url);</code> to open a site in the default browser, but since the url is user-defined I want to be sure they don't enter something like a script location and execute it. </p>\n\n<p>I also don't want to use <code>Process.Start(\"iexplore\", url);</code> since I would rather open the link in the user's default browser.</p>\n\n<p>Is there a way I can open a website in the user's default browser, without letting them launch any other process or command?</p>\n\n<p><strong>EDIT</strong></p>\n\n<p>For example, I don't want users to be able to enter <code>C:\\Windows\\Notepad.exe</code> into the Customer's Website field and open Notepad when they click the Website link</p>\n\n<p><strong>EDIT #2</strong></p>\n\n<p>I am <strong>not</strong> looking for a way to filter user's access online or have this substitute for property security. I am simply looking for a way to prevent users from launching any other application by entering in a bad url. If they enter \"google\" for a Customer's website, it should not throw an Open With file dialog, but instead launch the user's default web browser with the word \"google\" in the URL</p>",
            "accepted_answer_id": 5501615.0,
            "answer_count": 7,
            "comment_count": 19,
            "community_owned_date": null,
            "creation_date": 1301581207630000,
            "favorite_count": NaN,
            "last_activity_date": 1301584636283000,
            "last_edit_date": 1301584153647000.0,
            "last_editor_display_name": null,
            "last_editor_user_id": 302677.0,
            "owner_display_name": null,
            "owner_user_id": 302677,
            "parent_id": null,
            "post_type_id": 1,
            "score": 7,
            "tags": "c#|.net|desktop-application",
            "view_count": 13116
        },
        {
            "id": 5516641,
            "title": "Smoothing function for battery voltage display to reduce spikes in embedded system",
            "body": "<p>Reading a battery voltage in an embedded device.  However, the actual voltage varies greatly depending upon system load.  We need a method to reduce the fluctuation of the voltage to display the best value.</p>\n\n<p>Currently, we're using a rolling/moving average.  However, over the last 15 readings, the result still fluctuates too much.</p>\n\n<p>In reading about smoothing algorithms, it appears that b-splines, kernel filters, or some other smoothing algorithms would be ideal.  However, I can't find a simple example that doesn't use numpy or intrinsic functions within mathcad or some such.</p>\n\n<p>Anybody know of a simple-to-implement function that could help with this?  This is a C++ project (using Qt 4.5) with just the bar minimum of libraries.  I'd prefer to stay in the integer domain (showing the voltage in millivolts from 3300-4200).</p>\n\n<p>TIA\nMike</p>",
            "accepted_answer_id": 5516812.0,
            "answer_count": 7,
            "comment_count": 0,
            "community_owned_date": null,
            "creation_date": 1301678181983000,
            "favorite_count": 2.0,
            "last_activity_date": 1451160022947000,
            "last_edit_date": NaN,
            "last_editor_display_name": null,
            "last_editor_user_id": NaN,
            "owner_display_name": null,
            "owner_user_id": 45580,
            "parent_id": null,
            "post_type_id": 1,
            "score": 7,
            "tags": "c++|embedded|battery",
            "view_count": 3023
        },
        {
            "id": 4848534,
            "title": "Resharper (or Visual Studio) auto completion",
            "body": "<p>I'm using VS 2010 with resharper. If I have a class called ConfigParserTests and then write </p>\n\n<p><code>new ConfigParser( </code></p>\n\n<p>the code will auto complete to </p>\n\n<p><code>new ConfigParserTests() </code></p>\n\n<p>which is not what I want. Any idea how to disable this nasty feature.</p>\n\n<p>[Edit] </p>\n\n<p>What is want is to write out  </p>\n\n<p><code>new ConfigParser()</code> </p>\n\n<p>without pressing \"Esc\". In this case I am using TDD so ConfigParser does not exist.</p>\n\n<p>[/Edit]</p>\n\n<p>I have been looking around in both the resharper and VS intellisense menus without finding anything helpful.</p>",
            "accepted_answer_id": NaN,
            "answer_count": 7,
            "comment_count": 0,
            "community_owned_date": null,
            "creation_date": 1296458999860000,
            "favorite_count": 1.0,
            "last_activity_date": 1357233622743000,
            "last_edit_date": 1296556692013000.0,
            "last_editor_display_name": null,
            "last_editor_user_id": 56648.0,
            "owner_display_name": null,
            "owner_user_id": 56648,
            "parent_id": null,
            "post_type_id": 1,
            "score": 8,
            "tags": "visual-studio-2010|resharper|intellisense",
            "view_count": 6904
        },
        {
            "id": 4868170,
            "title": "Protecting a system deployed in a \"hostile\" environment",
            "body": "<p>At my company we are developing a large system, comprised of several servers.\nThe system is comprised from about 5 logical components. Data is stored in XMLs, MS SQL, and SQLite. It's a .Net system(mostly) ,the components communicate using WCF, and some custom UDP.\nClients access the system mostly through the custom UDP or WEB(ASP.NET &amp; Silverlight). </p>\n\n<p>Protecting the communication is easy, some SSL, and some security on the WCF and we're done.</p>\n\n<p>The main problem we are facing is that the system needs to be deployed on a client's site, a client that we dont necessarily trust. We need to defend the data on the servers, and the software itself from reverse engineering. Both are crucially important to us.</p>\n\n<p>Also we need a kill switch, i would like something that destroys the data and the software, upon command, or if unable to call home for a certain period of time.</p>\n\n<p>The direction that i was thinking of is using TPM, or something alike - some hardware encryption solution, in combination with another service that we could keep internally to encrypt all the software and data on the servers, so that the key's will come from our server safely in our site, and maybe  memory curtaining from the TPM.</p>\n\n<p>How do you suggest solving such a problem?</p>\n\n<hr>\n\n<p><strong>UPDATE</strong> 04/02\nI'm looking for practical suggestions, or advise on products that could help me, so I'm starting a bounty...</p>\n\n<p>Look guys we're basically putting our machine in the client's site (for business and practicality reasons), we own that machine, and the client receives everything he's paying for within hours, and he can do with the data whatever he wants. But i the algorithms running on that machine, and some of the data stored there is our trade secrets, that we want to protect.\nIdeally i would want the machine not to work at all not even boot if i dont say it's OK, and without my OK for everything on the machine to remain encrypted. Memory curtaining also looks like a nice way to protect the machine while executing. </p>\n\n<p>Also ideally I would want the HD's and the storage on all the machines to explode as soon as someone gets near them with a screwdriver...  :-) but i think that would be taking it too far ...</p>\n\n<hr>\n\n<p><strong>UPDATE</strong> 10/02\nO.K. after doing some research, I think we are going to try something in the same direction as the PS3 encryption system, except we're going to bring in the keys for decrypting the software and the data from our servers. doing so we can decide on our machines whether we  trust the server requesting the keys, we can get a kill switch just by reseating the machine. this is probably be based on TPM or something similar, maybe intel's TXT...\nI'm also really interested in memory curtaining as an important security feature...</p>\n\n<p>BTW, we cant solve this by moving the valuable parts of our system to our site, both because of business requirements and because its not technologically feasible - we would need a huge bandwidth.... </p>",
            "accepted_answer_id": 4868352.0,
            "answer_count": 7,
            "comment_count": 2,
            "community_owned_date": null,
            "creation_date": 1296595798163000,
            "favorite_count": 2.0,
            "last_activity_date": 1338570435463000,
            "last_edit_date": 1297330614700000.0,
            "last_editor_display_name": null,
            "last_editor_user_id": 182360.0,
            "owner_display_name": null,
            "owner_user_id": 182360,
            "parent_id": null,
            "post_type_id": 1,
            "score": 8,
            "tags": ".net|security|encryption|obfuscation|tpm",
            "view_count": 764
        },
        {
            "id": 4872476,
            "title": "Get first and last class with jQuery",
            "body": "<p>Might be a newbie question. I have a code line like this:</p>\n\n<pre><code>&lt;div class=\"template active\"&gt;\n</code></pre>\n\n<p>I need to get each class for itself.</p>\n\n<p><strong>I tried this code:</strong></p>\n\n<pre><code>$(this).attr(\"class\");\n</code></pre>\n\n<p>From that code I get \"template active\". What I need is one string with \"template\" and another with \"active\".</p>\n\n<p>What is the best jQuery function for that? Example?</p>",
            "accepted_answer_id": 4872493.0,
            "answer_count": 7,
            "comment_count": 2,
            "community_owned_date": null,
            "creation_date": 1296637482200000,
            "favorite_count": 4.0,
            "last_activity_date": 1371169408853000,
            "last_edit_date": NaN,
            "last_editor_display_name": null,
            "last_editor_user_id": NaN,
            "owner_display_name": null,
            "owner_user_id": 148496,
            "parent_id": null,
            "post_type_id": 1,
            "score": 8,
            "tags": "javascript|jquery",
            "view_count": 8548
        }
    ]
}