{
    "sample_rows": [
        {
            "CONTRACT_SOLICITATION_ID": "10-65",
            "ORIGINAL_CONTRACT_TITLE": "The Global Positioning System (GPS) Wing (GPSW) Military GPS User Equipment (MGUE) Request For Information",
            "ORIGINAL_CONTRACT_DESCRIPTION": "NAICS Code: 334220- Radio and Television Broadcasting and Wireless Communications Equipment Manufacturing. (Small Business size standard is 750 employees)  The Global Positioning System (GPS) Wing (GPSW) Military GPS User Equipment (MGUE) program at the Los Angeles Air Force Base (LAAFB) Space and Missile System Center (SMC) invites industry to provide feedback on the MGUE Acquisition. Specifically, the GPSW is contemplating and is currently drafting an approach for technical samples to be provided as part of each offeror's proposal for MGUE. Industry, to include small business, is encouraged to provide the GPSW feedback on the Government's intent to request technical samples for the MGUE Technology Development Phase. Early consideration is that the GPSW will request the following: A) A GB-GRAM-M receiver card capable of meeting MGUE TRD threshold requirements for position, velocity, and time determination using C/A-code, P(Y)-code, pseudo-M code, and M-code. Additional evaluation of receiver card performance will be used to determine the technical risk of meeting MGUE technical requirements, and maturity in implementing GPSW system specifications and interface specifications (such as ICD-GPS-700, IS-GPS-703, IS-GPS-722, IS-GPS-223, IS-GPS-224, and IS-GPS-250). Objective criteria under consideration includes Type II GB-GRAM capability, BFEA mitigation filtering, and partial or full external augmentation system (IS-GPS-250) implementation. B) A GRAM-S/M aviation receiver card, either SAASM or M-Code capable, which demonstrates the offeror's ability to develop and produce aviation receiver cards suitable for MSO certification. QUESTIONS: 1. How much time will be needed to develop and deliver technical samples after release of the RFP? 2. What are your recommendations for threshold test criteria? 3. What are your recommendations for objective test criteria? 4. How much funds would your company have to invest in a technical sample to meet the aforementioned requirements? Furthermore, the Government is also considering a Fixed Price Incentive Firm (FPIF) contract for the Technical Development through the Engineering and Manufacturing Development Phase of MGUE for the GB-GRAM, CGM, GRAM-S/M and GRAM-PMC. The GPSW is considering an incentive plan for the FPIF portion of the contract with an emphasis on cost, schedule, and technical/management. QUESTIONS: 1. Does your company have experience with FPIF development for similar programs? What lessons learned do you recommend the GPSW consider in using an FPIF type? 2. What types of incentive structures would motivate your company to complete the contract under target cost, to deliver on or before schedule, and to provide exemplary technical/management performance, given a competitive development environment? 3. What are the benefits of performing under a FPIF pricing arrangement for development compared to other pricing arrangements? 4. What are the challenges of performing under a FPIF pricing arrangement for development compared to other pricing arrangements? 5. What would your company suggest as a target profit rate under a FPIF pricing arrangement? 6. What would your company suggest as a share ratio under a FPIF pricing arrangement? Finally, the GPSW in interested in understanding what potential risks are associated with the MGUE effort from a contractor's point of view. For instance, what are the biggest risks a contractor would be faced with if awarded this effort? Risks can pertain to but need not be limited to program strategy, contract strategy, technical requirements, etc. Please provide at least your top five risks in sequential order from highest to lowest. All responsible sources (including Small and Small, Disadvantaged businesses) are invited to submit responses to the above questions in Microsoft Word Format via email to Capt Joseph Carrier at joseph.carrier@losangeles.af.mil NLT 13 Oct 2010.   OMBUDSMAN: An Ombudsman has been appointed to hear concerns from potential offerors. The purpose of the Ombudsman is to receive and communicate concerns from potential offerors when an offeror prefers not to use established channels to communicate his/her concern during the proposal development phase of this acquisition. The Ombudsman will communicate certain offeror issues, disagreements, and recommendations on this acquisition into the proper channels. The Ombudsman's role is not to diminish the authority of the program director or the contracting officer but to advocate an offerors concern on a non-attribution basis. The Ombudsman will maintain strict confidentiality as to the source of the concern when requested by the offeror. The Ombudsman will not participate in the evaluation of proposals or the source selection process for this acquisition. The Ombudsman is Mr. Jim Gill, SMC/PK, Phone: (310) 653-1789, Email: James.Gill@losangeles.af.mil. DECLARATION: This publication is for information only and does not constitute a Request for Proposal (RFP), Government sponsorship of contractor charges against any existing Government contract for attendance or proposal efforts, nor a Government promise to pay for any information received in response to this announcement.",
            "DEPARTMENT": "Dept Of Defense",
            "AGENCY": "Dept Of The Air Force",
            "AGENCY_OFFICE": "Fa8823  Sustainment Mcpnt Ssc/Pkl",
            "FIRST_POSTED_DATE": "2010-09-28 20:01:58-04:00",
            "RESPONSE_DEADLINE": "2010-10-13 17:00:00-08:00",
            "NAICS_CODE": 334220.0,
            "NAICS_DESCRIPTION": "Radio and Television Broadcasting and Wireless Communications Equipment Manufacturing",
            "SPECIAL_AWARD_PROVISION": null,
            "PERFORMANCE_CITY": "El Segundo",
            "PERFORMANCE_STATE": "California",
            "PERFORMANCE_ZIPCODE": "90245",
            "PERFORMANCE_COUNTRY": "United States",
            "PERFORMANCE_GEO_ID_CITY": "geoId/0622412",
            "PERFORMANCE_GEO_ID_STATE": "geoId/06",
            "PERFORMANCE_GEO_ID_ZIP": "zip/90245",
            "PERFORMANCE_GEO_ID_COUNTRY": "country/USA"
        },
        {
            "CONTRACT_SOLICITATION_ID": "FA8601-06-B-0003",
            "ORIGINAL_CONTRACT_TITLE": "Z -- Replacement of Steam Lines",
            "ORIGINAL_CONTRACT_DESCRIPTION": "The scope of this effort consists of Projects 04-0006 and 96-0082-2, Replacement of Steam Lines Steam Pit S-227 to Facility 20027, and Installation of Steam Lines from MHS-227 to S-173A. Efforts include furnishing all labor, equipment, appliances, devices and materials, and performing all operations necessary in connection with Install Steam Lines, Area B, including removals and miscellaneous work as shown indicated, or noted on the project drawings. In accordance with DFARS 252.204-7004, contractors must be registered in the Central Contract Registration (CCR) prior to award of solicitations issued after 31May1998. Registration may be accomplished at http://www.ccr.gov, or telephone at 1-888-CCR-2423. Every solicitation issued after 31May1998 must include the clause at DFARS 252.204-7004, entitled Required Central Contractor Registration. Notes: (1) The solicitation, specifications, and drawings will be available on the website on or about 30Jun2006, at http://www.fedbizopps.gov (2) Hard copies of the solicitation will not be provided. However, you may download and print the file from the website. (3) There is no fee for this solicitation. (4) A hard copy of the solicitation will be available for review at Dayton Builders Exchange, Minority Contractor Business Assistance Program, and F. W. Dodge Division in Dayton, OH. (5) A registration page will be attached to the website. You are not required to register. However, when you register you will receive notice of any amendments and/or addendums that may be issued to the solicitation. If you have not registered, it will be your responsibility to check the website for any changes to the solicitation. (6) Contractors shall be capable of securing bonding for the total proposed amount (7) You shall provide a signed copy of the SF1442 by the proposal closing date specified in the solicitation. There will be a public bid opening. (8) Contractors that are Debarred, Suspended, or Proposed for Debarrment are excluded from receiving contracts. Agencies also shall not consent to subcontract with such contractors. Proposals prepared by Debarred, Suspended, or otherwise ineligible contractors are at risk and expense of the contractor. POC: Thomas J. Kielbaso (937) 522-4553; Tom.Kielbaso@wpafb.af.mil",
            "DEPARTMENT": null,
            "AGENCY": null,
            "AGENCY_OFFICE": null,
            "FIRST_POSTED_DATE": "2006-06-14 00:00:00-04:00",
            "RESPONSE_DEADLINE": "2006-06-30 00:00:00-05:00",
            "NAICS_CODE": 221330.0,
            "NAICS_DESCRIPTION": "Steam and Air-Conditioning Supply",
            "SPECIAL_AWARD_PROVISION": null,
            "PERFORMANCE_CITY": null,
            "PERFORMANCE_STATE": null,
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": null,
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": null
        },
        {
            "CONTRACT_SOLICITATION_ID": "W911RX-13-t-0148-01",
            "ORIGINAL_CONTRACT_TITLE": "73--Culinary Equipment",
            "ORIGINAL_CONTRACT_DESCRIPTION": "This is a combined synopsis/solicitation for commercial items prepared in accordance with the format in FAR Subpart 12.6, as supplemented with additional information included in this notice.The solicitation number is W911RX-13-t-0148-01 and is issued as an invitation for bids (IFB), unless otherwise indicated herein.The solicitation document and incorporated provisions and clauses are those in effect through Federal Acquisition Circular FAC 2005-69. The associated North American Industrial Classification System (NAICS) code for this procurement is 335210 with a small business size standard of 750.00 employees.This requirement is a [ Small Business ] set-aside and only qualified offerors may submit bids.The solicitation pricing on www.FedBid.com will start on the date this solicitation is posted and will end on 2013-08-19 12:00:00.0 Eastern Time or as otherwise displayed at www.FedBid.com.FOB Destination shall be Fort Riley, KS 66442 The MICC Fort Riley requires the following items, Meet or Exceed, to the following: LI 001: dough sheeter - over 50 lbs FOB: Destination, 1, EA; LI 002: tank, 5 color set, kwikscan V FOB: Destination, 3, EA; LI 003: kwikscan V, color copy, printer FOB: Destination, 1, EA; LI 004: tablecloth, holiday red 90x156 FOB: Destination, 15, EA; LI 005: napkin, white, 20x20, 12 pack FFP FOB: Destination, 30, EA; LI 006: tablecloth holiday red 96R FOB: Destination, 15, EA; LI 007: tablecloth white 96R FOB: Destination, 15, EA; LI 008: measuring spoon S/S basic set FOB: Destination, 10, EA; LI 009: tray dbl wall curve, stainless 15x8.25 FOB: Destination, 5, EA; LI 010: stand 3 tier hammered 23dx20h FOB: Destination, 2, EA; LI 011: mixing bowl S/S 6 qt hd nsf-hubert FOB: Destination, 10, EA; LI 012: induction range, 1800 watts FOB: Destination, 1, EA; LI 013: crimper set, 8 piece S/S FOB: Destination, 12, EA; LI 014: mixing bowl S/S krona, 1.5 qt FOB: Destination, 10, EA; LI 015: edible frosting sheet, 1/4 size, 24 pk FOB: Destination, 3, EA; LI 016: table S/S top, alum frame, 24x36 FOB: Destination, 8, EA; LI 017: display tray, S/S 17x10.75x1.14 FOB: Destination, 6, EA; LI 018: fry pan, 12.5 stainless non-stick FFP fry pan, 12.5 stainless non-stick PURCHASE REQUEST NUMBER: 0010378372 FOB: Destination, 5, EA; LI 019: saute pan, 6 qt, S/S FOB: Destination, 3, EA; LI 020: sculpting tool set, 9 piece PURCHASE REQUEST NUMBER: 0010378372 FOB: Destination, 14, EA; LI 021: fondant smoother FOB: Destination, 5, EA; LI 022: saute pan, 8\" FOB: Destination, 10, EA; LI 023: sauce pan plain handle 10 qt FOB: Destination, 10, EA; LI 024: saute pan, 3 qt, S/S FOB: Destination, 9, EA; LI 025: roasting pan, GI 20.7/8x17.3/8x7 FOB: Destination, 2, EA; LI 026: cast iron skillet, 12\", enameled FOB: Destination, 10, EA; LI 027: springform pan, 9.5\" diameter, round FOB: Destination, 20, EA; LI 028: pastry bag, XL, green, 23.25x11,box FOB: Destination, 10, EA; LI 029: peeling knife, birds beak black FOB: Destination, 10, EA; LI 030: kitchen shears, premium, NSF FOB: Destination, 20, EA; LI 031: scale, mech portion, quickstop, washdwn FOB: Destination, 5, EA; LI 032: frosting sheet, 1/4 size, 8x11 24 pack FOB: Destination, 3, EA; LI 033: safety compact cabinet, 12 gal self clos FOB: Destination, 1, EA; LI 034: chef knife, 8\", fully forged blk handle FOB: Destination, 12, EA; LI 035: airbrush set, airmaster FOB: Destination, 2, EA; LI 036: digital scale, portion control 10lb FOB: Destination, 4, EA; LI 037: tablecloth, white, 90x156 FOB: Destination, 15, EA; LI 038: alum dredge/shaker, w/ handle FOB: Destination, 3, EA; LI 039: rice cooker, 37 cup, 120V FOB: Destination, 2, EA; LI 040: quick stick immersion blender CIN: GFEBS001037837200040 FOB: Destination, 1, EA; LI 041: brazier, 24 qt, aluminum FOB: Destination, 10, EA; LI 042: stock pot, 32 qt, aluminum FOB: Destination, 10, EA; LI 043: fry pan, 14.9/16\", aluminum non stick FOB: Destination, 10, EA; LI 044: cutting board, saf-t-grip set 12x18 FOB: Destination, 5, EA; LI 045: silpat, full size sheet pan, 18x26 FFP silpat, full size sheet pan, 18x26 FOB: Destination, 10, EA; LI 046: fry pan, 14.9/16\", aluminum, plain CIN: GFEBS001037837200046 FOB: Destination, 10, EA; LI 047: sauce pan, 10 qt, taprd aluminum FOB: Destination, 10, EA; LI 048: knife rack, S/S, sanitary w/ back FOB: Destination, 2, EA; LI 049: garnishing set, 80 piece with case FOB: Destination, 2, EA; LI 050: paring knife, 4\", straight, white nylon FOB: Destination, 24, EA; LI 051: sharpener 4 stage handheld 8lx1.5wx3.5h FOB: Destination, 5, EA; LI 052: peeler, black FOB: Destination, 20, EA; LI 053: cutlery set, 11 piece CIN: GFEBS001037837200053, 12, EA; LI 054: multi-oilstone set 11.1/2x2.1/2x1/2 FOB: Destination, 2, EA; LI 055: charcoal grill, 5' FOB: Destination, 1, EA; LI 056: chef knife, 6\" fully forged black handle FOB: Destination, 12, EA; LI 057: saute pan 9.4 qt S/S FFP FOB: Destination, 10, EA; LI 058: decor set, S/S, 36 piece + 2 couplers FOB: Destination, 10, EA; LI 059: brownie bite pan, 8 rows of 6 FOB: Destination, 10, EA; LI 060: plastic table folding legs 72x30x29h FOB: Destination, 5, EA; LI 061: full vision 6' showcase 38\"hx18\"dx70\"d FOB: Destination, 4, EA; LI 062: acrylic display cube, 5 sided 12x12x12 FOB: Destination, 8, EA; LI 063: rectangular display, tri-level, maple FFP FOB: Destination, 2, EA; LI 064: upright display, aisle 54x18x60, mirror FOB: Destination, 2, EA; LI 065: glass display tower, w/black base FOB: Destination, 2, EA; LI 066: estimated shipping FOB: Destination, 1, EA; Solicitation and Buy Attachments ***Question Submission: Interested offerors must submit any questions concerning the solicitation at the earliest time possible to enable the Buyer to respond. Questions must be submitted by using the 'Submit a Question' feature at www.fedbid.com. Questions not received within a reasonable time prior to close of the solicitation may not be considered.*** For this solicitation, MICC Fort Riley intends to conduct an online competitive reverse auction to be facilitated by the third-party reverse auction provider, FedBid, Inc. FedBid has developed an online, anonymous, browser based application to conduct the reverse auction. An Offeror may submit a series of pricing bids, which descend in price during the specified period of time for the aforementioned reverse auction. MICC Fort Riley is taking this action in an effort to improve both vendor access and awareness of requests and the agency's ability to gather multiple, competed, real-time bids.All responsible Offerors that respond to this solicitation MUST submit the pricing portion of their bid using the online exchange located at www.FedBid.com. There is no cost to register, review procurement data or make a bid on www.FedBid.com.Offerors that are not currently registered to use www.FedBid.com should proceed to www.FedBid.com to complete their free registration. Offerors that require special considerations or assistance may contact the FedBid Helpdesk at 877-9FEDBID (877-933-3243) or via email at clientservices@fedbid.com. Offerors may not artificially manipulate the price of a transaction on www.FedBid.com by any means. It is unacceptable to place bad faith bids, to use decoys in the www.FedBid.com process or to collude with the intent or effect of hampering the competitive www.FedBid.com process.Should offerors require additional clarification, notify the point of contact or FedBid at 877-9FEDBID (877-933-3243) or clientservices@fedbid.com.Use of FedBid: Buyers and Sellers agree to conduct this transaction through FedBid in compliance with the FedBid Terms of Use. Failure to comply with the below terms and conditions may result in offer being determined as non-responsive. New Equipment ONLY; NO remanufactured or \"gray market\" items. All items must be covered by the manufacturer's warranty. Bid MUST be good for 30 calendar days after close of Buy. Shipping must be free on board (FOB) destination CONUS (Continental U.S.), which means that the seller must deliver the goods on its conveyance at the destination specified by the buyer, and the seller is responsible for the cost of shipping and risk of loss prior to actual delivery at the specified destination. This solicitation requires registration with the System for Award Management (SAM) prior to award, pursuant to applicable regulations and guidelines. Registration information can be found at www.sam.gov. Delivery must be made within the specified number of days after receipt of order (ARO). The offeror must provide within its offer the number of days required to make delivery after it receives a purchase order from the buyer. The selected Offeror must comply with the following commercial item terms and conditions, which are incorporated herein by reference: FAR 52.212-1, Instructions to Offerors - Commercial Items, applies to this acquisition; FAR 52.212-3, Offeror Representations and Certifications - Commercial Items - the selected offeror must submit a completed copy of the listed representations and certifications; FAR 52.212-4, Contract Terms and Conditions - Commercial Items; FAR 52.212-5, Contract Terms and Conditions Required To Implement Statutes or Executive Orders-Commercial Items, paragraph (a) and the following clauses in paragraph (b): 52.222-21, 52.222-26, 52.222-35, 52.222-36, 52.222-37, 52.225-13, 52.232-34. The full text of the referenced FAR clauses may be accessed electronically at https://www.acquisition.gov/far/. Offeror must be registered in the Online Representations and Certifications Application (ORCA) database before an award can be made to them. If the offeror is not registered in ORCA, it may do so through the ORCA website at https://orca.bpn.gov.",
            "DEPARTMENT": null,
            "AGENCY": null,
            "AGENCY_OFFICE": null,
            "FIRST_POSTED_DATE": "2013-08-15 11:21:33-04:00",
            "RESPONSE_DEADLINE": "2013-08-19 00:00:00-05:00",
            "NAICS_CODE": NaN,
            "NAICS_DESCRIPTION": null,
            "SPECIAL_AWARD_PROVISION": "Total Small Business Set-Aside (FAR 19.5)",
            "PERFORMANCE_CITY": null,
            "PERFORMANCE_STATE": null,
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": null,
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": null
        },
        {
            "CONTRACT_SOLICITATION_ID": "FA3300-07-R-0027",
            "ORIGINAL_CONTRACT_TITLE": "76 -- AS-3 Leadership Studies Text Development",
            "ORIGINAL_CONTRACT_DESCRIPTION": null,
            "DEPARTMENT": "Dept Of Defense",
            "AGENCY": "Dept Of The Air Force",
            "AGENCY_OFFICE": "Fa3300  42 Cons Cc",
            "FIRST_POSTED_DATE": "2007-09-10 00:00:00-04:00",
            "RESPONSE_DEADLINE": "2007-09-17 00:00:00-05:00",
            "NAICS_CODE": 511130.0,
            "NAICS_DESCRIPTION": "Book Publishers",
            "SPECIAL_AWARD_PROVISION": "Total Small Business Set-Aside (FAR 19.5)",
            "PERFORMANCE_CITY": null,
            "PERFORMANCE_STATE": null,
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": null,
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": null
        },
        {
            "CONTRACT_SOLICITATION_ID": "RFI72061122C000LCD",
            "ORIGINAL_CONTRACT_TITLE": "Request for Information for the Design of Local Partner Capacity Development Contract",
            "ORIGINAL_CONTRACT_DESCRIPTION": "USAID/Zambia is exploring the design of an award to support the Mission\u0092s local partners holding prime awards. The Mission is releasing this request for information to 1) ascertain the interest and ability of organizations, inclusive of nonprofit and for-profit organizations, to bid on such a solicitation, and 2) to gather input on the draft activity design. Given the nature of this work, there are innate conflict of interest considerations for potential offerors to consider. First, current Mission award holders are not eligible to apply for this work. Second, the successful offeror will be ineligible to apply for other Mission awards during the duration of this contract. See the draft purpose and activity components in the Request for Information attached.",
            "DEPARTMENT": "Agency For International Development",
            "AGENCY": "Agency For International Development",
            "AGENCY_OFFICE": "Usaid/Zambia",
            "FIRST_POSTED_DATE": "2022-05-26 12:07:32.682000-04:00",
            "RESPONSE_DEADLINE": "2022-06-16 15:00:00+02:00",
            "NAICS_CODE": 541990.0,
            "NAICS_DESCRIPTION": "All Other Professional, Scientific, and Technical Services",
            "SPECIAL_AWARD_PROVISION": null,
            "PERFORMANCE_CITY": "Lusaka",
            "PERFORMANCE_STATE": "Lusaka",
            "PERFORMANCE_ZIPCODE": null,
            "PERFORMANCE_COUNTRY": "Zambia",
            "PERFORMANCE_GEO_ID_CITY": null,
            "PERFORMANCE_GEO_ID_STATE": null,
            "PERFORMANCE_GEO_ID_ZIP": null,
            "PERFORMANCE_GEO_ID_COUNTRY": "country/ZMB"
        }
    ],
    "table_name": "GOVERNMENT_CONTRACT_INDEX",
    "table_fullname": "GLOBAL_GOVERNMENT.CYBERSYN.GOVERNMENT_CONTRACT_INDEX",
    "column_names": [
        "PERFORMANCE_GEO_ID_ZIP",
        "PERFORMANCE_STATE",
        "PERFORMANCE_ZIPCODE",
        "ORIGINAL_CONTRACT_TITLE",
        "ORIGINAL_CONTRACT_DESCRIPTION",
        "PERFORMANCE_GEO_ID_COUNTRY",
        "DEPARTMENT",
        "AGENCY_OFFICE",
        "CONTRACT_SOLICITATION_ID",
        "PERFORMANCE_CITY",
        "SPECIAL_AWARD_PROVISION",
        "FIRST_POSTED_DATE",
        "PERFORMANCE_GEO_ID_CITY",
        "PERFORMANCE_COUNTRY",
        "NAICS_CODE",
        "AGENCY",
        "PERFORMANCE_GEO_ID_STATE",
        "RESPONSE_DEADLINE",
        "NAICS_DESCRIPTION"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TIMESTAMP_TZ",
        "TEXT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "TIMESTAMP_TZ",
        "TEXT"
    ],
    "description": [
        "The unique identifier for the contract fulfillment zipcode that is joinable to the GEOGRAPHY_INDEX",
        "The state location where the contract will be fulfilled",
        "The zipcode location where the contract will be fulfilled",
        "A short summary of the goods and services to be provided to the Federal government in the contract.",
        "A detailed statement of work and requirements of the services or products to be provided to the Federal government in the contract.",
        "The unique identifier for the contract fulfillment country that is joinable to the GEOGRAPHY_INDEX",
        "The Federal Department seeking services or products (e.g., Dept of Defense)",
        "The specific office within the agency handling the contract (e.g., Naval Research Laboratory)",
        "Unique solicitation number provided by the System for Award Management (sam.gov) for a specific contract.  Joinable to the GOVERNMENT_CONTRACT_AWARD_INDEX table.",
        "The city location where the contract will be fulfilled",
        "Indication of exclusivity for all or part of a contract to be set aside or reserved for a small or underrepresented business",
        "The earliest date the contract was posted on the System for Award Management (sam.gov)",
        "The unique identifier for the contract fulfillment city that is joinable to the GEOGRAPHY_INDEX",
        "The country location where the contract will be fulfilled",
        "The North American Industry Classification System code that best classifies the goods or services in the contract opportunity",
        "The agency underneath the department offering the contract (e.g., Dept of Navy)",
        "The unique identifier for the contract fulfillment state that is joinable to the GEOGRAPHY_INDEX",
        "Deadline for organizations to submit proposals for the contract",
        "Human-readable description of the industry related to the contract"
    ]
}