{
    "table_name": "GEO_US_CENSUS_PLACES.PLACES_DISTRICT_OF_COLUMBIA",
    "table_fullname": "GEO_OPENSTREETMAP_CENSUS_PLACES.GEO_US_CENSUS_PLACES.PLACES_DISTRICT_OF_COLUMBIA",
    "column_names": [
        "principal_city_msa",
        "place_gnis_code",
        "internal_point_geom",
        "internal_point_lon",
        "functional_status",
        "lsad_code",
        "area_water_meters",
        "internal_point_lat",
        "place_fips_code",
        "area_land_meters",
        "name_lsad",
        "place_name",
        "state_fips_code",
        "place_geom",
        "place_id",
        "principal_city_ne",
        "fips_class_code"
    ],
    "column_types": [
        "BOOLEAN",
        "TEXT",
        "BINARY",
        "FLOAT",
        "TEXT",
        "TEXT",
        "NUMBER",
        "FLOAT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "TEXT",
        "BINARY",
        "TEXT",
        "BOOLEAN",
        "TEXT"
    ],
    "description": [
        "Indicates if a place is the principal city for a metropolitan or micropolitan statistical area. The polygons defining metropolitan and micropolitan statistical areas are available in bigquery-public-data.geo_us_boundaries.us_msa ",
        "Current place GNIS code",
        "Geographic representation of the state's internal point, which is the point at or closest to the state's geographic center",
        "Longitude of the place's internal point, which is the point at or closest to the place's geographic center",
        "Current functional status code. A full list of possible results can be found: https://www.census.gov/geo/reference/funcstat.html",
        "Current legal/statistical area description code for each place. This helps differentiate between Census Designated Places (CDPs), which are statistical entities) and incorporated places, which are legal entities, among other differences. Census LSAD codes and their descriptions can be found in bigquery-public-data.census_lsad_codes.lsad_codes",
        "Area of the place that consists of water, in square meters",
        "Latitude of the place's internal point, which is the point at or closest to the place's geographic center",
        "Five-digit FIPS code for the given place",
        "Area of the place that consists of land, in square meters",
        "Current name and the translated legal/statistical area description for place",
        "Full text name of the place",
        "Two digit FIPS code that uniquely identifies each state. State names and their corresponding FIPS codes are available as a BigQuery Public Dataset: bigquery-public-data.census_fips_codes.states_2016",
        "Geographical representation of the polygon that defines the perimeter of each place. This column should be used as the GEO column for visualization in BigQuery Geo Viz",
        "Unique idenifier for each place. This is a concatenation of the current state FIPS code and the place FIPS code",
        "Indicates if a place is the principal city for a New England city and town area",
        "Current FIPS class code"
    ],
    "sample_rows": []
}