{
    "table_name": "SAN_FRANCISCO_TRANSIT_MUNI.ROUTES",
    "table_fullname": "SAN_FRANCISCO_PLUS.SAN_FRANCISCO_TRANSIT_MUNI.ROUTES",
    "column_names": [
        "route_type",
        "route_long_name",
        "route_short_name",
        "route_id"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "\"Describes the type of transportation used on a route. The following are valid values for this field:  -  light_rail: Streetcar or light rail. Used for any light rail or street-level system within a metropolitan area. -  subway: Subway or metro. Used for any underground rail system within a metropolitan area. -  rail: Used for intercity or long-distance travel. -  bus: Used for short- and long-distance bus routes. -  ferry: Used for short- and long-distance boat service. -  cable_car: Used for street-level cable cars where the cable runs beneath the car. -  tram: Gondola or suspended cable car. Typically used for aerial cable cars where the car is suspended from the cable. -  funicular: Used for any rail system that moves on steep inclines with a cable traction system.\"",
        "Contains the full name of a route. This name is generally more descriptive than the name from route_short_name and often includes the route's destination or stop.",
        "Contains the short name of a route. This is a short, abstract identifier like 32, 100X, or Green that riders use to identify a route, but which doesn't give any indication of what places the route serves.",
        "Unique identifier for each route. A single route will have multiple trips"
    ],
    "sample_rows": [
        {
            "route_id": "83X",
            "route_short_name": "83X",
            "route_long_name": "MID-MARKET EXPRESS",
            "route_type": "3"
        },
        {
            "route_id": "E",
            "route_short_name": "E",
            "route_long_name": "EMBARCADERO",
            "route_type": "0"
        },
        {
            "route_id": "3",
            "route_short_name": "3",
            "route_long_name": "JACKSON",
            "route_type": "3"
        },
        {
            "route_id": "M",
            "route_short_name": "M",
            "route_long_name": "OCEAN VIEW",
            "route_type": "0"
        },
        {
            "route_id": "8AX",
            "route_short_name": "8AX",
            "route_long_name": "BAYSHORE A EXPRESS",
            "route_type": "3"
        }
    ]
}