{
    "table_name": "BBC_NEWS.FULLTEXT",
    "table_fullname": "BBC.BBC_NEWS.FULLTEXT",
    "column_names": [
        "title",
        "filename",
        "category",
        "body"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "body": "The current slew of sports games offers unparalleled opportunities for fans who like to emulate on-field action without ever moving from the couch.\n\nThe two giants in the field - ESPN and EA Sports - have been locked in a heavyweight battle for years. The latter is the world's largest games manufacturer. Years of experience mean that the titles in their steady flow of sport sims are finely honed, massively entertaining and ooze flair. Sports broadcaster ESPN, meanwhile, has leant its name to a series of games that are similarly classy but lower in profile and price. But that status quo was changed forever - or for the next 15 years at least - by a deal earlier this year when ESPN sold EA the rights to its TV branding and on-air talent, meaning the ESPN games presently developed by Sega will have to come to and end in their present form.\n\nIt was a massive-money deal that not only raised eyebrows but stirred active indignation in many quarters, with fans concerned that it is set to enable EA to monopolise the sports gaming landscape to an unhealthy degree. Some particularly disgruntled fans set up an online petition that notched more than 18,000 virtual signatures. Many of those clicking to complain were already rankled, for the ESPN coup happened just weeks after EA had pulled off another enormous licensing deal, controversially giving them exclusive rights to teams and personnel from America&#191;s National Football League (NFL). So, will the Sega - ESPN range be missed? A key reason for answering \"yes\" is that liking or disliking a sports game regularly comes down to personal taste, and having some options available always proves hugely handy. Online soccer fans will testify to that, between bouts of arguing over which high-profile title rules supreme out of the similar-yet-hugely-different FIFA 2005 and Pro Evolution Soccer 4. On the same note, the ESPN 2k5 and EA sports games have so little to choose between them that picking favourites will come down to players' personal preferences and spending budget rather than any technical elements. Taking hockey and basketball as examples, both publishers' efforts are phenomenally entertaining and fairly accessible. They also both look awesome, with the Sega / ESPN versions perhaps shading things on a graphical front.\n\nIn terms of gameplay, I marginally preferred EA's NBA Live 2005 for basketball, and was more satisfied ice hockey-wise by ESPN's NHL 2K5. The ESPN games are a touch more arcade-like in look and feel and are slightly easier to get into, although like their rivals, they also offer a dizzyingly-extensive array of in-game tricks and overall challenge modes that should be enough to quench thirsts of even the most die-hard of sports fans. Perhaps the most interesting aspect of the ESPN deal will be seeing how it affects the presentation of EA's future titles. The front-end decoration of EA's games has become something of an art-form in itself, loaded with slick visuals and oodles of licensed music. They are also immediately identifiable as coming from the EA stable, and the inevitable compulsion to add an ESPN look will no doubt change that in various ways. What is a shame is that the ESPN titles took similar care about framing the gameplay with an authentic setting - their preambles look and sound much like they would on TV. They are neat and excellent-value games in their current form, and combining them with EA's own established brand should produce a truly formidable beast.\n",
            "title": "Sporting rivals go to extra time",
            "filename": "bbc/tech/056.txt",
            "category": "tech"
        },
        {
            "body": "Internet TV has been talked about since the start of the web as we know it now.\n\nBut any early attempts to do it - the UK's Home Choice started in 1992 - were thwarted by the lack of a fast network. Now that broadband networks are bedding down, and it is becoming essential for millions, the big telcos are keen to start shooting video down the line. In the face of competition from cable companies offering net voice calls, they are keen to be the top IPTV dogs. Software giant Microsoft thinks IPTV - Internet Protocol TV - is the future of television, and it sits neatly with its vision of the \"connected entertainment experience\". \"Telcos have been wanting to do video for a long time,\" Ed Graczyk, director of marketing for Microsoft IPTV, told the BBC News website. \"The challenge has been the broadband network, and the state of technology up until not so long ago did not add up to a feasible solution. \"Compression technology was not efficient enough, the net was not good enough. A lot of stars have aligned in the last 18 months to make it a reality.\"\n\nLast year, he said, was all about deal making and partnering up; shaping the \"IPTV ecosystem\". This year, those deals will start to play out and more services will come online. \"2006 is where it starts ramping up and expanding to other geographies - over time as broadband becomes more prevalent in South America, and other parts of Asia, it will expand,\" he added. What telcos really want to do is to send the \"triple-play\" of video, voice, and data down one single line, be it cable or DSL (Digital Subscriber Line). Some are talking about \"quadruple play\", too, with mobile services added into the mix. It is an emerging new breed of competition for satellite and cable broadcasters and operators. According to technology analysts, TDG Research, there will be 20 million subscribers to IPTV services in under six years.\n\nKey to the appeal of sending TV programmes down the same line as the web data, whenever a viewer wants it, is that it uses the same technology as the internet. It means there is not just a one-way relationship between the viewer and the \"broadcaster\". This allows for more DVD-like interactivity, limitless storage and broadcast space, bespoke channel \"playlists\", and thousands of hours of programmes or films at a viewer's fingertips. It potentially lets operators target programmes to smaller, niche or localised audiences, sending films to Bollywood fans for instance, as well as individual devices.\n\nOperators could also send high-definition programmes straight to the viewer, bypassing the need for a special broadcast receiver. Perhaps most compelling - yet some might say insignificant - is instantaneous channel flicking. Currently, there is a delay when you try to do this on satellite, cable or Freeview. With IPTV, the speed is 15 milliseconds. \"That gets rounds of applause,\" according to Mr Graczyk. Microsoft is one of the companies that started thinking about IPTV some time ago. \"We believe this will be the way all TV is delivered in the future - but that is several years away,\" said Mr Graczyk. \"As with music, TV has moved to digital formats. \"The things software can do to integrate media into devices means a whole new generation of connected entertainment experiences that cross devices from the TV, to the mobile, to the gaming console and so on.\" The company intends its Microsoft's IPTV Edition software, an end-to-end management and delivery platform, to let telcos to do exactly that, seamlessly. It has netted seven major telcos as customers, representing a potential audience of 25 million existing broadband subscribers. Its deal with US telco SBC was the largest TV software deal to date, said Mr Graczyk.\n\nIPTV is about more than telcos, though. There are several web-based offerings that aim to put control in the hands of the consumer by exploiting the net's power. Jeremy Allaire, chief of Brightcove, told the BBC News website that it would be a flavour of IPTV that was about harnessing the web as a \"channel\".\n\n\"It is not just niches, but about exploiting content not usually viewed,\" he said. \"We are focussed on the owners of video content who have rights to digitally distribute content, and who often see unencumbered distribution. \"For them to do it through cable and so on is price-prohibitive,\" he said. This type of IPTV service might also be a distribution channel for more established publishers who have unique types of content that they cannot offer through cable and satellite operators - history channel archives, for instance. What is a clear sign that IPTV has a future is that Microsoft is not the only player in the field. There are a lot of other \"middleware\" players providing similar management services as Microsoft, like Myrio and C-Cor. But it will up to the viewer to decide if it really is to be successful.\n",
            "title": "TV's future down the phone line",
            "filename": "bbc/tech/394.txt",
            "category": "tech"
        },
        {
            "body": "BBC Sport unveils its new analysis tool Piero at the Wales v England rugby union match on Saturday. But what does it do and how does it work?\n\nPicture the scene - Wales are camped on the England line in the dying seconds of the Six Nations' opening match. A ball is flung out to winger Shane Williams who crosses to score the winning try for Wales. But the England players are incensed - arguing that the pass was forward and the try should not stand. In the past, sports fans would be left debating the validity of the try for days and weeks to come. But BBC Sport's new tool Piero could end discussions in minutes.\n\nPiero, named after the Italian painter and pioneer of perspective Piero della Francesco, creates a virtual stadium in which virtual players can be tracked from almost any angle. Viewers will be able to see precisely how the ball was thrown and by whom, giving a greater depth to the growing wealth of analysis available during sports broadcasts. The technology has been created by BBC Research and Development for BBC Broadcast and BBC Outside Broadcasts. BBC Sport is the first client to start using the system. \"In order to keep audiences growing and growing... we need to work closely with people who create technology and innovation to bring sport to life,\" said Andrew Thompson, the BBC's head of development, new media and sports news. \"We want to appeal to core fans - to give them more analysis, more detail, more definitive answers about key passages of play.\" Piero works by taking telemetric data from fixed camera positions and sending that data inside the video signal to a PC which can then render the information into 3D graphics.\n\nThe more cameras using Piero, the better the detail possible out the other end when the data is turned into 3D models. \"It allows us to tell the story of a passage of play, tracking individual players across the field, looking at tactics,\" said Andy Townsend, from BBC Broadcast.\n\nAn operator can manipulate the information and provide almost real-time replays of incidents, as well as more in-depth analysis. The \"virtual camera\" can focus on virtually any aspect of the pitch, giving viewers an insight into action that the camera normally cannot see. Piero also provides a wealth of statistical detail - from the length of kicks, to the length of a run of an individual player and the height of a lift at any lineout. Mr Townsend said sports performance companies were already showing an interest in the technology. BBC Broadcast hopes the technology can be sold to third parties interested in using it a number of different ways - from sport broadcasting to entertainment and game shows.\n",
            "title": "Piero gives rugby perspective",
            "filename": "bbc/tech/028.txt",
            "category": "tech"
        },
        {
            "body": "Mobile phones are still enjoying a boom time in sales, according to research from technology analysts Gartner.\n\nMore than 674 million mobiles were sold last year globally, said the report, the highest total sold to date. The figure was 30% more than in 2003 and surpassed even the most optimistic predictions, Gartner said. Good design and the look of a mobile, as well as new services such as music downloads, could go some way to pushing up sales in 2005, said analysts. Although people were still looking for better replacement phones, there was evidence, according to Gartner, that some markets were seeing a slow-down in replacement sales.\n\n\"All the markets grew apart from Japan which shows that replacement sales are continuing in western Europe,\" mobile analyst Carolina Milanesi told the BBC News website. \"Japan is where north America and western European markets can be in a couple of years' time. \"They already have TV, music, ringtones, cameras, and all that we can think of on mobiles, so people have stopped buying replacement phones.\"\n\nBut there could be a slight slowdown in sales in European and US markets too, according to Gartner, as people wait to see what comes next in mobile technology. This means mobile companies have to think carefully about what they are offering in new models so that people see a compelling reason to upgrade, said Gartner. Third generation mobiles (3G) with the ability to handle large amounts of data transfer, like video, could drive people into upgrading their phones, but Ms Milanesi said it was difficult to say how quickly that would happen. \"At the end of the day, people have cameras and colour screens on mobiles and for the majority of people out there who don't really care about technology the speed of data to a phone is not critical.\" Nor would the rush to produce two or three megapixel camera phones be a reason for mobile owners to upgrade on its own. The majority of camera phone models are not at the stage where they can compete with digital cameras which also have flashes and zooms.\n\nMore likely to drive sales in 2005 would be the attention to design and aesthetics, as well as music services. The Motorola Razr V3 phone was typical of the attention to design that would be more commonplace in 2005, she added. This was not a \"women's thing\", she said, but a desire from men and women to have a gadget that is a form of self-expression too. It was not just about how the phone functioned, but about what it said about its owner. \"Western Europe has always been a market which is quite attentive to design,\" said Ms Milanesi.\n\n\"People are after something that is nice-looking, and together with that, there is the entertainment side. \"This year music will have a part to play in this.\" The market for full-track music downloads was worth just $20 million (£10.5 million) in 2004, but is set to be worth $1.8 billion (£9.4 million) by 2009, according to Jupiter Research. Sony Ericsson just released its Walkman branded mobile phone, the W800, which combines a digital music player with up to 30 hours' battery life, and a two megapixel camera. In July last year, Motorola and Apple announced a version of iTunes online music downloading service would be released which would be compatible with Motorola mobile phones. Apple said the new iTunes music player would become Motorola's standard music application for its music phones. But the challenge will be balancing storage capacity with battery life if mobile music hopes to compete with digital music players like the iPod. Ms Milanesi said more models would likely be released in the coming year with hard drives. But they would be more likely to compete with the smaller capacity music players that have around four gigabyte storage capacity, which would not put too much strain on battery life.\n",
            "title": "Looks and music to drive mobiles",
            "filename": "bbc/tech/064.txt",
            "category": "tech"
        },
        {
            "body": "Nintendo's new handheld console, the DS, will launch in Europe on 11 March, the company has announced.\n\nThe portable games machine, which features touch-screen control, will retail for £99 in the UK (149 euros). Nintendo said 15 games would be available in the UK at launch, with prices ranging from £19 to £29. More than 2.8 million DS consoles have been sold since it first appeared in the US and Japan at the end of 2004. Rival Sony has said it will launch its first handheld console, the PSP, in the US and Europe before the end of March. The PSP is expected to compete for a large part of the same handheld market, despite Sony's assertion that the machines are aimed at different consumers.\n\nThe 15 games available on the European launch date will include Nintendo's Super Mario 64 DS, as well as titles from third-party developers such as Ubisoft's Rayman DS.\n\nMore than 120 games are in development for the new console, Nintendo has said. The DS is backwards compatible with the Game Boy Advance, allowing the earlier machine's back catalogue of 700 games to be played. Additionally, a short-range wireless link for multiplayer gaming is built in to the DS, with a \"download play\" option which allows a group to play against each other, even if just one person owns a copy. Other features include a short-range messaging application called Pictochat, and a built-in microphone which is used in Sega's launch title Project Rub. Nintendo has also announced a media adapter, which will allow the console to play music and video on the move.\n\nThe launch price of £99 (149 euros) compares favourably with the US price of $149, according to John Houlihan, editor of the Computerandvideogames.com magazine. \"It's a very, very competitive price point. There are some innovative features, and Nintendo has created quite a buzz,\" he says. \"However, the line-up of games could have been stronger. Everyone wanted to see the eight-player Mario Kart DS, for example.\"\n\nMr Houlihan believes that there is likely to be an audience for both the Nintendo DS and Sony's new PSP, with the former aimed largely at a younger audience and the latter expected to be marketed as a multimedia device. \"The PSP is a sexy bit of kit, but Sony's attitude to the PSP has been very understated in Europe, so far,\" Mr Houlihan said. The worldwide handheld software market had an estimated worth of $2.6bn at the end of 2004, according to industry analysts Screen Digest.\n\nIn the past, games consoles and handhelds have generally launched much later in Europe than in other parts of the world. However Nintendo president Satoru Iwata said the company was \"pleased to have offered such a short period of time between the US and European launch\". \"Europe is an extremely important market for Nintendo,\" Mr Iwata added. Nintendo raised its sales targets for the DS console last December after selling a million in the US and Japan in just a few weeks.\n",
            "title": "Nintendo handheld given Euro date",
            "filename": "bbc/tech/084.txt",
            "category": "tech"
        }
    ]
}