{
    "table_name": "clinical_CPTAC_TCGA_pdc_V1_9",
    "table_fullname": "isb-cgc-bq.TCGA_versioned.clinical_CPTAC_TCGA_pdc_V1_9",
    "column_names": [
        "case_id",
        "case_submitter_id",
        "project_submitter_id",
        "primary_site",
        "disease_type",
        "demographic_id",
        "demographic_submitter_id",
        "race",
        "ethnicity",
        "gender",
        "days_to_birth",
        "days_to_death",
        "year_of_birth",
        "year_of_death",
        "cause_of_death",
        "vital_status",
        "diagnosis_id",
        "diagnosis_submitter_id",
        "primary_diagnosis",
        "age_at_diagnosis",
        "year_of_diagnosis",
        "days_to_hiv_diagnosis",
        "days_to_last_follow_up",
        "days_to_new_event",
        "ajcc_clinical_m",
        "ajcc_clinical_n",
        "ajcc_clinical_stage",
        "ajcc_clinical_t",
        "ajcc_pathologic_m",
        "ajcc_pathologic_n",
        "ajcc_pathologic_stage",
        "ajcc_pathologic_t",
        "ann_arbor_b_symptoms",
        "ann_arbor_clinical_stage",
        "ann_arbor_extranodal_involvement",
        "ann_arbor_pathologic_stage",
        "burkitt_lymphoma_clinical_variant",
        "circumferential_resection_margin",
        "classification_of_tumor",
        "colon_polyps_history",
        "figo_stage",
        "hiv_positive",
        "hpv_positive_type",
        "hpv_status",
        "iss_stage",
        "last_known_disease_status",
        "laterality",
        "ldh_level_at_diagnosis",
        "ldh_normal_range_upper",
        "lymph_nodes_positive",
        "lymphatic_invasion_present",
        "method_of_diagnosis",
        "morphology",
        "new_event_anatomic_site",
        "new_event_type",
        "perineural_invasion_present",
        "prior_malignancy",
        "prior_treatment",
        "progression_or_recurrence",
        "residual_disease",
        "site_of_resection_or_biopsy",
        "tissue_or_organ_of_origin",
        "tumor_grade",
        "tumor_stage",
        "vascular_invasion_present"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "case_id",
        "case_submitter_id",
        "project_submitter_id",
        "primary_site",
        "disease_type",
        "demographic_id",
        "demographic_submitter_id",
        "race",
        "ethnicity",
        "gender",
        "days_to_birth",
        "days_to_death",
        "year_of_birth",
        "year_of_death",
        "cause_of_death",
        "vital_status",
        "diagnosis_id",
        "diagnosis_submitter_id",
        "primary_diagnosis",
        "age_at_diagnosis",
        "year_of_diagnosis",
        "days_to_hiv_diagnosis",
        "days_to_last_follow_up",
        "days_to_new_event",
        "ajcc_clinical_m",
        "ajcc_clinical_n",
        "ajcc_clinical_stage",
        "ajcc_clinical_t",
        "ajcc_pathologic_m",
        "ajcc_pathologic_n",
        "ajcc_pathologic_stage",
        "ajcc_pathologic_t",
        "ann_arbor_b_symptoms",
        "ann_arbor_clinical_stage",
        "ann_arbor_extranodal_involvement",
        "ann_arbor_pathologic_stage",
        "burkitt_lymphoma_clinical_variant",
        "circumferential_resection_margin",
        "classification_of_tumor",
        "colon_polyps_history",
        "figo_stage",
        "hiv_positive",
        "hpv_positive_type",
        "hpv_status",
        "iss_stage",
        "last_known_disease_status",
        "laterality",
        "ldh_level_at_diagnosis",
        "ldh_normal_range_upper",
        "lymph_nodes_positive",
        "lymphatic_invasion_present",
        "method_of_diagnosis",
        "morphology",
        "new_event_anatomic_site",
        "new_event_type",
        "perineural_invasion_present",
        "prior_malignancy",
        "prior_treatment",
        "progression_or_recurrence",
        "residual_disease",
        "site_of_resection_or_biopsy",
        "tissue_or_organ_of_origin",
        "tumor_grade",
        "tumor_stage",
        "vascular_invasion_present"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        "Unique identifier associated with a specific patient (e.g. 24cb0fcb-63d6-11e8-bcf1-0a2705229b82)",
        "Unique identifier deriving from the data submitter that is associated with a specific patient (e.g. 05BR016)",
        "Project Name (e.g. CPTAC-2)",
        "The text term used to describe the general location of the malignant disease, as categorized by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O)",
        "The text term used to describe the type of malignant disease, as categorized by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O)",
        "Unique identifier attributed to data for the characterization of the patient by means of segmenting the population--for instance, characterization by age, sex, or race (e.g. 848b480c-0f56-11e9-a064-0a9c39d33490)",
        "Unique identifier deriving from data submitter that is attributed to data for the characterization of the patient by means of segmenting the population (e.g., characterization by age, sex, or race) (e.g. P001-DM)",
        "An arbitrary classification of a taxonomic group that is a division of a species; the provided values are based on the categories defined by the U.S. Office of Management and Business and used by the U.S. Census Bureau",
        "An individual's self-described social and cultural grouping, specifically whether an individual describes themselves as Hispanic or Latino, based on the categories defined by the U.S. Office of Management and Business and used by the U.S. Census Bureau",
        "Text designations that identify gender; identification is self-reported and may come from a form, questionnaire, interview, etc.",
        "Number of days between the date used for index and the date from a person's date of birth represented as a calculated negative number of days",
        "Number of days between the date used for index and the date from a person's date of death represented as a calculated number of days",
        "Numeric value to represent the calendar year in which an individual was born",
        "Numeric value to represent the year of the death of an individual",
        "Text term to identify the cause of death for a patient",
        "The survival state of the person registered on the protocol",
        "Unique identifier for data from the investigation, analysis and recognition of the presence and nature of disease, condition, or injury from expressed signs and symptoms; also, the scientific determination of any kind; the concise results of such an investigation (e.g. e8dd475b-693a-11ea-b1fd-0aad30af8a83)",
        "Unique identifier deriving from data submitter attributed to data from the investigation, analysis and recognition of the presence and nature of disease, condition, or injury from expressed signs and symptoms; also, the scientific determination of any kind; the concise results of such an investigation (e.g. 33-DX)",
        "Text term used to describe the patient's histologic diagnosis, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O)",
        "Age at the time of diagnosis expressed in number of days since birth",
        "Numeric value to represent the year of an individual's initial pathologic diagnosis of cancer",
        "Time interval from the date of the initial pathologic diagnosis to the date of human immunodeficiency diagnosis, represented as a calculated number of days",
        "Time interval from the date of last follow up to the date of initial pathologic diagnosis, represented as a calculated number of days",
        "Time interval from the date of new tumor event including progression, recurrence and new primary malignancies to the date of initial pathologic diagnosis, represented as a calculated number of days",
        "Extent of the distant metastasis for the cancer based on evidence obtained from clinical assessment parameters determined prior to treatment",
        "Extent of the regional lymph node involvement for the cancer based on evidence obtained from clinical assessment parameters determined prior to treatment",
        "Stage group determined from clinical information on the tumor (T), regional node (N) and metastases (M) and by grouping cases with similar prognosis for cancer",
        "Extent of the primary cancer based on evidence obtained from clinical assessment parameters determined prior to treatment",
        "Code to represent the defined absence or presence of distant spread or metastases (M) to locations via vascular channels or lymphatics beyond the regional lymph nodes, using criteria established by the American Joint Committee on Cancer (AJCC)",
        "The codes that represent the stage of cancer based on the nodes present (N stage) according to criteria based on multiple editions of the AJCC's Cancer Staging Manual",
        "The extent of a cancer, especially whether the disease has spread from the original site to other parts of the body based on AJCC staging criteria",
        "Code of pathological T (primary tumor) to define the size or contiguous extension of the primary tumor (T), using staging criteria from the American Joint Committee on Cancer (AJCC)",
        "Text term to signify whether lymphoma B-symptoms are present as noted in the patient's medical record",
        "The text term used to describe the clinical classification of lymphoma, as defined by the Ann Arbor Lymphoma Staging System",
        "Indicator that identifies whether a patient with malignant lymphoma has lymphomatous involvement of an extranodal site",
        "The text term used to describe the pathologic classification of lymphoma, as defined by the Ann Arbor Lymphoma Staging System",
        "Burkitt's lymphoma categorization based on clinical features that differ from other forms of the same disease",
        "Numeric value used to describe the non-peritonealised bare area of rectum, comprising anterior and posterior segments, when submitted as a surgical specimen resulting from excision of cancer of the rectum",
        "Text that describes the kind of disease present in the tumor specimen as related to a specific timepoint",
        "Yes/No indicator to describe if the subject had a previous history of colon polyps as noted in the history/physical or previous endoscopic report (s)",
        "The extent of a cervical or endometrial cancer within the body, especially whether the disease has spread from the original site to other parts of the body, as described by the International Federation of Gynecology and Obstetrics (FIGO) stages",
        "Text term to signify whether a physician has diagnosed HIV infection in a patient",
        "Text classification to represent the strain or type of human papillomavirus identified in an individual",
        "The findings of the oncogenic HPV",
        "The multiple myeloma disease stage at diagnosis",
        "Text term that describes the last known state or condition of an individual's neoplasm",
        "For tumors in paired organs, designates the side on which the cancer originates",
        "The 2 decimal place numeric laboratory value measured, assigned or computed related to the assessment of lactate dehydrogenase in a specimen",
        "The top value of the range of statistical characteristics that are supposed to represent accepted standard, non-pathological pattern for lactate dehydrogenase (units not specified)",
        "The number of lymph nodes involved with disease as determined by pathologic examination",
        "A yes/no indicator to ask if small or thin-walled vessel invasion is present, indicating lymphatic involvement",
        "Text term used to describe the method used to confirm the patients malignant diagnosis",
        "The third edition of the International Classification of Diseases for Oncology, published in 2000 used principally in tumor and cancer registries for coding the site (topography) and the histology (morphology) of neoplasms. The study of the structure of the cells and their arrangement to constitute tissues and, finally, the association among these to form organs. In pathology, the microscopic process of identifying normal and abnormal morphologic characteristics in tissues, by employing various cytochemical and immunocytochemical stains. A system of numbered categories for representation of data",
        "Text term to specify the anatomic location of the return of tumor after treatment",
        "Text term to identify a new tumor event",
        "A yes/no indicator to ask if perineural invasion or infiltration of tumor or cancer is present",
        "The yes/no/unknown indicator used to describe the patient's history of prior cancer diagnosis",
        "A yes/no/unknown/not applicable indicator related to the administration of therapeutic agents received before the body specimen was collected",
        "Yes/No/Unknown indicator to identify whether a patient has had a new tumor event after initial treatment",
        "Text terms to describe the status of a tissue margin following surgical resection",
        "The text term used to describe the anatomic site of origin, of the patient's malignant disease, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O)",
        "The text term used to describe the anatomic site of origin, of the patient's malignant disease, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O)",
        "Numeric value to express the degree of abnormality of cancer cells, a measure of differentiation and aggressiveness",
        "The extent of a cancer in the body. Staging is usually based on the size of the tumor, whether lymph nodes contain cancer, and whether the cancer has spread from the original site to other parts of the body. The accepted values for tumor_stage depend on the tumor site, type, and accepted staging system. These items should accompany the tumor_stage value as associated metadata",
        "The yes/no indicator to ask if large vessel or venous invasion was detected by surgery or presence in a tumor specimen"
    ],
    "sample_rows": [
        {
            "case_id": "6a477ef6-ec51-11e9-81b4-2a2ae2dbcce4",
            "case_submitter_id": "Internal Reference",
            "project_submitter_id": "CPTAC-TCGA",
            "primary_site": "Not Reported",
            "disease_type": "Other",
            "demographic_id": null,
            "demographic_submitter_id": null,
            "race": null,
            "ethnicity": null,
            "gender": null,
            "days_to_birth": null,
            "days_to_death": null,
            "year_of_birth": null,
            "year_of_death": null,
            "cause_of_death": null,
            "vital_status": null,
            "diagnosis_id": null,
            "diagnosis_submitter_id": null,
            "primary_diagnosis": null,
            "age_at_diagnosis": null,
            "year_of_diagnosis": null,
            "days_to_hiv_diagnosis": null,
            "days_to_last_follow_up": null,
            "days_to_new_event": null,
            "ajcc_clinical_m": null,
            "ajcc_clinical_n": null,
            "ajcc_clinical_stage": null,
            "ajcc_clinical_t": null,
            "ajcc_pathologic_m": null,
            "ajcc_pathologic_n": null,
            "ajcc_pathologic_stage": null,
            "ajcc_pathologic_t": null,
            "ann_arbor_b_symptoms": null,
            "ann_arbor_clinical_stage": null,
            "ann_arbor_extranodal_involvement": null,
            "ann_arbor_pathologic_stage": null,
            "burkitt_lymphoma_clinical_variant": null,
            "circumferential_resection_margin": null,
            "classification_of_tumor": null,
            "colon_polyps_history": null,
            "figo_stage": null,
            "hiv_positive": null,
            "hpv_positive_type": null,
            "hpv_status": null,
            "iss_stage": null,
            "last_known_disease_status": null,
            "laterality": null,
            "ldh_level_at_diagnosis": null,
            "ldh_normal_range_upper": null,
            "lymph_nodes_positive": null,
            "lymphatic_invasion_present": null,
            "method_of_diagnosis": null,
            "morphology": null,
            "new_event_anatomic_site": null,
            "new_event_type": null,
            "perineural_invasion_present": null,
            "prior_malignancy": null,
            "prior_treatment": null,
            "progression_or_recurrence": null,
            "residual_disease": null,
            "site_of_resection_or_biopsy": null,
            "tissue_or_organ_of_origin": null,
            "tumor_grade": null,
            "tumor_stage": null,
            "vascular_invasion_present": null
        },
        {
            "case_id": "27bf90ad-63d8-11e8-bcf1-0a2705229b82",
            "case_submitter_id": "TCGA-A2-A0YF",
            "project_submitter_id": "CPTAC-TCGA",
            "primary_site": "Breast",
            "disease_type": "Breast Invasive Carcinoma",
            "demographic_id": "f69c5ba5-7588-11e8-bcf1-0a2705229b82",
            "demographic_submitter_id": "TCGA-A2-A0YF-DM",
            "race": "Black or African American",
            "ethnicity": "Not Hispanic or Latino",
            "gender": "Female",
            "days_to_birth": -24660,
            "days_to_death": null,
            "year_of_birth": 1942,
            "year_of_death": null,
            "cause_of_death": null,
            "vital_status": "Alive",
            "diagnosis_id": "ff3135cf-70ca-11e8-bcf1-0a2705229b82",
            "diagnosis_submitter_id": "TCGA-A2-A0YF-DX",
            "primary_diagnosis": "Infiltrating duct carcinoma, NOS",
            "age_at_diagnosis": 24660,
            "year_of_diagnosis": "2009",
            "days_to_hiv_diagnosis": "--",
            "days_to_last_follow_up": 1535,
            "days_to_new_event": "--",
            "ajcc_clinical_m": "Not Reported",
            "ajcc_clinical_n": "Not Reported",
            "ajcc_clinical_stage": "Not Reported",
            "ajcc_clinical_t": "Not Reported",
            "ajcc_pathologic_m": "M0",
            "ajcc_pathologic_n": "N0 (i+)",
            "ajcc_pathologic_stage": "Stage I",
            "ajcc_pathologic_t": "T1b",
            "ann_arbor_b_symptoms": "Not Reported",
            "ann_arbor_clinical_stage": "Not Reported",
            "ann_arbor_extranodal_involvement": "Not Reported",
            "ann_arbor_pathologic_stage": "Not Reported",
            "burkitt_lymphoma_clinical_variant": "Not Reported",
            "circumferential_resection_margin": "--",
            "classification_of_tumor": "Not Reported",
            "colon_polyps_history": "--",
            "figo_stage": "Not Reported",
            "hiv_positive": "--",
            "hpv_positive_type": "--",
            "hpv_status": "--",
            "iss_stage": "Not Reported",
            "last_known_disease_status": "Not Reported",
            "laterality": "Not Reported",
            "ldh_level_at_diagnosis": "--",
            "ldh_normal_range_upper": "--",
            "lymph_nodes_positive": "--",
            "lymphatic_invasion_present": "Not Reported",
            "method_of_diagnosis": "Not Reported",
            "morphology": "8500/3",
            "new_event_anatomic_site": "--",
            "new_event_type": "--",
            "perineural_invasion_present": "Not Reported",
            "prior_malignancy": "No",
            "prior_treatment": "No",
            "progression_or_recurrence": "Not Reported",
            "residual_disease": "Not Reported",
            "site_of_resection_or_biopsy": "Breast, NOS",
            "tissue_or_organ_of_origin": "Breast, NOS",
            "tumor_grade": "Not Reported",
            "tumor_stage": "Stage I",
            "vascular_invasion_present": "Not Reported"
        },
        {
            "case_id": "2a407548-63d8-11e8-bcf1-0a2705229b82",
            "case_submitter_id": "TCGA-A2-A0YI",
            "project_submitter_id": "CPTAC-TCGA",
            "primary_site": "Breast",
            "disease_type": "Breast Invasive Carcinoma",
            "demographic_id": "f69baefb-7588-11e8-bcf1-0a2705229b82",
            "demographic_submitter_id": "TCGA-A2-A0YI-DM",
            "race": "White",
            "ethnicity": "Not Hispanic or Latino",
            "gender": "Female",
            "days_to_birth": -22961,
            "days_to_death": null,
            "year_of_birth": 1947,
            "year_of_death": null,
            "cause_of_death": null,
            "vital_status": "Alive",
            "diagnosis_id": "ff2f36af-70ca-11e8-bcf1-0a2705229b82",
            "diagnosis_submitter_id": "TCGA-A2-A0YI-DX",
            "primary_diagnosis": "Infiltrating duct and lobular carcinoma",
            "age_at_diagnosis": 22961,
            "year_of_diagnosis": "2009",
            "days_to_hiv_diagnosis": "--",
            "days_to_last_follow_up": 1505,
            "days_to_new_event": "--",
            "ajcc_clinical_m": "Not Reported",
            "ajcc_clinical_n": "Not Reported",
            "ajcc_clinical_stage": "Not Reported",
            "ajcc_clinical_t": "Not Reported",
            "ajcc_pathologic_m": "M0",
            "ajcc_pathologic_n": "N0 (i+)",
            "ajcc_pathologic_stage": "Stage I",
            "ajcc_pathologic_t": "T1c",
            "ann_arbor_b_symptoms": "Not Reported",
            "ann_arbor_clinical_stage": "Not Reported",
            "ann_arbor_extranodal_involvement": "Not Reported",
            "ann_arbor_pathologic_stage": "Not Reported",
            "burkitt_lymphoma_clinical_variant": "Not Reported",
            "circumferential_resection_margin": "--",
            "classification_of_tumor": "Not Reported",
            "colon_polyps_history": "--",
            "figo_stage": "Not Reported",
            "hiv_positive": "--",
            "hpv_positive_type": "--",
            "hpv_status": "--",
            "iss_stage": "Not Reported",
            "last_known_disease_status": "Not Reported",
            "laterality": "Not Reported",
            "ldh_level_at_diagnosis": "--",
            "ldh_normal_range_upper": "--",
            "lymph_nodes_positive": "--",
            "lymphatic_invasion_present": "Not Reported",
            "method_of_diagnosis": "Not Reported",
            "morphology": "8522/3",
            "new_event_anatomic_site": "--",
            "new_event_type": "--",
            "perineural_invasion_present": "Not Reported",
            "prior_malignancy": "No",
            "prior_treatment": "No",
            "progression_or_recurrence": "Not Reported",
            "residual_disease": "Not Reported",
            "site_of_resection_or_biopsy": "Breast, NOS",
            "tissue_or_organ_of_origin": "Breast, NOS",
            "tumor_grade": "Not Reported",
            "tumor_stage": "Stage I",
            "vascular_invasion_present": "Not Reported"
        },
        {
            "case_id": "31d4b8ba-63d8-11e8-bcf1-0a2705229b82",
            "case_submitter_id": "TCGA-A7-A0CD",
            "project_submitter_id": "CPTAC-TCGA",
            "primary_site": "Breast",
            "disease_type": "Breast Invasive Carcinoma",
            "demographic_id": "f69bf1b6-7588-11e8-bcf1-0a2705229b82",
            "demographic_submitter_id": "TCGA-A7-A0CD-DM",
            "race": "White",
            "ethnicity": "Not Hispanic or Latino",
            "gender": "Female",
            "days_to_birth": -24242,
            "days_to_death": null,
            "year_of_birth": 1943,
            "year_of_death": null,
            "cause_of_death": null,
            "vital_status": "Alive",
            "diagnosis_id": "ff2ffe73-70ca-11e8-bcf1-0a2705229b82",
            "diagnosis_submitter_id": "TCGA-A7-A0CD-DX",
            "primary_diagnosis": "Infiltrating duct carcinoma, NOS",
            "age_at_diagnosis": 24242,
            "year_of_diagnosis": "2009",
            "days_to_hiv_diagnosis": "--",
            "days_to_last_follow_up": 1165,
            "days_to_new_event": "--",
            "ajcc_clinical_m": "Not Reported",
            "ajcc_clinical_n": "Not Reported",
            "ajcc_clinical_stage": "Not Reported",
            "ajcc_clinical_t": "Not Reported",
            "ajcc_pathologic_m": "M0",
            "ajcc_pathologic_n": "N0",
            "ajcc_pathologic_stage": "Stage I",
            "ajcc_pathologic_t": "T1",
            "ann_arbor_b_symptoms": "Not Reported",
            "ann_arbor_clinical_stage": "Not Reported",
            "ann_arbor_extranodal_involvement": "Not Reported",
            "ann_arbor_pathologic_stage": "Not Reported",
            "burkitt_lymphoma_clinical_variant": "Not Reported",
            "circumferential_resection_margin": "--",
            "classification_of_tumor": "Not Reported",
            "colon_polyps_history": "--",
            "figo_stage": "Not Reported",
            "hiv_positive": "--",
            "hpv_positive_type": "--",
            "hpv_status": "--",
            "iss_stage": "Not Reported",
            "last_known_disease_status": "Not Reported",
            "laterality": "Not Reported",
            "ldh_level_at_diagnosis": "--",
            "ldh_normal_range_upper": "--",
            "lymph_nodes_positive": "--",
            "lymphatic_invasion_present": "Not Reported",
            "method_of_diagnosis": "Not Reported",
            "morphology": "8500/3",
            "new_event_anatomic_site": "--",
            "new_event_type": "--",
            "perineural_invasion_present": "Not Reported",
            "prior_malignancy": "Yes",
            "prior_treatment": "No",
            "progression_or_recurrence": "Not Reported",
            "residual_disease": "Not Reported",
            "site_of_resection_or_biopsy": "Breast, NOS",
            "tissue_or_organ_of_origin": "Breast, NOS",
            "tumor_grade": "Not Reported",
            "tumor_stage": "Stage I",
            "vascular_invasion_present": "Not Reported"
        },
        {
            "case_id": "4377f550-63d8-11e8-bcf1-0a2705229b82",
            "case_submitter_id": "TCGA-AA-3526",
            "project_submitter_id": "CPTAC-TCGA",
            "primary_site": "Colon",
            "disease_type": "Colon Adenocarcinoma",
            "demographic_id": "f69d25dc-7588-11e8-bcf1-0a2705229b82",
            "demographic_submitter_id": "TCGA-AA-3526-DM",
            "race": "Not Reported",
            "ethnicity": "Not Reported",
            "gender": "Male",
            "days_to_birth": -21123,
            "days_to_death": null,
            "year_of_birth": 1950,
            "year_of_death": null,
            "cause_of_death": null,
            "vital_status": "Alive",
            "diagnosis_id": "ff2c6d4c-70ca-11e8-bcf1-0a2705229b82",
            "diagnosis_submitter_id": "TCGA-AA-3526-DX",
            "primary_diagnosis": "Adenocarcinoma, NOS",
            "age_at_diagnosis": 21123,
            "year_of_diagnosis": "2007",
            "days_to_hiv_diagnosis": "--",
            "days_to_last_follow_up": 580,
            "days_to_new_event": "--",
            "ajcc_clinical_m": "Not Reported",
            "ajcc_clinical_n": "Not Reported",
            "ajcc_clinical_stage": "Not Reported",
            "ajcc_clinical_t": "Not Reported",
            "ajcc_pathologic_m": "M0",
            "ajcc_pathologic_n": "N0",
            "ajcc_pathologic_stage": "Stage I",
            "ajcc_pathologic_t": "T2",
            "ann_arbor_b_symptoms": "Not Reported",
            "ann_arbor_clinical_stage": "Not Reported",
            "ann_arbor_extranodal_involvement": "Not Reported",
            "ann_arbor_pathologic_stage": "Not Reported",
            "burkitt_lymphoma_clinical_variant": "Not Reported",
            "circumferential_resection_margin": "--",
            "classification_of_tumor": "Not Reported",
            "colon_polyps_history": "--",
            "figo_stage": "Not Reported",
            "hiv_positive": "--",
            "hpv_positive_type": "--",
            "hpv_status": "--",
            "iss_stage": "Not Reported",
            "last_known_disease_status": "Not Reported",
            "laterality": "Not Reported",
            "ldh_level_at_diagnosis": "--",
            "ldh_normal_range_upper": "--",
            "lymph_nodes_positive": "--",
            "lymphatic_invasion_present": "Not Reported",
            "method_of_diagnosis": "Not Reported",
            "morphology": "8140/3",
            "new_event_anatomic_site": "--",
            "new_event_type": "--",
            "perineural_invasion_present": "Not Reported",
            "prior_malignancy": "No",
            "prior_treatment": "No",
            "progression_or_recurrence": "Not Reported",
            "residual_disease": "Not Reported",
            "site_of_resection_or_biopsy": "Sigmoid colon",
            "tissue_or_organ_of_origin": "Sigmoid colon",
            "tumor_grade": "Not Reported",
            "tumor_stage": "Stage I",
            "vascular_invasion_present": "Not Reported"
        }
    ]
}