{
    "table_name": "clinical_gdc_r29",
    "table_fullname": "isb-cgc-bq.TCGA_versioned.clinical_gdc_r29",
    "column_names": [
        "submitter_id",
        "case_id",
        "diag__treat__count",
        "primary_site",
        "disease_type",
        "proj__name",
        "proj__project_id",
        "demo__demographic_id",
        "demo__gender",
        "demo__race",
        "demo__ethnicity",
        "demo__vital_status",
        "demo__days_to_birth",
        "demo__year_of_birth",
        "demo__age_at_index",
        "demo__year_of_death",
        "demo__days_to_death",
        "demo__state",
        "demo__created_datetime",
        "demo__updated_datetime",
        "diag__diagnosis_id",
        "diag__ajcc_clinical_n",
        "diag__masaoka_stage",
        "diag__ajcc_clinical_m",
        "diag__primary_diagnosis",
        "diag__primary_gleason_grade",
        "diag__year_of_diagnosis",
        "diag__figo_stage",
        "diag__progression_or_recurrence",
        "diag__ajcc_pathologic_m",
        "diag__site_of_resection_or_biopsy",
        "diag__ajcc_staging_system_edition",
        "diag__icd_10_code",
        "diag__age_at_diagnosis",
        "diag__ajcc_clinical_t",
        "diag__days_to_last_follow_up",
        "diag__ajcc_pathologic_stage",
        "diag__tumor_grade",
        "diag__last_known_disease_status",
        "diag__ann_arbor_extranodal_involvement",
        "diag__ajcc_clinical_stage",
        "diag__secondary_gleason_grade",
        "diag__synchronous_malignancy",
        "diag__morphology",
        "diag__ajcc_pathologic_t",
        "diag__igcccg_stage",
        "diag__classification_of_tumor",
        "diag__ann_arbor_clinical_stage",
        "diag__ann_arbor_b_symptoms",
        "diag__tumor_stage",
        "diag__prior_treatment",
        "diag__ajcc_pathologic_n",
        "diag__tissue_or_organ_of_origin",
        "diag__prior_malignancy",
        "diag__state",
        "diag__created_datetime",
        "diag__updated_datetime",
        "exp__exposure_id",
        "exp__height",
        "exp__weight",
        "exp__bmi",
        "exp__years_smoked",
        "exp__pack_years_smoked",
        "exp__cigarettes_per_day",
        "exp__alcohol_history",
        "exp__state",
        "exp__created_datetime",
        "exp__updated_datetime",
        "state",
        "updated_datetime"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "STRING",
        "TIMESTAMP",
        "TIMESTAMP",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "FLOAT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "TIMESTAMP",
        "TIMESTAMP",
        "STRING",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "STRING",
        "TIMESTAMP",
        "TIMESTAMP",
        "STRING",
        "TIMESTAMP"
    ],
    "nested_column_names": [
        "submitter_id",
        "case_id",
        "diag__treat__count",
        "primary_site",
        "disease_type",
        "proj__name",
        "proj__project_id",
        "demo__demographic_id",
        "demo__gender",
        "demo__race",
        "demo__ethnicity",
        "demo__vital_status",
        "demo__days_to_birth",
        "demo__year_of_birth",
        "demo__age_at_index",
        "demo__year_of_death",
        "demo__days_to_death",
        "demo__state",
        "demo__created_datetime",
        "demo__updated_datetime",
        "diag__diagnosis_id",
        "diag__ajcc_clinical_n",
        "diag__masaoka_stage",
        "diag__ajcc_clinical_m",
        "diag__primary_diagnosis",
        "diag__primary_gleason_grade",
        "diag__year_of_diagnosis",
        "diag__figo_stage",
        "diag__progression_or_recurrence",
        "diag__ajcc_pathologic_m",
        "diag__site_of_resection_or_biopsy",
        "diag__ajcc_staging_system_edition",
        "diag__icd_10_code",
        "diag__age_at_diagnosis",
        "diag__ajcc_clinical_t",
        "diag__days_to_last_follow_up",
        "diag__ajcc_pathologic_stage",
        "diag__tumor_grade",
        "diag__last_known_disease_status",
        "diag__ann_arbor_extranodal_involvement",
        "diag__ajcc_clinical_stage",
        "diag__secondary_gleason_grade",
        "diag__synchronous_malignancy",
        "diag__morphology",
        "diag__ajcc_pathologic_t",
        "diag__igcccg_stage",
        "diag__classification_of_tumor",
        "diag__ann_arbor_clinical_stage",
        "diag__ann_arbor_b_symptoms",
        "diag__tumor_stage",
        "diag__prior_treatment",
        "diag__ajcc_pathologic_n",
        "diag__tissue_or_organ_of_origin",
        "diag__prior_malignancy",
        "diag__state",
        "diag__created_datetime",
        "diag__updated_datetime",
        "exp__exposure_id",
        "exp__height",
        "exp__weight",
        "exp__bmi",
        "exp__years_smoked",
        "exp__pack_years_smoked",
        "exp__cigarettes_per_day",
        "exp__alcohol_history",
        "exp__state",
        "exp__created_datetime",
        "exp__updated_datetime",
        "state",
        "updated_datetime"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "STRING",
        "TIMESTAMP",
        "TIMESTAMP",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "FLOAT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "TIMESTAMP",
        "TIMESTAMP",
        "STRING",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "STRING",
        "TIMESTAMP",
        "TIMESTAMP",
        "STRING",
        "TIMESTAMP"
    ],
    "description": [
        "The submitter_id of a case entity corresponds to the submitted_subject_id of the study participant in dbGaP records for the project.",
        "GDC unique identifier for this case (corresponds to the case_barcode) -- this can be used to access more information from the GDC data portal in the following way: https://portal.gdc.cancer.gov/files/c21b332c-06c6-4403-9032-f91c8f407ba9.",
        "Total record count in cases.diagnoses.treatments mapping table.",
        "The text term used to describe the primary site of disease, as categorized by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O). This categorization groups cases into general categories. Reference tissue_or_organ_of_origin on the diagnosis node for more specific primary sites of disease.",
        "The text term used to describe the type of malignant disease, as categorized by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O).",
        "Display name for the project to which a case belongs.",
        "GDC-assigned identifier for the project to which a case belongs.",
        "GDC-assigned identifier for a case's demographic data.",
        "Text designations that identify gender. Gender is described as the assemblage of properties that distinguish people on the basis of their societal roles. [Explanatory Comment 1: Identification of gender is based upon self-report and may come from a form, questionnaire, interview, etc.]",
        "An arbitrary classification of a taxonomic group that is a division of a species. It usually arises as a consequence of geographical isolation within a species and is characterized by shared heredity, physical attributes and behavior, and in the case of humans, by common history, nationality, or geographic distribution. The provided values are based on the categories defined by the U.S. Office of Management and Business and used by the U.S. Census Bureau.",
        "An individual's self-described social and cultural grouping, specifically whether an individual describes themselves as Hispanic or Latino. The provided values are based on the categories defined by the U.S. Office of Management and Business and used by the U.S. Census Bureau.",
        "The survival state of the person registered on the protocol.",
        "Number of days between the date used for index and the date from a person's date of birth represented as a calculated negative number of days.",
        "Numeric value to represent the calendar year in which an individual was born.",
        "The patient's age (in years) on the reference or anchor date date used during date obfuscation.",
        "Numeric value to represent the year of the death of an individual.",
        "Number of days between the date used for index and the date from a person's date of death represented as a calculated number of days.",
        "The current state of the object.",
        "A combination of date and time of day in the form [-]CCYY-MM-DDThh:mm:ss[Z|(+|-)hh:mm]",
        "A combination of date and time of day in the form [-]CCYY-MM-DDThh:mm:ss[Z|(+|-)hh:mm]",
        "GDC-assigned identifier for a case's diagnosis.",
        "Extent of the regional lymph node involvement for the cancer based on evidence obtained from clinical assessment parameters determined prior to treatment.",
        "The text term used to describe the Masaoka staging system, a classification that defines prognostic indicators for thymic malignancies and predicts tumor recurrence.",
        "Extent of the distant metastasis for the cancer based on evidence obtained from clinical assessment parameters determined prior to treatment.",
        "Text term used to describe the patient's histologic diagnosis, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O).",
        "The text term used to describe the primary Gleason score, which describes the pattern of cells making up the largest area of the tumor. The primary and secondary Gleason pattern grades are combined to determine the patient's Gleason grade group, which is used to determine the aggresiveness of prostate cancer. Note that this grade describes the entire prostatectomy specimen and is not specific to the sample used for sequencing.",
        "Numeric value to represent the year of an individual's initial pathologic diagnosis of cancer.",
        "The extent of a cervical or endometrial cancer within the body, especially whether the disease has spread from the original site to other parts of the body, as described by the International Federation of Gynecology and Obstetrics (FIGO) stages.",
        "Yes/No/Unknown indicator to identify whether a patient has had a new tumor event after initial treatment.",
        "Code to represent the defined absence or presence of distant spread or metastases (M) to locations via vascular channels or lymphatics beyond the regional lymph nodes, using criteria established by the American Joint Committee on Cancer (AJCC).",
        "The text term used to describe the anatomic site of origin, of the patient's malignant disease, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O).",
        "The text term used to describe the version or edition of the American Joint Committee on Cancer Staging Handbooks, a publication by the group formed for the purpose of developing a system of staging for cancer that is acceptable to the American medical profession and is compatible with other accepted classifications.",
        "Alphanumeric value used to describe the disease code from the tenth version of the International Classification of Disease (ICD-10).",
        "Age at the time of diagnosis expressed in number of days since birth.",
        "Extent of the primary cancer based on evidence obtained from clinical assessment parameters determined prior to treatment.",
        "Time interval from the date of last follow up to the date of initial pathologic diagnosis, represented as a calculated number of days.",
        "The extent of a cancer, especially whether the disease has spread from the original site to other parts of the body based on AJCC staging criteria.",
        "Numeric value to express the degree of abnormality of cancer cells, a measure of differentiation and aggressiveness.",
        "Text term that describes the last known state or condition of an individual's neoplasm.",
        "Indicator that identifies whether a patient with malignant lymphoma has lymphomatous involvement of an extranodal site.",
        "Stage group determined from clinical information on the tumor (T), regional node (N) and metastases (M) and by grouping cases with similar prognosis for cancer.",
        "The text term used to describe the secondary Gleason score, which describes the pattern of cells making up the second largest area of the tumor. The primary and secondary Gleason pattern grades are combined to determine the patient's Gleason grade group, which is used to determine the aggresiveness of prostate cancer. Note that this grade describes the entire prostatectomy specimen and is not specific to the sample used for sequencing.",
        "A yes/no/unknown indicator used to describe whether the patient had an additional malignant diagnosis at the same time the tumor used for sequencing was diagnosed. If both tumors were sequenced, both tumors would have synchronous malignancies.",
        "The third edition of the International Classification of Diseases for Oncology, published in 2000 used principally in tumor and cancer registries for coding the site (topography) and the histology (morphology) of neoplasms. The study of the structure of the cells and their arrangement to constitute tissues and, finally, the association among these to form organs. In pathology, the microscopic process of identifying normal and abnormal morphologic characteristics in tissues, by employing various cytochemical and immunocytochemical stains. A system of numbered categories for representation of data.",
        "Code of pathological T (primary tumor) to define the size or contiguous extension of the primary tumor (T), using staging criteria from the American Joint Committee on Cancer (AJCC).",
        "The text term used to describe the International Germ Cell Cancer Collaborative Group (IGCCCG), a grouping used to further classify metastatic testicular tumors.",
        "Text that describes the kind of disease present in the tumor specimen as related to a specific timepoint.",
        "The text term used to describe the clinical classification of lymphoma, as defined by the Ann Arbor Lymphoma Staging System.",
        "Text term to signify whether lymphoma B-symptoms are present as noted in the patient's medical record.",
        "The extent of a cancer in the body. Staging is usually based on the size of the tumor, whether lymph nodes contain cancer, and whether the cancer has spread from the original site to other parts of the body. The accepted values for tumor_stage depend on the tumor site, type, and accepted staging system. These items should accompany the tumor_stage value as associated metadata.",
        "A yes/no/unknown/not applicable indicator related to the administration of therapeutic agents received before the body specimen was collected.",
        "The codes that represent the stage of cancer based on the nodes present (N stage) according to criteria based on multiple editions of the AJCC's Cancer Staging Manual.",
        "The text term used to describe the anatomic site of origin, of the patient's malignant disease, as described by the World Health Organization's (WHO) International Classification of Diseases for Oncology (ICD-O).",
        "The yes/no/unknown indicator used to describe the patient's history of prior cancer diagnosis.",
        "The current state of the object.",
        "A combination of date and time of day in the form [-]CCYY-MM-DDThh:mm:ss[Z|(+|-)hh:mm]",
        "A combination of date and time of day in the form [-]CCYY-MM-DDThh:mm:ss[Z|(+|-)hh:mm]",
        "GDC-assigned identifier for a case's exposure data.",
        "The height of the patient in centimeters.",
        "The weight of the patient measured in kilograms.",
        "A calculated numerical quantity that represents an individual's weight to height ratio.",
        "Numeric value (or unknown) to represent the number of years a person has been smoking.",
        "Numeric computed value to represent lifetime tobacco exposure defined as number of cigarettes smoked per day x number of years smoked divided by 20.",
        "The average number of cigarettes smoked per day.",
        "A response to a question that asks whether the participant has consumed at least 12 drinks of any kind of alcoholic beverage in their lifetime.",
        "The current state of the object.",
        "A combination of date and time of day in the form [-]CCYY-MM-DDThh:mm:ss[Z|(+|-)hh:mm]",
        "A combination of date and time of day in the form [-]CCYY-MM-DDThh:mm:ss[Z|(+|-)hh:mm]",
        "The current state of the object.",
        "Timestamp of last update in GDC; formatted as a combination of date and time of day in the form [-]CCYY-MM-DDThh:mm:ss[Z|(+|-)hh:mm]."
    ],
    "sample_rows": [
        {
            "submitter_id": "TCGA-CN-5363",
            "case_id": "291b069c-9dde-4e1e-8430-85146bc94338",
            "diag__treat__count": 2,
            "primary_site": "Larynx",
            "disease_type": "Squamous Cell Neoplasms",
            "proj__name": "Head and Neck Squamous Cell Carcinoma",
            "proj__project_id": "TCGA-HNSC",
            "demo__demographic_id": "2611cb61-6d05-5286-b94a-ce6cac2ba37b",
            "demo__gender": "male",
            "demo__race": "black or african american",
            "demo__ethnicity": "not hispanic or latino",
            "demo__vital_status": "Dead",
            "demo__days_to_birth": -17635,
            "demo__year_of_birth": 1959,
            "demo__age_at_index": 48,
            "demo__year_of_death": 2007,
            "demo__days_to_death": 253,
            "demo__state": "released",
            "demo__created_datetime": "NaT",
            "demo__updated_datetime": "2019-07-31 23:43:25.167078+00:00",
            "diag__diagnosis_id": "4176108f-948d-5715-afbb-cc21f3cbfaf5",
            "diag__ajcc_clinical_n": "N3",
            "diag__masaoka_stage": null,
            "diag__ajcc_clinical_m": "M0",
            "diag__primary_diagnosis": "Squamous cell carcinoma, NOS",
            "diag__primary_gleason_grade": null,
            "diag__year_of_diagnosis": 2007,
            "diag__figo_stage": null,
            "diag__progression_or_recurrence": "not reported",
            "diag__ajcc_pathologic_m": "M0",
            "diag__site_of_resection_or_biopsy": "Larynx, NOS",
            "diag__ajcc_staging_system_edition": "6th",
            "diag__icd_10_code": "C32.9",
            "diag__age_at_diagnosis": 17635,
            "diag__ajcc_clinical_t": "T4a",
            "diag__days_to_last_follow_up": NaN,
            "diag__ajcc_pathologic_stage": "Stage IVB",
            "diag__tumor_grade": "not reported",
            "diag__last_known_disease_status": "not reported",
            "diag__ann_arbor_extranodal_involvement": null,
            "diag__ajcc_clinical_stage": "Stage IVB",
            "diag__secondary_gleason_grade": null,
            "diag__synchronous_malignancy": "No",
            "diag__morphology": "8070/3",
            "diag__ajcc_pathologic_t": "T4a",
            "diag__igcccg_stage": null,
            "diag__classification_of_tumor": "not reported",
            "diag__ann_arbor_clinical_stage": null,
            "diag__ann_arbor_b_symptoms": null,
            "diag__tumor_stage": "stage ivb",
            "diag__prior_treatment": "No",
            "diag__ajcc_pathologic_n": "N3",
            "diag__tissue_or_organ_of_origin": "Larynx, NOS",
            "diag__prior_malignancy": "no",
            "diag__state": "released",
            "diag__created_datetime": "NaT",
            "diag__updated_datetime": "2019-08-08 21:44:42.154844+00:00",
            "exp__exposure_id": "beef5b0a-0621-5abd-97bc-d0ef1261a94d",
            "exp__height": NaN,
            "exp__weight": NaN,
            "exp__bmi": NaN,
            "exp__years_smoked": NaN,
            "exp__pack_years_smoked": 15.0,
            "exp__cigarettes_per_day": 0.821917808219178,
            "exp__alcohol_history": "Yes",
            "exp__state": "released",
            "exp__created_datetime": "NaT",
            "exp__updated_datetime": "2019-07-31 23:43:25.167078+00:00",
            "state": "released",
            "updated_datetime": "2019-08-06 19:25:25.511101+00:00"
        },
        {
            "submitter_id": "TCGA-CN-5365",
            "case_id": "4cffea0b-90a7-4c86-a73f-bb8feca3ada7",
            "diag__treat__count": 2,
            "primary_site": "Tonsil",
            "disease_type": "Squamous Cell Neoplasms",
            "proj__name": "Head and Neck Squamous Cell Carcinoma",
            "proj__project_id": "TCGA-HNSC",
            "demo__demographic_id": "97a7f69b-0f40-5450-bbeb-92084a100a9d",
            "demo__gender": "male",
            "demo__race": "white",
            "demo__ethnicity": "not hispanic or latino",
            "demo__vital_status": "Dead",
            "demo__days_to_birth": -14190,
            "demo__year_of_birth": 1968,
            "demo__age_at_index": 38,
            "demo__year_of_death": 2006,
            "demo__days_to_death": 351,
            "demo__state": "released",
            "demo__created_datetime": "NaT",
            "demo__updated_datetime": "2019-08-01 00:39:51.442671+00:00",
            "diag__diagnosis_id": "1da5c51a-ee25-51a6-a4c2-27d8fdcbe24e",
            "diag__ajcc_clinical_n": "N2",
            "diag__masaoka_stage": null,
            "diag__ajcc_clinical_m": "M1",
            "diag__primary_diagnosis": "Squamous cell carcinoma, NOS",
            "diag__primary_gleason_grade": null,
            "diag__year_of_diagnosis": 2006,
            "diag__figo_stage": null,
            "diag__progression_or_recurrence": "not reported",
            "diag__ajcc_pathologic_m": null,
            "diag__site_of_resection_or_biopsy": "Tonsil, NOS",
            "diag__ajcc_staging_system_edition": "6th",
            "diag__icd_10_code": "C09.9",
            "diag__age_at_diagnosis": 14190,
            "diag__ajcc_clinical_t": "T1",
            "diag__days_to_last_follow_up": NaN,
            "diag__ajcc_pathologic_stage": "Stage IVB",
            "diag__tumor_grade": "not reported",
            "diag__last_known_disease_status": "not reported",
            "diag__ann_arbor_extranodal_involvement": null,
            "diag__ajcc_clinical_stage": "Stage IVC",
            "diag__secondary_gleason_grade": null,
            "diag__synchronous_malignancy": "No",
            "diag__morphology": "8070/3",
            "diag__ajcc_pathologic_t": "T2",
            "diag__igcccg_stage": null,
            "diag__classification_of_tumor": "not reported",
            "diag__ann_arbor_clinical_stage": null,
            "diag__ann_arbor_b_symptoms": null,
            "diag__tumor_stage": "stage ivb",
            "diag__prior_treatment": "No",
            "diag__ajcc_pathologic_n": "N3",
            "diag__tissue_or_organ_of_origin": "Tonsil, NOS",
            "diag__prior_malignancy": "no",
            "diag__state": "released",
            "diag__created_datetime": "NaT",
            "diag__updated_datetime": "2019-08-08 21:44:42.154844+00:00",
            "exp__exposure_id": "9267577a-0a08-5454-8aeb-ee2e5ffcd83f",
            "exp__height": NaN,
            "exp__weight": NaN,
            "exp__bmi": NaN,
            "exp__years_smoked": NaN,
            "exp__pack_years_smoked": 26.0,
            "exp__cigarettes_per_day": 1.4246575342465753,
            "exp__alcohol_history": "Yes",
            "exp__state": "released",
            "exp__created_datetime": "NaT",
            "exp__updated_datetime": "2019-08-01 00:39:51.442671+00:00",
            "state": "released",
            "updated_datetime": "2019-08-06 19:25:25.511101+00:00"
        },
        {
            "submitter_id": "TCGA-CN-A642",
            "case_id": "a1ded1e8-eb28-49dd-8f3d-1ce8f40eed8f",
            "diag__treat__count": 2,
            "primary_site": "Other and unspecified parts of tongue",
            "disease_type": "Squamous Cell Neoplasms",
            "proj__name": "Head and Neck Squamous Cell Carcinoma",
            "proj__project_id": "TCGA-HNSC",
            "demo__demographic_id": "4bc58619-47fc-5c2d-aaec-9d9e562e049b",
            "demo__gender": "male",
            "demo__race": "white",
            "demo__ethnicity": "not hispanic or latino",
            "demo__vital_status": "Dead",
            "demo__days_to_birth": -21011,
            "demo__year_of_birth": 1955,
            "demo__age_at_index": 57,
            "demo__year_of_death": 2012,
            "demo__days_to_death": 82,
            "demo__state": "released",
            "demo__created_datetime": "NaT",
            "demo__updated_datetime": "2019-08-01 00:30:27.901248+00:00",
            "diag__diagnosis_id": "46d9f030-7ae3-534f-8d0c-4bab2201ccb1",
            "diag__ajcc_clinical_n": "N2c",
            "diag__masaoka_stage": null,
            "diag__ajcc_clinical_m": "M0",
            "diag__primary_diagnosis": "Squamous cell carcinoma, NOS",
            "diag__primary_gleason_grade": null,
            "diag__year_of_diagnosis": 2012,
            "diag__figo_stage": null,
            "diag__progression_or_recurrence": "not reported",
            "diag__ajcc_pathologic_m": "M0",
            "diag__site_of_resection_or_biopsy": "Tongue, NOS",
            "diag__ajcc_staging_system_edition": "7th",
            "diag__icd_10_code": "C02.9",
            "diag__age_at_diagnosis": 21011,
            "diag__ajcc_clinical_t": "T3",
            "diag__days_to_last_follow_up": NaN,
            "diag__ajcc_pathologic_stage": "Stage IVB",
            "diag__tumor_grade": "not reported",
            "diag__last_known_disease_status": "not reported",
            "diag__ann_arbor_extranodal_involvement": null,
            "diag__ajcc_clinical_stage": "Stage IVA",
            "diag__secondary_gleason_grade": null,
            "diag__synchronous_malignancy": "No",
            "diag__morphology": "8070/3",
            "diag__ajcc_pathologic_t": "T4a",
            "diag__igcccg_stage": null,
            "diag__classification_of_tumor": "not reported",
            "diag__ann_arbor_clinical_stage": null,
            "diag__ann_arbor_b_symptoms": null,
            "diag__tumor_stage": "stage ivb",
            "diag__prior_treatment": "No",
            "diag__ajcc_pathologic_n": "N3",
            "diag__tissue_or_organ_of_origin": "Tongue, NOS",
            "diag__prior_malignancy": "no",
            "diag__state": "released",
            "diag__created_datetime": "NaT",
            "diag__updated_datetime": "2019-08-08 21:45:06.897037+00:00",
            "exp__exposure_id": "3a1f7e4d-ebf0-5fd6-b63e-d89f635a91e7",
            "exp__height": NaN,
            "exp__weight": NaN,
            "exp__bmi": NaN,
            "exp__years_smoked": NaN,
            "exp__pack_years_smoked": 5.0,
            "exp__cigarettes_per_day": 0.273972602739726,
            "exp__alcohol_history": "Yes",
            "exp__state": "released",
            "exp__created_datetime": "NaT",
            "exp__updated_datetime": "2019-08-01 00:30:27.901248+00:00",
            "state": "released",
            "updated_datetime": "2019-08-06 19:25:39.854271+00:00"
        },
        {
            "submitter_id": "TCGA-CR-7380",
            "case_id": "53b254b7-021f-43df-af9b-3fc01b87479e",
            "diag__treat__count": 2,
            "primary_site": "Other and ill-defined sites in lip, oral cavity and pharynx",
            "disease_type": "Squamous Cell Neoplasms",
            "proj__name": "Head and Neck Squamous Cell Carcinoma",
            "proj__project_id": "TCGA-HNSC",
            "demo__demographic_id": "be41a712-ebee-52e1-907c-80b1917daa45",
            "demo__gender": "male",
            "demo__race": "white",
            "demo__ethnicity": "not hispanic or latino",
            "demo__vital_status": "Dead",
            "demo__days_to_birth": -21215,
            "demo__year_of_birth": 1952,
            "demo__age_at_index": 58,
            "demo__year_of_death": 2011,
            "demo__days_to_death": 606,
            "demo__state": "released",
            "demo__created_datetime": "NaT",
            "demo__updated_datetime": "2019-08-01 00:40:20.032260+00:00",
            "diag__diagnosis_id": "e0cbd841-5cf8-5009-b588-c39c25cbbf0a",
            "diag__ajcc_clinical_n": "N0",
            "diag__masaoka_stage": null,
            "diag__ajcc_clinical_m": "M0",
            "diag__primary_diagnosis": "Squamous cell carcinoma, NOS",
            "diag__primary_gleason_grade": null,
            "diag__year_of_diagnosis": 2010,
            "diag__figo_stage": null,
            "diag__progression_or_recurrence": "not reported",
            "diag__ajcc_pathologic_m": null,
            "diag__site_of_resection_or_biopsy": "Overlapping lesion of lip, oral cavity and pharynx",
            "diag__ajcc_staging_system_edition": "7th",
            "diag__icd_10_code": "C14.8",
            "diag__age_at_diagnosis": 21215,
            "diag__ajcc_clinical_t": "T3",
            "diag__days_to_last_follow_up": NaN,
            "diag__ajcc_pathologic_stage": "Stage IVB",
            "diag__tumor_grade": "not reported",
            "diag__last_known_disease_status": "not reported",
            "diag__ann_arbor_extranodal_involvement": null,
            "diag__ajcc_clinical_stage": "Stage III",
            "diag__secondary_gleason_grade": null,
            "diag__synchronous_malignancy": "No",
            "diag__morphology": "8070/3",
            "diag__ajcc_pathologic_t": "T4b",
            "diag__igcccg_stage": null,
            "diag__classification_of_tumor": "not reported",
            "diag__ann_arbor_clinical_stage": null,
            "diag__ann_arbor_b_symptoms": null,
            "diag__tumor_stage": "stage ivb",
            "diag__prior_treatment": "No",
            "diag__ajcc_pathologic_n": "N0",
            "diag__tissue_or_organ_of_origin": "Overlapping lesion of lip, oral cavity and pharynx",
            "diag__prior_malignancy": "no",
            "diag__state": "released",
            "diag__created_datetime": "NaT",
            "diag__updated_datetime": "2019-08-08 21:46:02.761960+00:00",
            "exp__exposure_id": "c7d16a54-3c63-580e-8e18-817e1d4b496d",
            "exp__height": NaN,
            "exp__weight": NaN,
            "exp__bmi": NaN,
            "exp__years_smoked": NaN,
            "exp__pack_years_smoked": NaN,
            "exp__cigarettes_per_day": NaN,
            "exp__alcohol_history": "Yes",
            "exp__state": "released",
            "exp__created_datetime": "NaT",
            "exp__updated_datetime": "2019-08-01 00:40:20.032260+00:00",
            "state": "released",
            "updated_datetime": "2019-08-06 19:26:05.315718+00:00"
        },
        {
            "submitter_id": "TCGA-CV-5978",
            "case_id": "e16e9535-b20f-4c9a-8b5b-82df80c99448",
            "diag__treat__count": 2,
            "primary_site": "Larynx",
            "disease_type": "Squamous Cell Neoplasms",
            "proj__name": "Head and Neck Squamous Cell Carcinoma",
            "proj__project_id": "TCGA-HNSC",
            "demo__demographic_id": "92d1d967-c8a0-52cb-a62d-1d11bdf85068",
            "demo__gender": "female",
            "demo__race": "black or african american",
            "demo__ethnicity": "not hispanic or latino",
            "demo__vital_status": "Dead",
            "demo__days_to_birth": -19480,
            "demo__year_of_birth": 1955,
            "demo__age_at_index": 53,
            "demo__year_of_death": 2008,
            "demo__days_to_death": 215,
            "demo__state": "released",
            "demo__created_datetime": "NaT",
            "demo__updated_datetime": "2019-08-01 00:52:06.976359+00:00",
            "diag__diagnosis_id": "3ef5f7db-6234-5c11-96d5-fdb6cf8ad63e",
            "diag__ajcc_clinical_n": "N3",
            "diag__masaoka_stage": null,
            "diag__ajcc_clinical_m": "M0",
            "diag__primary_diagnosis": "Squamous cell carcinoma, NOS",
            "diag__primary_gleason_grade": null,
            "diag__year_of_diagnosis": 2008,
            "diag__figo_stage": null,
            "diag__progression_or_recurrence": "not reported",
            "diag__ajcc_pathologic_m": null,
            "diag__site_of_resection_or_biopsy": "Larynx, NOS",
            "diag__ajcc_staging_system_edition": "7th",
            "diag__icd_10_code": "C32.9",
            "diag__age_at_diagnosis": 19480,
            "diag__ajcc_clinical_t": "T4a",
            "diag__days_to_last_follow_up": 215.0,
            "diag__ajcc_pathologic_stage": "Stage IVB",
            "diag__tumor_grade": "not reported",
            "diag__last_known_disease_status": "not reported",
            "diag__ann_arbor_extranodal_involvement": null,
            "diag__ajcc_clinical_stage": "Stage IVB",
            "diag__secondary_gleason_grade": null,
            "diag__synchronous_malignancy": "No",
            "diag__morphology": "8070/3",
            "diag__ajcc_pathologic_t": "T4a",
            "diag__igcccg_stage": null,
            "diag__classification_of_tumor": "not reported",
            "diag__ann_arbor_clinical_stage": null,
            "diag__ann_arbor_b_symptoms": null,
            "diag__tumor_stage": "stage ivb",
            "diag__prior_treatment": "No",
            "diag__ajcc_pathologic_n": "N3",
            "diag__tissue_or_organ_of_origin": "Larynx, NOS",
            "diag__prior_malignancy": "no",
            "diag__state": "released",
            "diag__created_datetime": "NaT",
            "diag__updated_datetime": "2019-08-08 21:46:02.761960+00:00",
            "exp__exposure_id": "8fc9aaae-38f1-56cd-9ae1-a977d9375413",
            "exp__height": NaN,
            "exp__weight": NaN,
            "exp__bmi": NaN,
            "exp__years_smoked": NaN,
            "exp__pack_years_smoked": NaN,
            "exp__cigarettes_per_day": NaN,
            "exp__alcohol_history": "Yes",
            "exp__state": "released",
            "exp__created_datetime": "NaT",
            "exp__updated_datetime": "2019-08-01 00:52:06.976359+00:00",
            "state": "released",
            "updated_datetime": "2019-08-06 19:26:05.315718+00:00"
        }
    ]
}