{
    "table_name": "WORLD_BANK_INTL_EDUCATION.COUNTRY_SUMMARY",
    "table_fullname": "WORLD_BANK.WORLD_BANK_INTL_EDUCATION.COUNTRY_SUMMARY",
    "column_names": [
        "other_groups",
        "national_accounts_reference_year",
        "latest_population_census",
        "system_of_national_accounts",
        "national_accounts_base_year",
        "income_group",
        "latest_agricultural_census",
        "external_debt_reporting_status",
        "region",
        "short_name",
        "system_of_trade",
        "vital_registration_complete",
        "latest_industrial_data",
        "wb_two_code",
        "latest_water_withdrawal_data",
        "government_accounting_concept",
        "latest_household_survey",
        "source_of_most_recent_income_and_expenditure_data",
        "two_alpha_code",
        "ppp_survey_year",
        "latest_trade_data",
        "alternative_conversion_factor",
        "balance_of_payments_manual_in_use",
        "lending_category",
        "currency_unit",
        "table_name",
        "long_name",
        "special_notes",
        "country_code",
        "imf_data_dissemination_standard",
        "sna_price_valuation"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "Other types of grouping approved by the WDI team.",
        "Reference year is the year in which the local currency constant price series of a country is valued. The reference year is usually the same as the base year used to report the constant price series. However when the constant price data are chain linked the base year is changed annually so the data are rescaled to a specific reference year to provide a consistent time series. When the country has not rescaled following a change in base year World Bank staff rescale the data to maintain a longer historical series. To allow for cross-country comparison and data aggregation constant price data reported in World Development Indicators are rescaled to a common reference year (2010) and currency (U.S. dollars).",
        "Latest population census shows the most recent year in which a census was conducted and in which at least preliminary results have been released. The preliminary results from the very recent censuses could be reflected in timely revisions if basic data are available such as population by age and sex as well as the detailed definition of counting coverage and completeness.",
        "System of National Accounts identifies whether a country uses the 1968 1993 or 2008 System of National Accounts (SNA). The 2008 SNA is an update of the 1993 SNA and retains its basic theoretical framework.",
        "Base year is the base or pricing period used for constant price calculations in the country’s national accounts. Price indexes derived from national accounts aggregates such as the implicit deflator for gross domestic product (GDP) express the price level relative to base year prices.",
        "World Bank income group to which a country belongs after the country classification is completed every year.",
        "Latest agricultural census shows the most recent year in which an agricultural census was conducted or planned to be conducted as reported to the Food and Agriculture Organization.",
        "External debt shows debt reporting status for 2016 data. A indicates that data are as reported P that data are based on reported or collected information but include an element of staff estimation and E that data are World Bank staff estimates.",
        "World Bank region to which a country belongs.",
        "Country name the country's official name as approved by the relevant body (Italy is used as an example): conventional short form (Italy).",
        "System of trade refers to the United Nations general trade system (G) or special trade system (S). Under the general trade system goods entering directly for domestic consumption and goods entered into customs storage are recorded as imports at arrival. Under the special trade system goods are recorded as imports when declared for domestic consumption whether at time of entry or on withdrawal from customs storage.",
        "Vital registration complete identifies countries that report at least 90 percent complete registries of vital (birth and death) statistics to the United Nations Statistics Division and are reported in its Population and Vital Statistics Reports. Countries with complete vital statistics registries may have more accurate and more timely demographic indicators than other countries.",
        "Latest industrial data show the most recent year for which manufacturing value added data at the three-digit level of the International Standard Industrial Classification (revision 2 or 3) are available in the United Nations Industrial Development Organization database.",
        "",
        "",
        "Government finance accounting concept is the accounting basis for reporting central government financial data. For most countries government finance data have been consolidated (C) into one set of accounts capturing all central government fiscal activities. Budgetary central government accounts (B) exclude some central government units.",
        "Latest demographic education or health household survey indicates the household surveys used to compile the demographic education and health data. Detailed information on each survey is provided through the following links:  AIDS Indicator Survey Demographic and Health Survey Health Issues Survey and Malaria Indicator Survey - www.dhsprogram.com; Living Standards Measurement Study -  www.worldbank.org/lsms; Multiple Indicator Cluster Survey - http://mics.unicef.org; Reproductive Health Survey -  www.cdc.gov/reproductivehealth; World Health Survey is available at - www.who.int/healthinfo/survey/en.",
        "Source of most recent income and expenditure data shows household surveys that collect income and expenditure data. Names and detailed information on household surveys can be found on the website of the International Household Survey Network (www.surveynetwork.org). Core Welfare Indicator Questionnaire Surveys (CWIQ) developed by the World Bank measure changes in key social indicators for different population groups—specifically indicators of access utilization and satisfaction with core social and economic services. Expenditure survey/budget surveys (ES/BS) collect detailed information on household consumption as well as on general demographic social and economic characteristics. Integrated household surveys (IHS) collect detailed information on a wide variety of topics including health education economic activities housing and utilities.",
        "ISO-2 digit alpha code value of the country. Re: www.iso.org",
        "Purchasing power parity (PPP) survey year is the latest available survey year for the International Comparison Program’s estimates of PPPs.",
        "Latest trade data show the most recent year for which structure of merchandise trade data from the United Nations Statistics Division’s Commodity Trade (Comtrade) database are available.",
        "Alternative conversion factor identifies the countries and years for which a World Bank–estimated conversion factor has been used in place of the official exchange rate (line rf in the International Monetary Fund’s [IMF] International Financial Statistics). See later in Sources and methods for further discussion of alternative conversion factors.",
        "Balance of Payments Manual in use refers to the classification system used to compile and report data on balance of payments. 6 refers to the 6th edition of the IMF’s Balance of Payments Manual (2009).",
        "World Bank lending category to which a country belongs after the operational guidelines are completed every year.",
        "Currency unit (such as the dollar euro peso rupee) issued as a coin or banknote a standard unit of value and a unit of account.",
        "Country name the country's name as approved by the relevant body (Italy is used as an example): conventional short form (Republic of Italy).",
        "Country name the country's name as approved by the relevant body (Italy is used as an example): conventional long form (Republic of Italy).",
        "Country special notes for data and metadata users.",
        "A short alphabetic or numeric geographical code representing a specific country or area. In April 2016 WDI has adopted the three digit ISO code to identify countries in its databases.",
        "IMF data dissemination standard shows the countries that subscribe to the IMF’s Special Data Dissemination Standard (S) or Enhanced General Data Dissemination System (e-GDDS). S refers to countries that subscribe to the SDDS and have posted data on the Dissemination Standards Bulletin Board at http://dsbb.imf.org. S+ countries must observe additional coverage periodicity and timeliness requirements. e-G refers to countries that subscribe to the e-GDDS.",
        "SNA price valuation shows whether value added in the national accounts is reported at basic prices (B) or producer prices (P). Producer prices include taxes paid by producers and thus tend to overstate the actual value added in production. However value added can be higher at basic prices than at producer prices in countries with high agricultural subsidies."
    ],
    "sample_rows": [
        {
            "country_code": "ARB",
            "short_name": "Arab World",
            "table_name": "Arab World",
            "long_name": "Arab World",
            "two_alpha_code": "1A",
            "currency_unit": null,
            "special_notes": "Arab World aggregate. Arab World is composed of members of the League of Arab States.",
            "region": null,
            "income_group": null,
            "wb_two_code": "1A",
            "national_accounts_base_year": null,
            "national_accounts_reference_year": null,
            "sna_price_valuation": null,
            "lending_category": null,
            "other_groups": null,
            "system_of_national_accounts": null,
            "alternative_conversion_factor": null,
            "ppp_survey_year": null,
            "balance_of_payments_manual_in_use": null,
            "external_debt_reporting_status": null,
            "system_of_trade": null,
            "government_accounting_concept": null,
            "imf_data_dissemination_standard": null,
            "latest_population_census": null,
            "latest_household_survey": null,
            "source_of_most_recent_income_and_expenditure_data": null,
            "vital_registration_complete": null,
            "latest_agricultural_census": null,
            "latest_industrial_data": null,
            "latest_trade_data": null,
            "latest_water_withdrawal_data": null
        },
        {
            "country_code": "EAP",
            "short_name": "East Asia & Pacific (developing only)",
            "table_name": "East Asia & Pacific",
            "long_name": "East Asia & Pacific (developing only)",
            "two_alpha_code": "4E",
            "currency_unit": null,
            "special_notes": "East Asia and Pacific regional aggregate (does not include high-income economies).",
            "region": null,
            "income_group": null,
            "wb_two_code": "4E",
            "national_accounts_base_year": null,
            "national_accounts_reference_year": null,
            "sna_price_valuation": null,
            "lending_category": null,
            "other_groups": null,
            "system_of_national_accounts": null,
            "alternative_conversion_factor": null,
            "ppp_survey_year": null,
            "balance_of_payments_manual_in_use": null,
            "external_debt_reporting_status": null,
            "system_of_trade": null,
            "government_accounting_concept": null,
            "imf_data_dissemination_standard": null,
            "latest_population_census": null,
            "latest_household_survey": null,
            "source_of_most_recent_income_and_expenditure_data": null,
            "vital_registration_complete": null,
            "latest_agricultural_census": null,
            "latest_industrial_data": null,
            "latest_trade_data": null,
            "latest_water_withdrawal_data": null
        },
        {
            "country_code": "EUU",
            "short_name": "European Union",
            "table_name": "European Union",
            "long_name": "European Union",
            "two_alpha_code": "EU",
            "currency_unit": null,
            "special_notes": "European Union aggregate.",
            "region": null,
            "income_group": null,
            "wb_two_code": "EU",
            "national_accounts_base_year": null,
            "national_accounts_reference_year": null,
            "sna_price_valuation": null,
            "lending_category": null,
            "other_groups": null,
            "system_of_national_accounts": null,
            "alternative_conversion_factor": null,
            "ppp_survey_year": null,
            "balance_of_payments_manual_in_use": null,
            "external_debt_reporting_status": null,
            "system_of_trade": null,
            "government_accounting_concept": null,
            "imf_data_dissemination_standard": null,
            "latest_population_census": null,
            "latest_household_survey": null,
            "source_of_most_recent_income_and_expenditure_data": null,
            "vital_registration_complete": null,
            "latest_agricultural_census": null,
            "latest_industrial_data": null,
            "latest_trade_data": null,
            "latest_water_withdrawal_data": null
        },
        {
            "country_code": "HPC",
            "short_name": "Heavily indebted poor countries (HIPC)",
            "table_name": "Heavily indebted poor countries (HIPC)",
            "long_name": "Heavily indebted poor countries (HIPC)",
            "two_alpha_code": "XE",
            "currency_unit": null,
            "special_notes": "Heavily indebted poor countries aggregate.",
            "region": null,
            "income_group": null,
            "wb_two_code": "XE",
            "national_accounts_base_year": null,
            "national_accounts_reference_year": null,
            "sna_price_valuation": null,
            "lending_category": null,
            "other_groups": null,
            "system_of_national_accounts": null,
            "alternative_conversion_factor": null,
            "ppp_survey_year": null,
            "balance_of_payments_manual_in_use": null,
            "external_debt_reporting_status": null,
            "system_of_trade": null,
            "government_accounting_concept": null,
            "imf_data_dissemination_standard": null,
            "latest_population_census": null,
            "latest_household_survey": null,
            "source_of_most_recent_income_and_expenditure_data": null,
            "vital_registration_complete": null,
            "latest_agricultural_census": null,
            "latest_industrial_data": null,
            "latest_trade_data": null,
            "latest_water_withdrawal_data": null
        },
        {
            "country_code": "LIC",
            "short_name": "Low income",
            "table_name": "Low income",
            "long_name": "Low income",
            "two_alpha_code": "XM",
            "currency_unit": null,
            "special_notes": "Low income group aggregate. Low-income economies are those in which 2013 GNI per capita was $1,045 or less.",
            "region": null,
            "income_group": null,
            "wb_two_code": "XM",
            "national_accounts_base_year": null,
            "national_accounts_reference_year": null,
            "sna_price_valuation": null,
            "lending_category": null,
            "other_groups": null,
            "system_of_national_accounts": null,
            "alternative_conversion_factor": null,
            "ppp_survey_year": null,
            "balance_of_payments_manual_in_use": null,
            "external_debt_reporting_status": null,
            "system_of_trade": null,
            "government_accounting_concept": null,
            "imf_data_dissemination_standard": null,
            "latest_population_census": null,
            "latest_household_survey": null,
            "source_of_most_recent_income_and_expenditure_data": null,
            "vital_registration_complete": null,
            "latest_agricultural_census": null,
            "latest_industrial_data": null,
            "latest_trade_data": null,
            "latest_water_withdrawal_data": null
        }
    ]
}