{
    "sample_rows": [
        {
            "DATATYPEID": 21,
            "SHORTNAME": "DA Reg-Down",
            "LONGNAME": "Day Ahead Regulation Down",
            "DESCRIPTION": "Day Ahead market price (hourly) in $/MWh for regulation down. Regulation Down Service (Reg-Down) is an Ancillary Service that provides capacity that can respond to signals from ERCOT within three to five seconds to respond to changes in system frequency. Such capacity is the amount available below any Base Point but above the LSL of a Generation Resource and may be called on to change output as necessary throughout the range of capacity available to maintain proper system frequency. A Load Resource providing Reg-Down must be able to increase and decrease Load as deployed within its Ancillary Service Schedule for Reg-Down below the Load Resource’s MPC limit.",
            "UNITS": "$/MWh",
            "INTERVAL": 3600,
            "SOURCE": "ERCOT",
            "ISO": "ERCOT",
            "STORAGE_TABLE": "TS_ANCILLARY",
            "INTEGRATION_RULE": "DOWN"
        },
        {
            "DATATYPEID": 22,
            "SHORTNAME": "DA Reg-Up",
            "LONGNAME": "Day Ahead Regulation Up",
            "DESCRIPTION": "Day Ahead market price (hourly) in $/MWh for regulation up. Regulation Up Service (Reg-Up) is an Ancillary Service that provides capacity that can respond to signals from ERCOT within three to five seconds to respond to changes in system frequency. Such capacity is the amount available above any Base Point but below the HSL of a Generation Resource and may be called on to change output as necessary throughout the range of capacity available to maintain proper system frequency. A Load Resource providing Reg-Up must be able to increase and decrease Load as deployed within its Ancillary Service Schedule for Reg-Up above the Load Resource’s LPC limit.",
            "UNITS": "$/MWh",
            "INTERVAL": 3600,
            "SOURCE": "ERCOT",
            "ISO": "ERCOT",
            "STORAGE_TABLE": "TS_ANCILLARY",
            "INTEGRATION_RULE": "DOWN"
        },
        {
            "DATATYPEID": 23,
            "SHORTNAME": "DA RRS",
            "LONGNAME": "Day Ahead Responsive Reserve Service",
            "DESCRIPTION": "Day Ahead market price (hourly) in $/MWh for responsive reserve service (RRS). RRS is an Ancillary Service that provides operating reserves that is intended to: Arrest frequency decay within the first few seconds of a significant frequency deviation on the ERCOT Transmission Grid using Primary Frequency Response and interruptible Load; After the first few seconds of a significant frequency deviation, help restore frequency to its scheduled value to return the system to normal; Provide energy or continued Load interruption during the implementation of the EEA; and Provide backup regulation. ",
            "UNITS": "$/MWh",
            "INTERVAL": 3600,
            "SOURCE": "ERCOT",
            "ISO": "ERCOT",
            "STORAGE_TABLE": "TS_ANCILLARY",
            "INTEGRATION_RULE": "DOWN"
        },
        {
            "DATATYPEID": 24,
            "SHORTNAME": "DA Non-Spin",
            "LONGNAME": "Day Ahead Non-Spinning Reserve",
            "DESCRIPTION": "Day Ahead market price (hourly) in $/MWh for non-spinning reserve, which is  service that is comprised of 30-Minute Non-Spinning Reserve Service (30MNSRS) and BES-Capable Non-Spinning Reserve Service (BESCNSRS). 30-Minute Non-Spinning Reserve Service (30MNSRS) is A service that is provided through utilization of the portion of Off-line generation capacity capable of being synchronized and ramped to a specified output level within thirty (30) minutes (or Load that is capable of being interrupted within thirty (30) minutes) and that is capable of running (or being interrupted) at a specified output level for at least one (1) hour. 30MNSRS is not capable of participating in the Balancing Energy Services market because it does not meet all of the qualifications of providing Balancing Energy Service Up within fifteen (15) minutes. ",
            "UNITS": "$/MWh",
            "INTERVAL": 3600,
            "SOURCE": "ERCOT",
            "ISO": "ERCOT",
            "STORAGE_TABLE": "TS_ANCILLARY",
            "INTEGRATION_RULE": "DOWN"
        },
        {
            "DATATYPEID": 138,
            "SHORTNAME": "ERCOT (LZ Only) 7DLF",
            "LONGNAME": "ERCOT (LZ Only) 7 Day Load Forecast for Weather Zones",
            "DESCRIPTION": "ERCOT (Load Zones Only) 7 Day Load Forecast for Weather Zones",
            "UNITS": "MW",
            "INTERVAL": 3600,
            "SOURCE": "ERCOT",
            "ISO": "ERCOT",
            "STORAGE_TABLE": "TS_FORECAST",
            "INTEGRATION_RULE": "DOWN"
        }
    ],
    "table_name": "DATATYPE_SAMPLE",
    "table_fullname": "YES_ENERGY__SAMPLE_DATA.YES_ENERGY_SAMPLE.DATATYPE_SAMPLE",
    "column_names": [
        "SOURCE",
        "DESCRIPTION",
        "SHORTNAME",
        "LONGNAME",
        "INTERVAL",
        "INTEGRATION_RULE",
        "DATATYPEID",
        "ISO",
        "UNITS",
        "STORAGE_TABLE"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ]
}