{
    "table_name": "NATURE",
    "table_fullname": "WORD_VECTORS_US.WORD_VECTORS_US.NATURE",
    "column_names": [
        "acquisition_date",
        "title",
        "abstract",
        "citations",
        "body",
        "pdf_link",
        "date",
        "doi",
        "category",
        "link",
        "organization_affiliated",
        "keywords",
        "id",
        "authors",
        "nature_source"
    ],
    "column_types": [
        "DATE",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "DATE",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "abstract": "Serum is a common supplement for cell culture due to it containing the essential active components for the growth and maintenance of cells. However, the knowledges of the active components in serum are incomplete. Apart from the direct influence of serum components on cultured cells, the reaction of serum components with tested drugs cannot be ignored, which usually results in the false conclusion on the activity of the tested drugs. Here we report the toxicity effect of polyamines (spermidine and spermine) on cultured cells, especially on drug-resistant cancer cell lines, which resulted from the oxidative degradation of polyamines by amine oxidases in serum supplement. Upon adding spermidine or spermine, high concentration of H2O2, an enzyme oxidation product of polyamines, was generated in culture media containing ruminant serum, such as fetal bovine serum (FBS), calf serum, bovine serum, goat serum or horse serum, but not in the media containing human serum. Drug-resistant cancer cell lines showed much higher sensitivity to the oxidation products of polyamines (H2O2 and acrolein) than their wild cell lines, which was due to their low antioxidative capacity.",
            "acquisition_date": "2020-06-06",
            "authors": "Linlin Wang; Ying Liu; Cui Qi; Luyao Shen; Junyan Wang; Xiangjun Liu; Nan Zhang; Tao Bing; Dihua Shangguan",
            "category": "Cell culture; Chemical biology",
            "citations": "7",
            "date": "2018-07-10",
            "doi": "10.1038/s41598-018-28648-8",
            "body": "Introduction\nCell culture is a widely used tool to study physiological, biological and pharmacological activities in vitro, as well as to produce biological components, such as proteins, hormones and vaccines. This method is fast, cheap, reproducible, and greatly reduces the use of experimental animals. Serum from animals or human is a common supplement for the culture of eukaryotic cells due to it containing a large number of active components, like growth factors, enzymes, hormones, etc., which are essential for the growth and maintenance of cells1,2,3. Fetal bovine serum (FBS) is the most commonly used serum in cell culture, because it is rich in fetal growth factors and hormones that stimulate cellular proliferation and maintenance. Although FBS has been used for more than 50 years, the knowledge is incomplete regarding the serum components and their influence on cultured cells4,5. Apart from the unknown influence of serum components on the cultured cells directly, the effects of enzymes in serum on the tested drugs should be paid much more attention, otherwise it may result in the false positive or negative results, consequently lead to misleading conclusions. In previous work, we have shown that the cytotoxicity activity of guanine-rich oligonucleotides is attributed to the cytotoxicity of guanine derivatives derived from degradation of oligonucleotides by nuclease in FBS, but not attributed to the direct action of oligonucleotides on cells as reported elsewhere6.\nAs ubiquitous endogenous metabolites, polyamines are essential organic compounds for cell growth and proliferation. Putrescine, spermidine and spermine, existing normally in millimolar concentration range in nucleus7, are the mainly naturally occurring polyamines in mammalian cells8. Polyamines are involved in a wide variety of cellular processes: participating in the regulation of gene expression and enzyme activity, activating DNA synthesis, facilitating the interaction of DNA and protein, as well as protecting DNA molecules from putative damaging agents7,9. Among these polyamines, spermine is reported to possess the highest biological activity10. Under physiologic ionic and pH conditions, polyamines are multivalent cations with aliphatic hydrocarbon chains separating the charges11, and hence negatively charged nucleic acids, including DNA and RNA, are their prime targets of interaction, and consequently regulate the structures of DNA, condense DNA molecules to a liquid crystalline phase12, and enhance the activity of G-quadruplex/hemin DNAzymes in vitro13. Many evidences suggest that polyamines play important roles as modulators of nucleic acid structure14.\nThe intracellular polyamines are maintained at a correct level through the subtle coordination and regulation of biosynthesis, transport, and catabolism. In mammalian cells, polyamine catabolism occurs through two distinct pathways with the help of three kinds of enzymes: spermidine/spermine N1-acetyltransferase, N1-acetylpolyamine oxidase and spermine oxidase15 (Fig. S1). Polyamine catabolism can generate cytotoxic metabolites such as hydrogen peroxide (H2O2) and aldehydes in situ, thereafter inducing apoptosis, necrosis, inhibition of cell proliferation, and inhibition of DNA and protein synthesis7,16,17. Polyamines are also the substrates of various kinds of amine oxidases, such as monoamine oxidases, diamine oxidases, polyamine oxidases and copper containing amine oxidases. These enzymes catalyze the oxidative deamination of polyamines to generate the reaction products H2O2 and aldehyde(s) that are able to induce cell death in several cultured human tumor cell lines18,19,20,21,22,23. Therefore, polyamines and amine oxidases are also considered to have potential in therapeutic applications15,17.\nHere, we describe the cytotoxicity of polyamines and their degradation products on different cell lines. The generation of H2O2 (one of the degradation product of polyamines) in culture media containing different serums was measured after addition of spermidine and spermine. The degradation products of spermidine and spermine resulted from the amine oxidases in serum were found to be the main reason of the cytotoxicity of spermidine and spermine.; Cell culture is a widely used tool to study physiological, biological and pharmacological activities in vitro, as well as to produce biological components, such as proteins, hormones and vaccines. This method is fast, cheap, reproducible, and greatly reduces the use of experimental animals. Serum from animals or human is a common supplement for the culture of eukaryotic cells due to it containing a large number of active components, like growth factors, enzymes, hormones, etc., which are essential for the growth and maintenance of cells1,2,3. Fetal bovine serum (FBS) is the most commonly used serum in cell culture, because it is rich in fetal growth factors and hormones that stimulate cellular proliferation and maintenance. Although FBS has been used for more than 50 years, the knowledge is incomplete regarding the serum components and their influence on cultured cells4,5. Apart from the unknown influence of serum components on the cultured cells directly, the effects of enzymes in serum on the tested drugs should be paid much more attention, otherwise it may result in the false positive or negative results, consequently lead to misleading conclusions. In previous work, we have shown that the cytotoxicity activity of guanine-rich oligonucleotides is attributed to the cytotoxicity of guanine derivatives derived from degradation of oligonucleotides by nuclease in FBS, but not attributed to the direct action of oligonucleotides on cells as reported elsewhere6.\nAs ubiquitous endogenous metabolites, polyamines are essential organic compounds for cell growth and proliferation. Putrescine, spermidine and spermine, existing normally in millimolar concentration range in nucleus7, are the mainly naturally occurring polyamines in mammalian cells8. Polyamines are involved in a wide variety of cellular processes: participating in the regulation of gene expression and enzyme activity, activating DNA synthesis, facilitating the interaction of DNA and protein, as well as protecting DNA molecules from putative damaging agents7,9. Among these polyamines, spermine is reported to possess the highest biological activity10. Under physiologic ionic and pH conditions, polyamines are multivalent cations with aliphatic hydrocarbon chains separating the charges11, and hence negatively charged nucleic acids, including DNA and RNA, are their prime targets of interaction, and consequently regulate the structures of DNA, condense DNA molecules to a liquid crystalline phase12, and enhance the activity of G-quadruplex/hemin DNAzymes in vitro13. Many evidences suggest that polyamines play important roles as modulators of nucleic acid structure14.\nThe intracellular polyamines are maintained at a correct level through the subtle coordination and regulation of biosynthesis, transport, and catabolism. In mammalian cells, polyamine catabolism occurs through two distinct pathways with the help of three kinds of enzymes: spermidine/spermine N1-acetyltransferase, N1-acetylpolyamine oxidase and spermine oxidase15 (Fig. S1). Polyamine catabolism can generate cytotoxic metabolites such as hydrogen peroxide (H2O2) and aldehydes in situ, thereafter inducing apoptosis, necrosis, inhibition of cell proliferation, and inhibition of DNA and protein synthesis7,16,17. Polyamines are also the substrates of various kinds of amine oxidases, such as monoamine oxidases, diamine oxidases, polyamine oxidases and copper containing amine oxidases. These enzymes catalyze the oxidative deamination of polyamines to generate the reaction products H2O2 and aldehyde(s) that are able to induce cell death in several cultured human tumor cell lines18,19,20,21,22,23. Therefore, polyamines and amine oxidases are also considered to have potential in therapeutic applications15,17.\nHere, we describe the cytotoxicity of polyamines and their degradation products on different cell lines. The generation of H2O2 (one of the degradation product of polyamines) in culture media containing different serums was measured after addition of spermidine and spermine. The degradation products of spermidine and spermine resulted from the amine oxidases in serum were found to be the main reason of the cytotoxicity of spermidine and spermine.; Results and Discussion\nThe toxicity effect of polyamines on cultured cells\nPolyamines (including spermine analogues) have been reported to have cytotoxicity effect on different cells24,25,26,27. Different mechanisms of action have been reported, such as inducing gene overexpression28, telomerase inhibiting29,30 and cytotoxicity of the metabolites generated by amine oxidases in cells31,32. In order to understand the real mechanism, we tested the cytotoxicity activity of four polyamines (putrescine, spermidine, spermine and triethylenetetramine (TETA)) on eight cell lines in vitro, including four cancer cell lines (A549, MCF-7, HCT-8 and A2780) and their drug-resistant sublines (A549T, MCF-7R, HCT-8T and A2780T). As shown in Fig. 1A–D, after treated with spermine and spermidine for 48 h, a dose-dependent cytotoxicity effect on all four drug-resistant cell lines was observed; whereas no significant effect was observed on four wild cell lines. Putrescine and TETA did not show significant cytotoxicity effect on all the tested cell lines. Since TETA, an unnatural compound with a structure similar to spermine, and putrescine are not the substrates of amine oxidases; above suggests that the cytotoxicity effects may not be caused by spermine and spermidine directly, but may be related to the metabolites of polyamines.\nFigure 1\nDose-dependent cytotoxicity effects of polyamines, TETA, hydrogen peroxide and acrolein on cells. A549, A549T, MCF-7, MCF-7R, HCT-8, HCT-8T, A2780 and A2780T cells were respectively incubated with different concentration of (A) spermine, (B) spermidine, (C) putrescine, (D) TETA, (E) H2O2, and (F) acrolein for 48 h at 37 °C. Each point represents the mean value of the results of 2 to 4 wells of three or four experiments. The error bars indicate ± S.D., when not show, S.D. was smaller than the symbol.\nFull size image\nSince spermine showed stronger cytotoxicity activity on drug-resistant cells over that of spermidine, and an taxol-resistant A549 subline (A549T) was the most sensitive cells to spermine and spermidine among these drug-resistant sublines; the apoptosis assay and cell cycle assay of A549T cells after treatment with spermine were therefore performed. As shown in Fig. 2A, spermine significantly induced cell apoptosis and death in media containing FBS, and caused S phase arrest of A549T cells (Fig. 2C). However, spermine did not cause significant cell apoptosis and death in the media without FBS (Fig. 2B), further suggesting that the cytotoxicity activity of spermine was related to FBS.\nFigure 2\nCell apoptosis and cell cycle assay. (A,B) Cell apoptosis assay of A549T cells after treated with spermine at 37 °C for 6 h in RPMI1640 with 10% FBS (A) and FBS-free RPMI1640 (B) respectively. The concentration of spermine respectively is 0, 10, 20, 30, 50 and 80 μM. Cells were double-stained by Annexin V-FITC and PI. Crossing gates divided the dot plots into four quadrants. Dots in lower right quadrants (Annexin V+ and PI−) indicate early apoptosis cells; dots in upper right quadrants (Annexin V+ and PI+) indicate late apoptosis cells or dead cells. The numbers indicate the percentage of cells in the corresponding quadrants. (C) The cell cycle profiles analysis of A549T treated with spermine. The concentration of spermine respectively is 0, 30 and 60 μM. Quantification of G1, S and G2 phase percentage  was performed by FlowJo (Treestar, San Caros, USA). Results are single representative of three independent experiments.\nFull size image\nIt has previously been reported that the enzymatic oxidation products of spermine generated by purified bovine serum amine oxidase show a higher cytotoxicity to several drug-resistant cell lines than their wild type cell lines33, such as Chinese hamster ovary cells18,19,20, melanoma cells line (M14)21, human colon adenocarcinoma cell line (LoVo)22,23. Therefore we further measured the cytotoxicity effect of the enzymatic oxidation products of spermine, H2O2 and acrolein on the tested cell lines. Both of the two metabolites exhibited a dose-dependent toxicity effect on all cell lines, and the toxicity effect on drug-resistant cell lines was much stronger than that on wild cell lines (Fig. 1E,F). These results suggest that the cytotoxicity activity of spermine and spermidine may result from the enzymatic oxidation products of amine oxidases in FBS.\nPolyamine concentrations are high in growing tissues, for example, in tumors34. If polyamines accumulate excessively within cells or in the extracellular environment, they can be oxidatively deaminated by amine oxidases to generate toxic products, leading to cell death, necrosis or apoptosis31,34. In current case, cells grew in normal culture medium containing adscititious polyamines; no additional bovine serum amine-oxidase was added. If the stronger cytotoxicity of spermine and spermidine to drug-resistant cells resulted from the toxic oxidative products, the toxic products may be generated by high amount of amine oxidases in drug-resistant cells or by the amine oxidases in FBS. Spermine oxidase (SMOX) is a key enzyme in the process of spermine metabolism in cells, catalyzing spermine into spermidine. Thus, we firstly measured the amount of SMOX in different cells using SMOX ELISA kit. However, there is no significant difference in the expression of SMOX between sensitive and drug-resistant cancer cells (Fig. S2), which suggests that SMOX may be irrelevant to the stronger cytotoxicity of spermine and spermidine to drug-resistant cells.\nThe generation of H2O2 in cell culture media containing different serum supplements\nIn order to demonstrate that the oxidation products of spermine were generated by the amine oxidases in serum, one of the metabolites of polyamines, hydrogen peroxide, was measured. The experiments were performed by incubating different concentrations of spermine in cultured medium in the absence or presence of 10% FBS and/or cells, and then measuring the concentrations of H2O2 at different incubation time. As shown in Fig. 3A–D, whether or not cells existing, after adding different concentrations of spermine, almost no H2O2 was detected in culture media without FBS (Fig. 3A,C); whereas H2O2 was detected in the media containing FBS, and the concentration of H2O2 changed with the incubation time and the amount of added spermine (Fig. 3B,D). These results suggest that H2O2 was generated by the amine oxidases in FBS. In order to further confirm our conclusion, aminoguanidine35,36, an inhibitor of serum amine oxidases, was added to the culture media containing FBS. As shown in Fig. 3E, almost no H2O2 was detected no matter how much spermine added, which confirmed that spermine was oxidated by serum amine oxidases in FBS. In addition, in the presence of FBS and spermine, high concentration of spermine (≥40 μM) caused continuously accumulation of H2O2 in media as incubation time increased; while low concentration of spermine (10 μM) caused H2O2 first increase (before 120 min) and then decrease (Fig. 3D), which may due to the exhaustion of low concentration of spermine in ~120 min and the consumption of H2O2 through decomposing and reaction with certain components in media. The concentration of H2O2 in the media without cells was much higher than that in the media with cells existing, indicating that cells in the media could consume the H2O2 produced by oxidation of spermine (Fig. 3B,D).\nFigure 3\nThe generation of H2O2 in culture media after adding different concentrations of spermine (spm). The culture media containing (A) without FBS and with A549T cells, (B) with 10% FBS and A549T cells, (C) without FBS and cells, (D) with 10% FBS and without cells, (E) with 10% FBS and Aminoguanidine.\nFull size image\nTo further investigate the oxidization ability of serums from different sources to polyamines, the generation of H2O2 in the media containing either human serum or other ruminant serums (including calf, bovine, goat and horse serums) was also tested. Interestingly, almost no H2O2 was detected in the media containing 10% or 50% human serum after adding spermine or spermidine (Figs 4, S3 and S4). While, after adding spermine, much higher concentrations of H2O2 were detected in the media containing 10% calf, bovine, goat and horse serum respectively than that in the media containing 10% FBS, and the same trend of first increase and then decrease was also observed. Similar results were also observed when adding spermidine into the media containing 10% of these serums (Fig. S3). Furthermore, higher concentration of serum was found to oxidize spermine with a higher speed. When adding spermine into the media containing 50% of these ruminant serums, higher concentrations of H2O2 were detected in the beginning and then decreased much faster than that in the media containing 10% serum (Fig. S4). These results suggest that a higher concentration of amine oxidases exists in calf, bovine, goat and horse serum than in FBS, and a very low amount of amine oxidases is present in human serum. Ruminant serum is the main source of serum supplement in cell culture because of the easy obtainment, the big difference in the components between ruminant and human serum may cause the misleading results in the studies of human cells.\nFigure 4\nThe generation of H2O2 in RPMI1640 medium with 10% different serums after adding different concentrations of spermine (spm).\nFull size image\nIn addition, the cytotoxicity assay of spermine and spermidine in the media containing 10% goat serum was performed. Both polyamines exhibited higher toxicity effects to all the tested cell lines than those measured in the media containing 10% FBS, which was consistent with the higher concentrations of H2O2 generated in the media containing 10% goat serum (Fig. S5). The drug-resistant cell lines (A549T and MCF-7R) showed much higher sensitivity to spermine and spermidine than their wild cell lines (A549 and MCF-7). These results further confirm that it is the oxidation products of polyamines caused their cytotoxicity to cultured cells.\nThe mechanism investigation of the high sensitivity of drug-resistant cells to polyamines\nIn order to explain the higher sensitivity of drug-resistant cell lines to the cytotoxicity of polyamines than their wild cell lines, we tested the intracellular reactive oxygen species (ROS) by DCFHDA assay. The oxidization of DCFH (no fluorescence) by ROS produces DCF with high fluorescence in cells. As shown in Fig. 5, after treated with spermidine and spermine, the fluorescence intensity of A549T cells (drug-resistant cell type) was greatly increased, while the fluorescence increase in A549 cells was not significant; indicating that the concentration of ROS (mainly H2O2) in drug-resistant cells was much higher than that in the corresponding wild-type cells. This result suggests that the drug-resistant cells exhibit lower ability of scavenging ROS, which results in a much higher oxidative stress in cells.\nFigure 5\nConfocal imaging of A549 and A549T cells stained with DCFH (10 μM) after treated with spermidine (Spd, 50 μM) and spermine (Spm, 50 μM) for 6 hours. Images were collected with excitation at 488 nm and emission at 500–550 nm, ×100 oil immersion lens.\nFull size image\nWe further measured the total antioxidative capacity of the eight cell lines with a rapid ABTS•+ decolorization method. The antioxidants in cell contents could reduce the dark blue-green colored ABTS•+ radical to colorless ABTS form. As shown in Fig. 6A, the total antioxidative capacities of all the tested drug-resistant cell types were lower than their corresponding wild types, which resulted in the accumulation of H2O2 and the much higher oxidative stress in drug-resistant cells than the wild cell types. The lower antioxidative capacity of multidrug-resistant cancer cells has also been reported in a few papers37. This result can explain the selective cytotoxicity of spermine and spermidine to drug-resistant cells in media containing FBS.\nFigure 6\nThe total antioxidative capacity of different cells and the changes of mitochondrial membrane potential in cells treated with different compounds. Panel A is the total antioxidative capacity of eight cells was detected by ABTS•+ decolorization assay. Panel B and C are mitochondrial membrane potential changes in A2780 and A2780T, A549 and A549T cells respectively, were assessed using a mitochondrial membrane potential assay kit with JC-1, detected by Flow cytometry assay (FCM). The numbers of Optical Density are means ± SEM, n = 3–5 tests, **p < 0.01, ***p < 0.001, at least two independent experiments.\nFull size image\nMitochondrial membrane potential (ΔΨm) is considered as a potential target of ROS during oxidative stress-induced cell death38. The loss of ΔΨm is a hallmark of early cell apoptotic events. In order to understand of the different cytotoxicity of polyamines on drug-resistant cells and wild cells, we further compared the ΔΨm of two pairs of cells (A2780 and A2780T, A549 and A549T) after treated with spermine, spermidine, putrescine, H2O2 and acrolein. JC-1 dye exhibits potential-dependent accumulation in mitochondria, indicated by a fluorescence emission shift from green (FL1, ~529 nm, low ΔΨm) to red (FL2, ~590 nm, high ΔΨm) due to concentration-dependent formation of red fluorescent J-aggregates. It was used to measure the change of ΔΨm; the fluorescence ratio of FL1/FL2 can reflect the decrease in mitochondrial membrane potential. As shown in Fig. 6B,C, spermine, spermidine, H2O2 and acrolein but not putrescine significantly increased the FL1/FL2 of drug-resistant cell lines (A2780T and A549T), but did not change the FL1/FL2 of wild cell lines (A2780 and A549), indicating the loss of ΔΨm in drug-resistant cell lines was induced by spermine, spermidine, H2O2 and acrolein. Among these molecules, spermine caused a much higher increase of FL1/FL2. All these results are well consistent with the results of cytotoxicity assay, and further confirm that the oxidation products of spermine and spermidine caused high oxidative stresses in drug-resistant cells, resulting in the loss of ΔΨm and subsequent cell death.\nIn summary, we have tested the cytotoxicity of polyamines, including putrescine, spermidine, spermine and TETA. Spermidine and spermine showed high toxicity effect to drug-resistant cancer cell lines (A549T, MCF-7R, HCT-8T and A2780T) and low toxicity effect to the wild cell lines (A549, MCF-7, HCT-8 and A2780) (Fig. 1). Spermine was further demonstrated to significantly induce cell apoptosis and death in media containing FBS but not in FBS-free media, and cause S phase arrest of A549T cells (Fig. 2). Since the purified bovine serum amine oxidase was reported to oxide spermine causing the cytotoxicity to some cell lines20,39, the selective cytotoxicity of spermidine and spermine may be related to amine oxidases existed in FBS. Therefore, we tested the cytotoxicity of the enzymatic oxidation products of spermine, H2O2 and acrolein. H2O2 and acrolein showed similar toxicity effect on the tested drug-resistant cells but lower toxicity effect on wild cells. In order to demonstrate that spermidine and spermine were oxidated by amine oxidases in serum, we measured the generation of H2O2 after adding spermidine or spermine in cell culture media containing serum from different sources. After adding spermine or spermidine, a large amount of H2O2 was generated in cell culture media containing calf, bovine, goat or horse serums, a relatively low amount of H2O2 was generated in media containing FBS, and almost no H2O2 was detected in media containing human serum or in media without containing serum. The cytotoxicity of spermidine or spermine in media containing goat serum was stronger than that containing FBS. These results strongly confirmed that the cytotoxicity of polyamine resulted from the toxicity of oxidation products of polyamine generated by amine oxidases in ruminant serum supplements. There are a variety of oxidases that can degrade polyamines, such as diamine oxidase, spermine oxidase, acetylpolyamine oxidase, serum amine oxidase and others, unfortunately, the nomenclature of these enzymes is confusing16. Based on the substrate specificity to spermidine and spermine, in this case, the serum amine oxidase may play a vital role in degradation of polyamines. The higher sensitivity of the drug-resistant cancer cells to the cytotoxicity of spermine and spermidine was demonstrated to be the lower antioxidative capacity of drug-resistant cells than wild cells, which caused higher oxidative stresses and resulted in the loss of ΔΨm and subsequent cell death. Our results suggested that the enzymes in the serum supplement may cause unknown side effects on tested drugs. Therefore before drawing a conclusion of the drug effect on cells, the side effect from the serum supplement should be excluded firstly.; The toxicity effect of polyamines on cultured cells\nPolyamines (including spermine analogues) have been reported to have cytotoxicity effect on different cells24,25,26,27. Different mechanisms of action have been reported, such as inducing gene overexpression28, telomerase inhibiting29,30 and cytotoxicity of the metabolites generated by amine oxidases in cells31,32. In order to understand the real mechanism, we tested the cytotoxicity activity of four polyamines (putrescine, spermidine, spermine and triethylenetetramine (TETA)) on eight cell lines in vitro, including four cancer cell lines (A549, MCF-7, HCT-8 and A2780) and their drug-resistant sublines (A549T, MCF-7R, HCT-8T and A2780T). As shown in Fig. 1A–D, after treated with spermine and spermidine for 48 h, a dose-dependent cytotoxicity effect on all four drug-resistant cell lines was observed; whereas no significant effect was observed on four wild cell lines. Putrescine and TETA did not show significant cytotoxicity effect on all the tested cell lines. Since TETA, an unnatural compound with a structure similar to spermine, and putrescine are not the substrates of amine oxidases; above suggests that the cytotoxicity effects may not be caused by spermine and spermidine directly, but may be related to the metabolites of polyamines.\nFigure 1\nDose-dependent cytotoxicity effects of polyamines, TETA, hydrogen peroxide and acrolein on cells. A549, A549T, MCF-7, MCF-7R, HCT-8, HCT-8T, A2780 and A2780T cells were respectively incubated with different concentration of (A) spermine, (B) spermidine, (C) putrescine, (D) TETA, (E) H2O2, and (F) acrolein for 48 h at 37 °C. Each point represents the mean value of the results of 2 to 4 wells of three or four experiments. The error bars indicate ± S.D., when not show, S.D. was smaller than the symbol.\nFull size image\nSince spermine showed stronger cytotoxicity activity on drug-resistant cells over that of spermidine, and an taxol-resistant A549 subline (A549T) was the most sensitive cells to spermine and spermidine among these drug-resistant sublines; the apoptosis assay and cell cycle assay of A549T cells after treatment with spermine were therefore performed. As shown in Fig. 2A, spermine significantly induced cell apoptosis and death in media containing FBS, and caused S phase arrest of A549T cells (Fig. 2C). However, spermine did not cause significant cell apoptosis and death in the media without FBS (Fig. 2B), further suggesting that the cytotoxicity activity of spermine was related to FBS.\nFigure 2\nCell apoptosis and cell cycle assay. (A,B) Cell apoptosis assay of A549T cells after treated with spermine at 37 °C for 6 h in RPMI1640 with 10% FBS (A) and FBS-free RPMI1640 (B) respectively. The concentration of spermine respectively is 0, 10, 20, 30, 50 and 80 μM. Cells were double-stained by Annexin V-FITC and PI. Crossing gates divided the dot plots into four quadrants. Dots in lower right quadrants (Annexin V+ and PI−) indicate early apoptosis cells; dots in upper right quadrants (Annexin V+ and PI+) indicate late apoptosis cells or dead cells. The numbers indicate the percentage of cells in the corresponding quadrants. (C) The cell cycle profiles analysis of A549T treated with spermine. The concentration of spermine respectively is 0, 30 and 60 μM. Quantification of G1, S and G2 phase percentage  was performed by FlowJo (Treestar, San Caros, USA). Results are single representative of three independent experiments.\nFull size image\nIt has previously been reported that the enzymatic oxidation products of spermine generated by purified bovine serum amine oxidase show a higher cytotoxicity to several drug-resistant cell lines than their wild type cell lines33, such as Chinese hamster ovary cells18,19,20, melanoma cells line (M14)21, human colon adenocarcinoma cell line (LoVo)22,23. Therefore we further measured the cytotoxicity effect of the enzymatic oxidation products of spermine, H2O2 and acrolein on the tested cell lines. Both of the two metabolites exhibited a dose-dependent toxicity effect on all cell lines, and the toxicity effect on drug-resistant cell lines was much stronger than that on wild cell lines (Fig. 1E,F). These results suggest that the cytotoxicity activity of spermine and spermidine may result from the enzymatic oxidation products of amine oxidases in FBS.\nPolyamine concentrations are high in growing tissues, for example, in tumors34. If polyamines accumulate excessively within cells or in the extracellular environment, they can be oxidatively deaminated by amine oxidases to generate toxic products, leading to cell death, necrosis or apoptosis31,34. In current case, cells grew in normal culture medium containing adscititious polyamines; no additional bovine serum amine-oxidase was added. If the stronger cytotoxicity of spermine and spermidine to drug-resistant cells resulted from the toxic oxidative products, the toxic products may be generated by high amount of amine oxidases in drug-resistant cells or by the amine oxidases in FBS. Spermine oxidase (SMOX) is a key enzyme in the process of spermine metabolism in cells, catalyzing spermine into spermidine. Thus, we firstly measured the amount of SMOX in different cells using SMOX ELISA kit. However, there is no significant difference in the expression of SMOX between sensitive and drug-resistant cancer cells (Fig. S2), which suggests that SMOX may be irrelevant to the stronger cytotoxicity of spermine and spermidine to drug-resistant cells.\nThe generation of H2O2 in cell culture media containing different serum supplements\nIn order to demonstrate that the oxidation products of spermine were generated by the amine oxidases in serum, one of the metabolites of polyamines, hydrogen peroxide, was measured. The experiments were performed by incubating different concentrations of spermine in cultured medium in the absence or presence of 10% FBS and/or cells, and then measuring the concentrations of H2O2 at different incubation time. As shown in Fig. 3A–D, whether or not cells existing, after adding different concentrations of spermine, almost no H2O2 was detected in culture media without FBS (Fig. 3A,C); whereas H2O2 was detected in the media containing FBS, and the concentration of H2O2 changed with the incubation time and the amount of added spermine (Fig. 3B,D). These results suggest that H2O2 was generated by the amine oxidases in FBS. In order to further confirm our conclusion, aminoguanidine35,36, an inhibitor of serum amine oxidases, was added to the culture media containing FBS. As shown in Fig. 3E, almost no H2O2 was detected no matter how much spermine added, which confirmed that spermine was oxidated by serum amine oxidases in FBS. In addition, in the presence of FBS and spermine, high concentration of spermine (≥40 μM) caused continuously accumulation of H2O2 in media as incubation time increased; while low concentration of spermine (10 μM) caused H2O2 first increase (before 120 min) and then decrease (Fig. 3D), which may due to the exhaustion of low concentration of spermine in ~120 min and the consumption of H2O2 through decomposing and reaction with certain components in media. The concentration of H2O2 in the media without cells was much higher than that in the media with cells existing, indicating that cells in the media could consume the H2O2 produced by oxidation of spermine (Fig. 3B,D).\nFigure 3\nThe generation of H2O2 in culture media after adding different concentrations of spermine (spm). The culture media containing (A) without FBS and with A549T cells, (B) with 10% FBS and A549T cells, (C) without FBS and cells, (D) with 10% FBS and without cells, (E) with 10% FBS and Aminoguanidine.\nFull size image\nTo further investigate the oxidization ability of serums from different sources to polyamines, the generation of H2O2 in the media containing either human serum or other ruminant serums (including calf, bovine, goat and horse serums) was also tested. Interestingly, almost no H2O2 was detected in the media containing 10% or 50% human serum after adding spermine or spermidine (Figs 4, S3 and S4). While, after adding spermine, much higher concentrations of H2O2 were detected in the media containing 10% calf, bovine, goat and horse serum respectively than that in the media containing 10% FBS, and the same trend of first increase and then decrease was also observed. Similar results were also observed when adding spermidine into the media containing 10% of these serums (Fig. S3). Furthermore, higher concentration of serum was found to oxidize spermine with a higher speed. When adding spermine into the media containing 50% of these ruminant serums, higher concentrations of H2O2 were detected in the beginning and then decreased much faster than that in the media containing 10% serum (Fig. S4). These results suggest that a higher concentration of amine oxidases exists in calf, bovine, goat and horse serum than in FBS, and a very low amount of amine oxidases is present in human serum. Ruminant serum is the main source of serum supplement in cell culture because of the easy obtainment, the big difference in the components between ruminant and human serum may cause the misleading results in the studies of human cells.\nFigure 4\nThe generation of H2O2 in RPMI1640 medium with 10% different serums after adding different concentrations of spermine (spm).\nFull size image\nIn addition, the cytotoxicity assay of spermine and spermidine in the media containing 10% goat serum was performed. Both polyamines exhibited higher toxicity effects to all the tested cell lines than those measured in the media containing 10% FBS, which was consistent with the higher concentrations of H2O2 generated in the media containing 10% goat serum (Fig. S5). The drug-resistant cell lines (A549T and MCF-7R) showed much higher sensitivity to spermine and spermidine than their wild cell lines (A549 and MCF-7). These results further confirm that it is the oxidation products of polyamines caused their cytotoxicity to cultured cells.\nThe mechanism investigation of the high sensitivity of drug-resistant cells to polyamines\nIn order to explain the higher sensitivity of drug-resistant cell lines to the cytotoxicity of polyamines than their wild cell lines, we tested the intracellular reactive oxygen species (ROS) by DCFHDA assay. The oxidization of DCFH (no fluorescence) by ROS produces DCF with high fluorescence in cells. As shown in Fig. 5, after treated with spermidine and spermine, the fluorescence intensity of A549T cells (drug-resistant cell type) was greatly increased, while the fluorescence increase in A549 cells was not significant; indicating that the concentration of ROS (mainly H2O2) in drug-resistant cells was much higher than that in the corresponding wild-type cells. This result suggests that the drug-resistant cells exhibit lower ability of scavenging ROS, which results in a much higher oxidative stress in cells.\nFigure 5\nConfocal imaging of A549 and A549T cells stained with DCFH (10 μM) after treated with spermidine (Spd, 50 μM) and spermine (Spm, 50 μM) for 6 hours. Images were collected with excitation at 488 nm and emission at 500–550 nm, ×100 oil immersion lens.\nFull size image\nWe further measured the total antioxidative capacity of the eight cell lines with a rapid ABTS•+ decolorization method. The antioxidants in cell contents could reduce the dark blue-green colored ABTS•+ radical to colorless ABTS form. As shown in Fig. 6A, the total antioxidative capacities of all the tested drug-resistant cell types were lower than their corresponding wild types, which resulted in the accumulation of H2O2 and the much higher oxidative stress in drug-resistant cells than the wild cell types. The lower antioxidative capacity of multidrug-resistant cancer cells has also been reported in a few papers37. This result can explain the selective cytotoxicity of spermine and spermidine to drug-resistant cells in media containing FBS.\nFigure 6\nThe total antioxidative capacity of different cells and the changes of mitochondrial membrane potential in cells treated with different compounds. Panel A is the total antioxidative capacity of eight cells was detected by ABTS•+ decolorization assay. Panel B and C are mitochondrial membrane potential changes in A2780 and A2780T, A549 and A549T cells respectively, were assessed using a mitochondrial membrane potential assay kit with JC-1, detected by Flow cytometry assay (FCM). The numbers of Optical Density are means ± SEM, n = 3–5 tests, **p < 0.01, ***p < 0.001, at least two independent experiments.\nFull size image\nMitochondrial membrane potential (ΔΨm) is considered as a potential target of ROS during oxidative stress-induced cell death38. The loss of ΔΨm is a hallmark of early cell apoptotic events. In order to understand of the different cytotoxicity of polyamines on drug-resistant cells and wild cells, we further compared the ΔΨm of two pairs of cells (A2780 and A2780T, A549 and A549T) after treated with spermine, spermidine, putrescine, H2O2 and acrolein. JC-1 dye exhibits potential-dependent accumulation in mitochondria, indicated by a fluorescence emission shift from green (FL1, ~529 nm, low ΔΨm) to red (FL2, ~590 nm, high ΔΨm) due to concentration-dependent formation of red fluorescent J-aggregates. It was used to measure the change of ΔΨm; the fluorescence ratio of FL1/FL2 can reflect the decrease in mitochondrial membrane potential. As shown in Fig. 6B,C, spermine, spermidine, H2O2 and acrolein but not putrescine significantly increased the FL1/FL2 of drug-resistant cell lines (A2780T and A549T), but did not change the FL1/FL2 of wild cell lines (A2780 and A549), indicating the loss of ΔΨm in drug-resistant cell lines was induced by spermine, spermidine, H2O2 and acrolein. Among these molecules, spermine caused a much higher increase of FL1/FL2. All these results are well consistent with the results of cytotoxicity assay, and further confirm that the oxidation products of spermine and spermidine caused high oxidative stresses in drug-resistant cells, resulting in the loss of ΔΨm and subsequent cell death.\nIn summary, we have tested the cytotoxicity of polyamines, including putrescine, spermidine, spermine and TETA. Spermidine and spermine showed high toxicity effect to drug-resistant cancer cell lines (A549T, MCF-7R, HCT-8T and A2780T) and low toxicity effect to the wild cell lines (A549, MCF-7, HCT-8 and A2780) (Fig. 1). Spermine was further demonstrated to significantly induce cell apoptosis and death in media containing FBS but not in FBS-free media, and cause S phase arrest of A549T cells (Fig. 2). Since the purified bovine serum amine oxidase was reported to oxide spermine causing the cytotoxicity to some cell lines20,39, the selective cytotoxicity of spermidine and spermine may be related to amine oxidases existed in FBS. Therefore, we tested the cytotoxicity of the enzymatic oxidation products of spermine, H2O2 and acrolein. H2O2 and acrolein showed similar toxicity effect on the tested drug-resistant cells but lower toxicity effect on wild cells. In order to demonstrate that spermidine and spermine were oxidated by amine oxidases in serum, we measured the generation of H2O2 after adding spermidine or spermine in cell culture media containing serum from different sources. After adding spermine or spermidine, a large amount of H2O2 was generated in cell culture media containing calf, bovine, goat or horse serums, a relatively low amount of H2O2 was generated in media containing FBS, and almost no H2O2 was detected in media containing human serum or in media without containing serum. The cytotoxicity of spermidine or spermine in media containing goat serum was stronger than that containing FBS. These results strongly confirmed that the cytotoxicity of polyamine resulted from the toxicity of oxidation products of polyamine generated by amine oxidases in ruminant serum supplements. There are a variety of oxidases that can degrade polyamines, such as diamine oxidase, spermine oxidase, acetylpolyamine oxidase, serum amine oxidase and others, unfortunately, the nomenclature of these enzymes is confusing16. Based on the substrate specificity to spermidine and spermine, in this case, the serum amine oxidase may play a vital role in degradation of polyamines. The higher sensitivity of the drug-resistant cancer cells to the cytotoxicity of spermine and spermidine was demonstrated to be the lower antioxidative capacity of drug-resistant cells than wild cells, which caused higher oxidative stresses and resulted in the loss of ΔΨm and subsequent cell death. Our results suggested that the enzymes in the serum supplement may cause unknown side effects on tested drugs. Therefore before drawing a conclusion of the drug effect on cells, the side effect from the serum supplement should be excluded firstly.; Materials and Methods\nChemicals\nIf not stated otherwise, chemicals were purchased from Sigma Chemical Co. (St. Louis, Mo.). Spermine oxidase Enzyme-Linked Immuno-Sorbent Assay (ELISA) kit, Jc-1, and AmplifluTM Red (AR) were purchased from Beyotime Biotechnology (Shanghai, China). Cell Counting Kit-8 (CCK-8), cell apoptosis kit and cell cycle kit were purchased from Dojindo chemical technology (Japan). Human, calf, bovine, goat and horse serum were purchased from Kete Biological Technology Co. Ltd (Jiangsu, China).\nCell lines and cell culture\nAll cell lines used were of human origin. A549 (non-small cell lung cancer) and MCF-7 (breast cancer) cell lines were purchased from Cell Resource Center of Shanghai Institute for Biological Sciences (Chinese Academy of Sciences, Shanghai, China). A549T (Taxol-resistant A549 subline) and MCF-7R (Adriamycin-resistant MCF-7 subline) cell lines were from Shanghai Aiyan Biological Technology Co. Ltd (Shanghai, China). HCT-8 (colon carcinoma), A2780 (ovarian cancer), HCT-8T (Taxol-resistant HCT-8 subline) and A2780T (Taxol-resistant A2780 subline) were from Nanjing KeyGEN BioTECH Co. Ltd (Nanjing, China). PC-3 (prostate cancer) was from Typical Culture Preservation Commission Cell Bank, Chinese Academy of Sciences (Shanghai, China).\nAll cell lines were routinely cultured at 37 °C in humidified atmosphere with 5% CO2. Unless stated otherwise, the growth medium used for A549, A549T, MCF-7R, HCT-8, HCT-8T, PC-3 and A2780T cells was RPMI-1640 (Corning) containing 10% fetal bovine serum (FBS, Gibco) and 1% penicillin/streptomycin (Corning). MCF-7 and A2780 cells were propagated in Dulbecco’s Modified Eagle Medium (DMEM, Corning) with 10% fetal bovine serum (FBS, Gibco) and 1% penicillin/streptomycin (Corning). For comparison, some experiments replaced FBS with other serums (calf serum, bovine serum, goat serum, horse serum or human serum) and the same concentration.\nCell proliferation assay\nCells were seeded in 96-well plates (Corning) at different densities according to their intrinsic growth rate. A549 and A2780 were seeded at a density of 1 × 105/mL, MCF-7R, HCT-8, HCT-8T and A2780T were seeded at a density of 8 × 104/mL, A549T and MCF-7 were seeded at a density of 5 × 104/mL; and then all cells in the plates were incubated in a humidified atmosphere of 5% CO2 at 37 °C. After 24 h, spermine, spermidine, putrescine, triethylenetetramine, hydrogen peroxide and acrolein were added into each well at different concentration, respectively. The cells were further incubated for another 48 h without changing medium. Cell viability was measured by Cell Counting Kit-8 (CCK-8, Dojindo, Japan) according to the standard protocol outlined by the manufacturer. To ensure the results’ reliability, each concentration had two repeated wells and each experiment independently performed at least three times, and results are expressed as the mean of three experiments.\nCell apoptosis analysis\nA549T cells were seeded in a 6-well plate at a density of 1 × 105/mL, after pre-incubation for 24 h, cells were added with spermine (0, 10, 20, 30, 50 and 80 μM) and incubated for 6 h in RPMI1640 with FBS or without FBS. Then cells collected and labeled according to the standard protocol of Annexin V-FITC Apoptosis Detection Kit (Beyotime Institute of Biotechnology) and detected by flow cytometer with FL1 and FL2 channels.\nCell cycle measurements\nA549T cells were seeded at a density of 1 × 105/mL in a 6-well plate, after cultured for 24 h, spermine (0, 30 and 60 μM) were added into each well respectively and continuously incubated for 4 h. Then cell samples were prepared according to the protocol of Cell Cycle and Apoptosis Analysis Kit (Beyotime Institute of Biotechnology). Briefly, cells detached by 0.25% (w/v) trypsin-0.53 mM EDTA solution and fixed by 500 μL of 78% ethanol and stored at −20 °C over 24 h. The cells were added by 400 μL of PI and incubated at 37 °C for 30 min in the dark. The DNA content of cells was acquired by a FACScalibur flow cytometer (Becton Dickinson, USA) with FL2 channel. The data were analyzed by FlowJo software (Treestar, San Caros, USA).\nDetection of H2O2\nIn this assay, HRP catalyzed the decomposition of H2O2 causing the oxidation of AmplifluTM Red (AR) and resulting in the formation of resorufin, a highly fluorescent product. Under conditions where the molar ratio of AR to H2O2 was greater than five, resorufin was generated in a 1:1 stoichiometry with H2O2. To prepare the calibration curve, H2O2 was diluted to 0.391, 0.781, 1.563, 3.125, 6.25, 12.5, 25, and 50 μM with phosphate buffer saline (PBS), then incubated with a reaction mixture containing 10 μM AR and 0.1 unit/mL HPR for 20 min at 37 °C in a 96-well plate. Then the plate was read with a fluorescence microplate reader with excitation of 560 nm and emission at 595 nm. For samples, firstly, different concentrations of spermine or spermidine (0, 10, 20, 40, 60 and 80 μM) were incubated with different serums (calf serum, bovine serum, fetal bovine serum, goat serum, horse serum and human serum) at 37 °C; and the concentration of serums was 50% or 10%. 200 μL of samples were took out at different time (10, 30, 60, 120, 180, 240, 300, 360, 420 and 480 min), and incubated with 10 μM AR and 0.1 unit/mL HPR for 20 min at 37 °C in a 96-well plate, and the fluorescence intensity was measured with a microplate reader (Spectra Max M5, Molecular Device Co., USA).\nReactive oxygen species detection in cells\nROS was measured by a reactive oxygen assay kit using 2′,7′-dichlorodihydrofluorescein diacetate (DCFH-DA) as the fluorescence probe. For ROS imaging in cells, cells (A549 and A549T) were seeded at desired concentration in covered glass-bottomed confocal dishes (NEST Biotechnology Co. Ltd.), after cultured for at least 24 h, cells were washed once and incubated with spermidine (Spd, 50 μM) and spermine (Spm, 50 μM) in RPMI1640 containing 10%FBS for 6 hours, then cells were washed and incubated with DCFH-DA (10 μM) in RPMI1640 containing 10%FBS for 30 min. After washing with PBS, confocal imaging was performed on an OLYMPUS FV1000-IX81 confocal microscope (Olympus Corporation, Japan). Confocal images were processed by Olympus FV10-ASW 4.2 viewer software.\nTotal antioxidative capacity assay with ABTS•+\n2,2′-azino-bis (3-ethylbenzothiazoline-6-sulfonic acid) diammonium salt radical cation (ABTS•+) is a stable free radical frequently used for estimating the total antioxidative capacity (TAC) of natural products40. The antioxidative capacity of cell contents was measured by ABTS•+ decolorization assay41. Antioxidants in the sample reduced dark blue-green colored ABTS•+ radical to colorless ABTS form. The absorbance change at 414 nm was related to the total antioxidant level of the sample.\n1 × 106 cells was ultrasonically broken in 200 μL of cold Phosphate Buffer Solution (PBS) to release antioxidants, and centrifuged at 12000 g at 4 °C for 5 mins. 10 μL of the supernatant, and 200 μL of ABTS working solution (ABTS (10 mM) 2 μL, H2O2 (10 mM) 2 μL, and 196 μL PBS) were mixed in each well of 96-well plates and incubated for 10 mins at room temperature. 10 μL of ultrapure water was used as blank control. The absorbance at 414 nm was measured by a microplate reader (Spectra Max M5, Molecular Device Co.). The absorbance in each well reflected the total antioxidative capacity of each cell sample.\nMeasurement of the change of mitochondrial membrane potential\n2 × 105 cells (A2780, A2780T, A549 and A549T cells) were seeded in 6-well plate, respectively. After 24 hours, the medium in each well was changed to fresh medium with 50 μM hydrogen peroxide, 70 μM acrolein, 50 μM putrescine, 50 μM spermidine or 50 μM spermine. After cultured for another 8 h, cells were harvested, stained with JC-1 probe for 20 mins at 37 °C, then washed twice with PBS, and measured by Flow cytometry (FCM).; Chemicals\nIf not stated otherwise, chemicals were purchased from Sigma Chemical Co. (St. Louis, Mo.). Spermine oxidase Enzyme-Linked Immuno-Sorbent Assay (ELISA) kit, Jc-1, and AmplifluTM Red (AR) were purchased from Beyotime Biotechnology (Shanghai, China). Cell Counting Kit-8 (CCK-8), cell apoptosis kit and cell cycle kit were purchased from Dojindo chemical technology (Japan). Human, calf, bovine, goat and horse serum were purchased from Kete Biological Technology Co. Ltd (Jiangsu, China).\nCell lines and cell culture\nAll cell lines used were of human origin. A549 (non-small cell lung cancer) and MCF-7 (breast cancer) cell lines were purchased from Cell Resource Center of Shanghai Institute for Biological Sciences (Chinese Academy of Sciences, Shanghai, China). A549T (Taxol-resistant A549 subline) and MCF-7R (Adriamycin-resistant MCF-7 subline) cell lines were from Shanghai Aiyan Biological Technology Co. Ltd (Shanghai, China). HCT-8 (colon carcinoma), A2780 (ovarian cancer), HCT-8T (Taxol-resistant HCT-8 subline) and A2780T (Taxol-resistant A2780 subline) were from Nanjing KeyGEN BioTECH Co. Ltd (Nanjing, China). PC-3 (prostate cancer) was from Typical Culture Preservation Commission Cell Bank, Chinese Academy of Sciences (Shanghai, China).\nAll cell lines were routinely cultured at 37 °C in humidified atmosphere with 5% CO2. Unless stated otherwise, the growth medium used for A549, A549T, MCF-7R, HCT-8, HCT-8T, PC-3 and A2780T cells was RPMI-1640 (Corning) containing 10% fetal bovine serum (FBS, Gibco) and 1% penicillin/streptomycin (Corning). MCF-7 and A2780 cells were propagated in Dulbecco’s Modified Eagle Medium (DMEM, Corning) with 10% fetal bovine serum (FBS, Gibco) and 1% penicillin/streptomycin (Corning). For comparison, some experiments replaced FBS with other serums (calf serum, bovine serum, goat serum, horse serum or human serum) and the same concentration.\nCell proliferation assay\nCells were seeded in 96-well plates (Corning) at different densities according to their intrinsic growth rate. A549 and A2780 were seeded at a density of 1 × 105/mL, MCF-7R, HCT-8, HCT-8T and A2780T were seeded at a density of 8 × 104/mL, A549T and MCF-7 were seeded at a density of 5 × 104/mL; and then all cells in the plates were incubated in a humidified atmosphere of 5% CO2 at 37 °C. After 24 h, spermine, spermidine, putrescine, triethylenetetramine, hydrogen peroxide and acrolein were added into each well at different concentration, respectively. The cells were further incubated for another 48 h without changing medium. Cell viability was measured by Cell Counting Kit-8 (CCK-8, Dojindo, Japan) according to the standard protocol outlined by the manufacturer. To ensure the results’ reliability, each concentration had two repeated wells and each experiment independently performed at least three times, and results are expressed as the mean of three experiments.\nCell apoptosis analysis\nA549T cells were seeded in a 6-well plate at a density of 1 × 105/mL, after pre-incubation for 24 h, cells were added with spermine (0, 10, 20, 30, 50 and 80 μM) and incubated for 6 h in RPMI1640 with FBS or without FBS. Then cells collected and labeled according to the standard protocol of Annexin V-FITC Apoptosis Detection Kit (Beyotime Institute of Biotechnology) and detected by flow cytometer with FL1 and FL2 channels.\nCell cycle measurements\nA549T cells were seeded at a density of 1 × 105/mL in a 6-well plate, after cultured for 24 h, spermine (0, 30 and 60 μM) were added into each well respectively and continuously incubated for 4 h. Then cell samples were prepared according to the protocol of Cell Cycle and Apoptosis Analysis Kit (Beyotime Institute of Biotechnology). Briefly, cells detached by 0.25% (w/v) trypsin-0.53 mM EDTA solution and fixed by 500 μL of 78% ethanol and stored at −20 °C over 24 h. The cells were added by 400 μL of PI and incubated at 37 °C for 30 min in the dark. The DNA content of cells was acquired by a FACScalibur flow cytometer (Becton Dickinson, USA) with FL2 channel. The data were analyzed by FlowJo software (Treestar, San Caros, USA).\nDetection of H2O2\nIn this assay, HRP catalyzed the decomposition of H2O2 causing the oxidation of AmplifluTM Red (AR) and resulting in the formation of resorufin, a highly fluorescent product. Under conditions where the molar ratio of AR to H2O2 was greater than five, resorufin was generated in a 1:1 stoichiometry with H2O2. To prepare the calibration curve, H2O2 was diluted to 0.391, 0.781, 1.563, 3.125, 6.25, 12.5, 25, and 50 μM with phosphate buffer saline (PBS), then incubated with a reaction mixture containing 10 μM AR and 0.1 unit/mL HPR for 20 min at 37 °C in a 96-well plate. Then the plate was read with a fluorescence microplate reader with excitation of 560 nm and emission at 595 nm. For samples, firstly, different concentrations of spermine or spermidine (0, 10, 20, 40, 60 and 80 μM) were incubated with different serums (calf serum, bovine serum, fetal bovine serum, goat serum, horse serum and human serum) at 37 °C; and the concentration of serums was 50% or 10%. 200 μL of samples were took out at different time (10, 30, 60, 120, 180, 240, 300, 360, 420 and 480 min), and incubated with 10 μM AR and 0.1 unit/mL HPR for 20 min at 37 °C in a 96-well plate, and the fluorescence intensity was measured with a microplate reader (Spectra Max M5, Molecular Device Co., USA).\nReactive oxygen species detection in cells\nROS was measured by a reactive oxygen assay kit using 2′,7′-dichlorodihydrofluorescein diacetate (DCFH-DA) as the fluorescence probe. For ROS imaging in cells, cells (A549 and A549T) were seeded at desired concentration in covered glass-bottomed confocal dishes (NEST Biotechnology Co. Ltd.), after cultured for at least 24 h, cells were washed once and incubated with spermidine (Spd, 50 μM) and spermine (Spm, 50 μM) in RPMI1640 containing 10%FBS for 6 hours, then cells were washed and incubated with DCFH-DA (10 μM) in RPMI1640 containing 10%FBS for 30 min. After washing with PBS, confocal imaging was performed on an OLYMPUS FV1000-IX81 confocal microscope (Olympus Corporation, Japan). Confocal images were processed by Olympus FV10-ASW 4.2 viewer software.\nTotal antioxidative capacity assay with ABTS•+\n2,2′-azino-bis (3-ethylbenzothiazoline-6-sulfonic acid) diammonium salt radical cation (ABTS•+) is a stable free radical frequently used for estimating the total antioxidative capacity (TAC) of natural products40. The antioxidative capacity of cell contents was measured by ABTS•+ decolorization assay41. Antioxidants in the sample reduced dark blue-green colored ABTS•+ radical to colorless ABTS form. The absorbance change at 414 nm was related to the total antioxidant level of the sample.\n1 × 106 cells was ultrasonically broken in 200 μL of cold Phosphate Buffer Solution (PBS) to release antioxidants, and centrifuged at 12000 g at 4 °C for 5 mins. 10 μL of the supernatant, and 200 μL of ABTS working solution (ABTS (10 mM) 2 μL, H2O2 (10 mM) 2 μL, and 196 μL PBS) were mixed in each well of 96-well plates and incubated for 10 mins at room temperature. 10 μL of ultrapure water was used as blank control. The absorbance at 414 nm was measured by a microplate reader (Spectra Max M5, Molecular Device Co.). The absorbance in each well reflected the total antioxidative capacity of each cell sample.\nMeasurement of the change of mitochondrial membrane potential\n2 × 105 cells (A2780, A2780T, A549 and A549T cells) were seeded in 6-well plate, respectively. After 24 hours, the medium in each well was changed to fresh medium with 50 μM hydrogen peroxide, 70 μM acrolein, 50 μM putrescine, 50 μM spermidine or 50 μM spermine. After cultured for another 8 h, cells were harvested, stained with JC-1 probe for 20 mins at 37 °C, then washed twice with PBS, and measured by Flow cytometry (FCM).; Electronic supplementary material\nSupplementary Information; Supplementary Information",
            "keywords": "Cell culture; Chemical biology",
            "link": "https://www.nature.com/articles/s41598-018-28648-8",
            "organization_affiliated": "Department Beijing National Laboratory for Molecular Sciences, Key Laboratory of Analytical Chemistry for Living Biosystems, CAS Research/Education Center for Excellence in Molecular Sciences, Institute of Chemistry, Chinese Academy of Sciences, Beijing, China; University of the Chinese Academy of Sciences, Beijing, China; Department Beijing National Laboratory for Molecular Sciences, Key Laboratory of Analytical Chemistry for Living Biosystems, CAS Research/Education Center for Excellence in Molecular Sciences, Institute of Chemistry, Chinese Academy of Sciences, Beijing, China; University of the Chinese Academy of Sciences, Beijing, China; CAS Center for Excellence in Nanoscience, National Center for Nanoscience and Technology, Beijing, China; Department Beijing National Laboratory for Molecular Sciences, Key Laboratory of Analytical Chemistry for Living Biosystems, CAS Research/Education Center for Excellence in Molecular Sciences, Institute of Chemistry, Chinese Academy of Sciences, Beijing, China; University of the Chinese Academy of Sciences, Beijing, China; Department Beijing National Laboratory for Molecular Sciences, Key Laboratory of Analytical Chemistry for Living Biosystems, CAS Research/Education Center for Excellence in Molecular Sciences, Institute of Chemistry, Chinese Academy of Sciences, Beijing, China; University of the Chinese Academy of Sciences, Beijing, China; Department Beijing National Laboratory for Molecular Sciences, Key Laboratory of Analytical Chemistry for Living Biosystems, CAS Research/Education Center for Excellence in Molecular Sciences, Institute of Chemistry, Chinese Academy of Sciences, Beijing, China; University of the Chinese Academy of Sciences, Beijing, China; Department Beijing National Laboratory for Molecular Sciences, Key Laboratory of Analytical Chemistry for Living Biosystems, CAS Research/Education Center for Excellence in Molecular Sciences, Institute of Chemistry, Chinese Academy of Sciences, Beijing, China; University of the Chinese Academy of Sciences, Beijing, China; Department Beijing National Laboratory for Molecular Sciences, Key Laboratory of Analytical Chemistry for Living Biosystems, CAS Research/Education Center for Excellence in Molecular Sciences, Institute of Chemistry, Chinese Academy of Sciences, Beijing, China; University of the Chinese Academy of Sciences, Beijing, China; Department Beijing National Laboratory for Molecular Sciences, Key Laboratory of Analytical Chemistry for Living Biosystems, CAS Research/Education Center for Excellence in Molecular Sciences, Institute of Chemistry, Chinese Academy of Sciences, Beijing, China; University of the Chinese Academy of Sciences, Beijing, China",
            "pdf_link": "https://www.nature.com/articles/s41598-018-28648-8.pdf",
            "nature_source": "Scientific Reports 2018 8:1",
            "title": "Oxidative degradation of polyamines by serum supplement causes cytotoxicity on cultured cells",
            "id": "95db4daa-a9f6-4eda-8ce3-c6045d75320f"
        },
        {
            "abstract": "Malaria outbreaks have been reported in recent years in the Colombian Amazon region, malaria has been re-emerging in areas where it was previously controlled. Information from malaria transmission networks and knowledge about the population characteristics influencing the dispersal of parasite species is limited. This study aimed to determine the distribution patterns of Plasmodium vivax, P. malariae and P. falciparum single and mixed infections, as well as the significant socio-spatial groupings relating to the appearance of such infections. An active search in 57 localities resulted in 2,106 symptomatic patients being enrolled. Parasitaemia levels were assessed by optical microscopy, and parasites were detected by PCR. The association between mixed infections (in 43.2% of the population) and socio-spatial factors was modelled using logistic regression and multiple correspondence analyses. P. vivax occurred most frequently (71.0%), followed by P. malariae (43.2%), in all localities. The results suggest that a parasite density-dependent regulation model (with fever playing a central role) was appropriate for modelling the frequency of mixed species infections in this population. This study highlights the under-reporting of Plasmodium spp. mixed infections in the malaria-endemic area of the Colombian Amazon region and the association between causative and environmental factors in such areas.",
            "acquisition_date": "2020-06-06",
            "authors": "Milena Camargo; Sara C. Soto-De León; Luisa Del Río-Ospina; Astrid C. Páez; Zanony González; Edgardo González; Juan R. Cubides; Paola A. Camargo-Ayala; Manuel E. Patarroyo; Manuel A. Patarroyo",
            "category": "Malaria; Parasite biology",
            "citations": "7",
            "date": "2018-04-03",
            "doi": "10.1038/s41598-018-23801-9",
            "body": "Introduction\nMalaria is considered as the parasitic disease that has the greatest impact on public health1. Plasmodium spp. infection becomes perpetuated in a cycle of disease and poverty, contributing towards affected individuals’ worsening quality of life and limiting the possibility of eradicating such infections2.\nMalaria is transmitted by female mosquitoes from the genus Anopheles, with mammals being the definitive host1,3. Six species from the genus Plasmodium have been described as causing malaria in human beings: P. falciparum, P. vivax, P. malariae, P. ovale curtisi, P. ovale wallikeri and P. knowlesi4,5, with Plasmodium spp. being endemic in 91 countries and causing 212 million cases of infection per year (429,000 leading to death)6.\nCurrent mitigation measures in disease-endemic countries have not had the desired impact since an increase in malaria cases has been reported for countries such as Colombia, where 55,866 cases were confirmed in 2015 (annual parasite index: 5.4 cases per 1,000 inhabitants)7,8. Colombia thus accounts for 10% of cases of malaria in the Americas9,10,11, with Colombia’s Amazon region being the focus of an outbreak of malaria during the last few years7,12.\nThe Amazon basin covering a large part of southern Colombia (108,951 km2) is a major transmission and disease load foci13,14, which operates relatively independently from other Colombian regions. The Amazon region’s habitat diversity and its own climatic characteristics (seasonal rainfall effects) determine vector presence and abundance (i.e. Anopheles benarrochi, Anopheles oswaldoi, Anopheles darlingi). Such vectors are anthropophilic and highly efficient regarding parasite transmission and have facilitated the increase in cases of malaria amongst the region’s inhabitants, together with the demographics of human settlements, and clinical and housing conditions in the region and their related dynamics14,15.\nRisk factors for acquiring malaria have been described on different levels (genetic, social determinants and environmental) and influence exposure to parasitic infection, its course and outcomes16,17,18,19. These factors also facilitate infection by more than one Plasmodium spp. (mixed-species malaria); however, these mixed-species are currently being under-diagnosed given the use of conventional techniques10. Little is currently known regarding the biology and establishment of Plasmodium mixed infections, but insight into the frequency of mixed-species infections in the population and the factors affecting their transmission is essential for developing effective disease elimination measures20,21. The factors involved in malaria transmission and those influencing mixed Plasmodium spp. species infection in highly endemic regions need to be determined, particularly at a time when rapid climatic changes can modify host-vector-pathogen relationship dynamics.\nThis study aimed to establish the frequency of three Plasmodium spp. within the population, determine the distribution of mixed infections and identify infected patient profiles in the Colombian Amazon region.; Malaria is considered as the parasitic disease that has the greatest impact on public health1. Plasmodium spp. infection becomes perpetuated in a cycle of disease and poverty, contributing towards affected individuals’ worsening quality of life and limiting the possibility of eradicating such infections2.\nMalaria is transmitted by female mosquitoes from the genus Anopheles, with mammals being the definitive host1,3. Six species from the genus Plasmodium have been described as causing malaria in human beings: P. falciparum, P. vivax, P. malariae, P. ovale curtisi, P. ovale wallikeri and P. knowlesi4,5, with Plasmodium spp. being endemic in 91 countries and causing 212 million cases of infection per year (429,000 leading to death)6.\nCurrent mitigation measures in disease-endemic countries have not had the desired impact since an increase in malaria cases has been reported for countries such as Colombia, where 55,866 cases were confirmed in 2015 (annual parasite index: 5.4 cases per 1,000 inhabitants)7,8. Colombia thus accounts for 10% of cases of malaria in the Americas9,10,11, with Colombia’s Amazon region being the focus of an outbreak of malaria during the last few years7,12.\nThe Amazon basin covering a large part of southern Colombia (108,951 km2) is a major transmission and disease load foci13,14, which operates relatively independently from other Colombian regions. The Amazon region’s habitat diversity and its own climatic characteristics (seasonal rainfall effects) determine vector presence and abundance (i.e. Anopheles benarrochi, Anopheles oswaldoi, Anopheles darlingi). Such vectors are anthropophilic and highly efficient regarding parasite transmission and have facilitated the increase in cases of malaria amongst the region’s inhabitants, together with the demographics of human settlements, and clinical and housing conditions in the region and their related dynamics14,15.\nRisk factors for acquiring malaria have been described on different levels (genetic, social determinants and environmental) and influence exposure to parasitic infection, its course and outcomes16,17,18,19. These factors also facilitate infection by more than one Plasmodium spp. (mixed-species malaria); however, these mixed-species are currently being under-diagnosed given the use of conventional techniques10. Little is currently known regarding the biology and establishment of Plasmodium mixed infections, but insight into the frequency of mixed-species infections in the population and the factors affecting their transmission is essential for developing effective disease elimination measures20,21. The factors involved in malaria transmission and those influencing mixed Plasmodium spp. species infection in highly endemic regions need to be determined, particularly at a time when rapid climatic changes can modify host-vector-pathogen relationship dynamics.\nThis study aimed to establish the frequency of three Plasmodium spp. within the population, determine the distribution of mixed infections and identify infected patient profiles in the Colombian Amazon region.; Results\nCharacteristics of the population being analysed\nOf the 2,106 patients invited to participate in the study, 5.3% (n = 111) were excluded due to negative results with human β-globin gene amplification; 1,995 subjects thus became the object of statistical analysis. The sampling region was divided into areas in accordance with the population characteristics (Fig. 1); 344 samples were taken in area 1, 257 samples in area 2, 566 samples in area 3 and 828 samples in area 4 (Additional file 1: Table S1). The average age of the population was 26.6 years (SD: 19.8 years) and 48.2% (n = 961) reported a previous episode of malaria, mainly those living in area 4 (n = 441). Table 1 provides the distribution of sociodemographic characteristics amongst the population in accordance with the Plasmodium spp. infection stage (as determined by molecular biology).\nFigure 1\nGeographical locations of the 57 localities where samples were collected (this map was modified from a map downloaded from the Instituto Geográfico Agustín Codazzi, IGAC)60,61. Images are freely accessible and modifiable in accordance with IGAC policies.\nFull size image\nTable 1 Sociodemographic characteristics of the sample population.\nFull size table\nDetecting Plasmodium spp. by conventional microscopy and PCR\nBy analysing thick blood smears (TBS), 37% (n = 737/1,995) of the population were identified as positive for Plasmodium spp., 31.3% (n = 625/1,995) for P. vivax, 6.4% (n = 128/1,995) for P. falciparum and less than 1% (n = 16/1,995) had mixed-species infections (Additional file 2: Fig. S1a). Parasitaemia varied from 32 to 85,320 parasites/µL blood (mean: 10,100; SD: 11,603), being higher in P. vivax (mean: 10,585; SD: 11,920) than in P. falciparum (mean: 7,752; SD: 9,099).\nRegarding parasite DNA detection, 88% (n = 1,750/1,995) of the target population were infected with Plasmodium spp., with P. vivax being the most prevalent species (71.0%; n = 1,412/1,995), followed by P. malariae (43.2%; n = 862/1,995) and P. falciparum (21.7%; n = 432/1,995). Mixed infection events (simultaneous infection by ≥2 species) were found in 43.2% (n = 844/1,995) of the target population (Additional file 2: Fig. S1b), with the P. vivax/P. malariae combination being the most frequently detected (n = 504/1,995) (Fig. 2).\nFigure 2\nCumulative frequency of Plasmodium species and their contribution to malaria in 1,750 people in whom parasitic DNA was identified using molecular techniques. P.v = Plasmodium vivax, P.m = Plasmodium malariae and P.f = Plasmodium falciparum.\nFull size image\nIt was found that 75% of the cases were infected with P. vivax and P. malariae (Fig. 2). Parasite frequency ranged from 82% to 100% (Additional file 3: Fig. S2a) when evaluating parasite infection with respect to age and P. vivax was the most prevalent species amongst all age groups, showing a greater frequency in the 31–60-year-old age group (p = 0.002; Chi2 tests) (Table 1; Additional file 3: Fig. S2b).\nEvaluating the sampling areas and the types of settlement\nAdditional analysis evaluated the parasite infection status (single and mixed), the mean rate of Plasmodium spp. parasitaemia and the distribution with respect to the area sampled. Sampling area 1 had the highest single infection frequency (48.3%) (not statistically significant: p = 0.561; Chi2 test); mixed infections appeared most frequently in area 2 (p = 0.001; Chi2 test) (Fig. 3a). Mean parasitaemia levels were lower in cases of single infection (9,854 parasites/µL) than in mixed infections (10,394 parasites/µL), but this difference was not statistically significant (p = 0.533; T-test) (Additional file 4: Fig. S3a). However, parasitaemia varied significantly depending on the area being sampled (p = 0.026; ANOVA test). Bonferroni test correction showed significant differences between areas 3 and 4 (p = 0.022) (Additional file 4: Fig. S3b).\nFigure 3\nRelative frequency of parasite infection and Plasmodium spp. distribution with respect to the area sampled [area 1 (n = 344), area 2 (n = 257), area 3 (n = 566) and area 4 (n = 828)]. Part (a) shows the distribution of parasite infection frequency with respect to the Plasmodium spp. infection status. Blue represents the uninfected target population. Green represents the proportion of the target population infected by a single species. Dark red represents the proportion of the target population with a mixed species infection. Part (b) shows the relative frequency of Plasmodium spp.\nFull size image\nThe results of the analysis of Plasmodium spp. distribution with respect to area showed that P. vivax had the greatest frequency (greater than 65%) in almost all localities, except for P. vivax in Punta Brava and Yaguas (Additional file 5: Table S3) and P. malariae (absent in seven localities evaluated) (Additional file 5: Table S3) (40.7% to 47.7% relative frequencies). P. falciparum prevalence was significantly lower in area 1 relative to all other (p = 0.001; Fisher’s exact test) (Fig. 3b).\nParasite infection was evaluated with respect to the type of settlement; Leticia and Puerto Nariño are urban settlements; the remaining localities are rural. There were similar infection percentages for all types of settlement; however, the parasite density index (PDI) was higher for rural areas (index: 57.8). P. falciparum infection was mostly restricted to rural settlements (Additional file 6: Table S3).\nPlasmodium spp. infection profiles\nA clinical profile was created for each participant based on the symptoms reported in a survey conducted during sampling. Vomiting (p = 0.018; Fisher’s exact test) and diarrhoea (p = 0.005; Fisher’s exact test) occurred most frequently in the study population with single Plasmodium spp. infections, whereas severe headache was most frequently reported in the population with mixed-species infections (p = 0.001; Fisher’s exact test) (Additional file 7: Fig. S4). The distribution of symptoms was similar for all species of infecting Plasmodium, with fever being the most frequently reported symptom amongst the three species (89% to 91%) and a rash being the least frequently reported symptom in the sample population (2.1% to 3.2%) (Additional file 8: Fig. S5).\nLogistic regression was used to identify the association between the variables evaluated (age, area, parasitaemia, access to basic services (public water and electricity supply, sewerage service), nearby water stagnations, use of mosquito nets and use of insecticides) and the presence of mixed-species infection. Patients having 2,000 to 4,999 parasites/µL blood parasitaemia [adjusted odds ratio (aOR) 0.61: 0.38–0.98, 95% confidence interval (CI)] or 5,000 to 9,999 parasites/µL blood parasitaemia (aOR 0.48: 0.29–0.77, 95% CI) had a lower probability of acquiring a mixed infection. No significant associations were observed for the other variables included in the model (Table 2).\nTable 2 Risk factors associated with mixed infections.\nFull size table\nAnalysing the strength of the association between sociodemographic, clinical and laboratory variables (as previously mentioned), and the combination of parasite species revealed positive associations between area 1 and mixed P. vivax and P. malariae infections (aOR 2.13: 1.33–3.42, 95% CI), access to a public water supply and mixed P. malariae and P. falciparum infections (aOR 6.90: 4.98–8.28, 95% CI) and triple infections (simultaneous infection by the three species being evaluated) (aOR 3.05: 1.20–7.74, 95% CI). Variables showing less significant associations were parasitaemia (5,000 to 9,999 parasites/µL blood) in P. malariae and P. falciparum infections (aOR 0.18: 0.35–0.93, 95% CI) and triple infection events with parasitaemia higher than 2,000 parasites/µL blood and area 1 (Additional file 9: Table S4).\nMultiple correspondence analysis (MCA) was used for identifying Plasmodium spp. infection profiles by compiling clinical and sociodemographic variables (Tables 3 and 4). Three main axes emerged after analysing the change in inertia in the histogram showing the eigenvalues of the active variables (Table 5 and Fig. 4). Three profiles were constructed around these axes (epidemiological and clinical variables related to P. falciparum infection, those related to triple infection (P. falciparum, P. vivax and P. malariae) and those related to double infection by P. vivax and P. malariae) (Table 5 and Fig. 4).\nTable 3 Contribution, cosine squared and active variable test values.\nFull size table\nTable 4 Test values for illustrative variables.\nFull size table\nTable 5 Profile structure.\nFull size table\nFigure 4\nMultiple correspondence analysis (MCA). Part (a) represents the mode on axes 1 and 2. Part (b) represents the mode on axes 1 and 3. Part (c) represents the mode on axes 2 and 3. The variables contributing towards each profile are highlighted; green indicates the positive pole and red indicates the negative pole variables.\nFull size image\nThe first profile consisted of variables related to the area in which the patients reside, their sanitary conditions (i.e. nearby stagnant water, mosquito nets and insecticide use) and certain symptoms (i.e. headache, shivering and vomiting). Residing in Puerto Nariño, area 4, having no stagnant water nearby, having a history of malaria and displaying mild symptoms (i.e. mild headache without shivering) correlated with P. falciparum infection (Table 5 and Fig. 4a).\nThe second profile related to triple P. falciparum, P. vivax and P. malariae infection, and the variables covered age, living conditions, medical history and symptoms (i.e. 19–60 years of age, having no stagnant water nearby, having a history of malaria, symptoms including abdominal pain, normal-coloured urine, slight to moderate headache, diarrhoea and no fever) (Table 5 and Fig. 4b).\nThe third profile (double P. vivax and P. malariae infection) highlighted more severe symptomatology, together with parasitaemia. The variables included living in Puerto Nariño, area 4, fever, shivering, vomiting, diarrhoea, moderate headache, normal-coloured urine and >9,999 or between 2,000–4,999 parasitaemia (Table 5 and Fig. 4c).; Characteristics of the population being analysed\nOf the 2,106 patients invited to participate in the study, 5.3% (n = 111) were excluded due to negative results with human β-globin gene amplification; 1,995 subjects thus became the object of statistical analysis. The sampling region was divided into areas in accordance with the population characteristics (Fig. 1); 344 samples were taken in area 1, 257 samples in area 2, 566 samples in area 3 and 828 samples in area 4 (Additional file 1: Table S1). The average age of the population was 26.6 years (SD: 19.8 years) and 48.2% (n = 961) reported a previous episode of malaria, mainly those living in area 4 (n = 441). Table 1 provides the distribution of sociodemographic characteristics amongst the population in accordance with the Plasmodium spp. infection stage (as determined by molecular biology).\nFigure 1\nGeographical locations of the 57 localities where samples were collected (this map was modified from a map downloaded from the Instituto Geográfico Agustín Codazzi, IGAC)60,61. Images are freely accessible and modifiable in accordance with IGAC policies.\nFull size image\nTable 1 Sociodemographic characteristics of the sample population.\nFull size table\nDetecting Plasmodium spp. by conventional microscopy and PCR\nBy analysing thick blood smears (TBS), 37% (n = 737/1,995) of the population were identified as positive for Plasmodium spp., 31.3% (n = 625/1,995) for P. vivax, 6.4% (n = 128/1,995) for P. falciparum and less than 1% (n = 16/1,995) had mixed-species infections (Additional file 2: Fig. S1a). Parasitaemia varied from 32 to 85,320 parasites/µL blood (mean: 10,100; SD: 11,603), being higher in P. vivax (mean: 10,585; SD: 11,920) than in P. falciparum (mean: 7,752; SD: 9,099).\nRegarding parasite DNA detection, 88% (n = 1,750/1,995) of the target population were infected with Plasmodium spp., with P. vivax being the most prevalent species (71.0%; n = 1,412/1,995), followed by P. malariae (43.2%; n = 862/1,995) and P. falciparum (21.7%; n = 432/1,995). Mixed infection events (simultaneous infection by ≥2 species) were found in 43.2% (n = 844/1,995) of the target population (Additional file 2: Fig. S1b), with the P. vivax/P. malariae combination being the most frequently detected (n = 504/1,995) (Fig. 2).\nFigure 2\nCumulative frequency of Plasmodium species and their contribution to malaria in 1,750 people in whom parasitic DNA was identified using molecular techniques. P.v = Plasmodium vivax, P.m = Plasmodium malariae and P.f = Plasmodium falciparum.\nFull size image\nIt was found that 75% of the cases were infected with P. vivax and P. malariae (Fig. 2). Parasite frequency ranged from 82% to 100% (Additional file 3: Fig. S2a) when evaluating parasite infection with respect to age and P. vivax was the most prevalent species amongst all age groups, showing a greater frequency in the 31–60-year-old age group (p = 0.002; Chi2 tests) (Table 1; Additional file 3: Fig. S2b).\nEvaluating the sampling areas and the types of settlement\nAdditional analysis evaluated the parasite infection status (single and mixed), the mean rate of Plasmodium spp. parasitaemia and the distribution with respect to the area sampled. Sampling area 1 had the highest single infection frequency (48.3%) (not statistically significant: p = 0.561; Chi2 test); mixed infections appeared most frequently in area 2 (p = 0.001; Chi2 test) (Fig. 3a). Mean parasitaemia levels were lower in cases of single infection (9,854 parasites/µL) than in mixed infections (10,394 parasites/µL), but this difference was not statistically significant (p = 0.533; T-test) (Additional file 4: Fig. S3a). However, parasitaemia varied significantly depending on the area being sampled (p = 0.026; ANOVA test). Bonferroni test correction showed significant differences between areas 3 and 4 (p = 0.022) (Additional file 4: Fig. S3b).\nFigure 3\nRelative frequency of parasite infection and Plasmodium spp. distribution with respect to the area sampled [area 1 (n = 344), area 2 (n = 257), area 3 (n = 566) and area 4 (n = 828)]. Part (a) shows the distribution of parasite infection frequency with respect to the Plasmodium spp. infection status. Blue represents the uninfected target population. Green represents the proportion of the target population infected by a single species. Dark red represents the proportion of the target population with a mixed species infection. Part (b) shows the relative frequency of Plasmodium spp.\nFull size image\nThe results of the analysis of Plasmodium spp. distribution with respect to area showed that P. vivax had the greatest frequency (greater than 65%) in almost all localities, except for P. vivax in Punta Brava and Yaguas (Additional file 5: Table S3) and P. malariae (absent in seven localities evaluated) (Additional file 5: Table S3) (40.7% to 47.7% relative frequencies). P. falciparum prevalence was significantly lower in area 1 relative to all other (p = 0.001; Fisher’s exact test) (Fig. 3b).\nParasite infection was evaluated with respect to the type of settlement; Leticia and Puerto Nariño are urban settlements; the remaining localities are rural. There were similar infection percentages for all types of settlement; however, the parasite density index (PDI) was higher for rural areas (index: 57.8). P. falciparum infection was mostly restricted to rural settlements (Additional file 6: Table S3).\nPlasmodium spp. infection profiles\nA clinical profile was created for each participant based on the symptoms reported in a survey conducted during sampling. Vomiting (p = 0.018; Fisher’s exact test) and diarrhoea (p = 0.005; Fisher’s exact test) occurred most frequently in the study population with single Plasmodium spp. infections, whereas severe headache was most frequently reported in the population with mixed-species infections (p = 0.001; Fisher’s exact test) (Additional file 7: Fig. S4). The distribution of symptoms was similar for all species of infecting Plasmodium, with fever being the most frequently reported symptom amongst the three species (89% to 91%) and a rash being the least frequently reported symptom in the sample population (2.1% to 3.2%) (Additional file 8: Fig. S5).\nLogistic regression was used to identify the association between the variables evaluated (age, area, parasitaemia, access to basic services (public water and electricity supply, sewerage service), nearby water stagnations, use of mosquito nets and use of insecticides) and the presence of mixed-species infection. Patients having 2,000 to 4,999 parasites/µL blood parasitaemia [adjusted odds ratio (aOR) 0.61: 0.38–0.98, 95% confidence interval (CI)] or 5,000 to 9,999 parasites/µL blood parasitaemia (aOR 0.48: 0.29–0.77, 95% CI) had a lower probability of acquiring a mixed infection. No significant associations were observed for the other variables included in the model (Table 2).\nTable 2 Risk factors associated with mixed infections.\nFull size table\nAnalysing the strength of the association between sociodemographic, clinical and laboratory variables (as previously mentioned), and the combination of parasite species revealed positive associations between area 1 and mixed P. vivax and P. malariae infections (aOR 2.13: 1.33–3.42, 95% CI), access to a public water supply and mixed P. malariae and P. falciparum infections (aOR 6.90: 4.98–8.28, 95% CI) and triple infections (simultaneous infection by the three species being evaluated) (aOR 3.05: 1.20–7.74, 95% CI). Variables showing less significant associations were parasitaemia (5,000 to 9,999 parasites/µL blood) in P. malariae and P. falciparum infections (aOR 0.18: 0.35–0.93, 95% CI) and triple infection events with parasitaemia higher than 2,000 parasites/µL blood and area 1 (Additional file 9: Table S4).\nMultiple correspondence analysis (MCA) was used for identifying Plasmodium spp. infection profiles by compiling clinical and sociodemographic variables (Tables 3 and 4). Three main axes emerged after analysing the change in inertia in the histogram showing the eigenvalues of the active variables (Table 5 and Fig. 4). Three profiles were constructed around these axes (epidemiological and clinical variables related to P. falciparum infection, those related to triple infection (P. falciparum, P. vivax and P. malariae) and those related to double infection by P. vivax and P. malariae) (Table 5 and Fig. 4).\nTable 3 Contribution, cosine squared and active variable test values.\nFull size table\nTable 4 Test values for illustrative variables.\nFull size table\nTable 5 Profile structure.\nFull size table\nFigure 4\nMultiple correspondence analysis (MCA). Part (a) represents the mode on axes 1 and 2. Part (b) represents the mode on axes 1 and 3. Part (c) represents the mode on axes 2 and 3. The variables contributing towards each profile are highlighted; green indicates the positive pole and red indicates the negative pole variables.\nFull size image\nThe first profile consisted of variables related to the area in which the patients reside, their sanitary conditions (i.e. nearby stagnant water, mosquito nets and insecticide use) and certain symptoms (i.e. headache, shivering and vomiting). Residing in Puerto Nariño, area 4, having no stagnant water nearby, having a history of malaria and displaying mild symptoms (i.e. mild headache without shivering) correlated with P. falciparum infection (Table 5 and Fig. 4a).\nThe second profile related to triple P. falciparum, P. vivax and P. malariae infection, and the variables covered age, living conditions, medical history and symptoms (i.e. 19–60 years of age, having no stagnant water nearby, having a history of malaria, symptoms including abdominal pain, normal-coloured urine, slight to moderate headache, diarrhoea and no fever) (Table 5 and Fig. 4b).\nThe third profile (double P. vivax and P. malariae infection) highlighted more severe symptomatology, together with parasitaemia. The variables included living in Puerto Nariño, area 4, fever, shivering, vomiting, diarrhoea, moderate headache, normal-coloured urine and >9,999 or between 2,000–4,999 parasitaemia (Table 5 and Fig. 4c).; Discussion\nThe climatic, environmental and geographic characteristics in South America provide favourable conditions for the circulation of Plasmodium spp. and vector-borne diseases such as malaria, which thereby poses a significant threat to public health in countries such as Colombia22. The population living in the Colombian Amazon region is particularly vulnerable, showing high malarial morbidity and mortality7,9.\nIn this report, most of the study population resided in rural areas lacking access to water, sewerage and/or gas (i.e. public services). Their type of housing is palafitic (i.e. stilt houses over water/alongside a river supported by pillars or simple stakes, or houses built on bodies of calm water such as lakes, lagoons and slow running large rivers), often but not always having palm-leaf roofs and wooden walls, thereby exposing their inhabitants to the environment and the vector’s ecosystem, thus increasing their probability of acquiring parasitic infections23. Such living conditions result in the high prevalence of malaria in this population, and in other populations in Colombia and worldwide8,24,25.\nThe active search for parasite infections has involved the simultaneous use of molecular and conventional microscopy techniques. This approach has enabled the diagnosis of P. malariae and mixed-species malaria infections (Additional file 2: Fig. S1). TBS as a diagnostic tool for malaria may not be sufficient as it leads to under-reporting (mainly of mixed-species malaria) and is limited in its ability of ensure timely treatment. Its use must thus be complemented by techniques providing greater sensitivity (i.e. molecular techniques)10,13,26,27. Prompt and accurate diagnosis of malarial infection in symptomatic populations and the identification of asymptomatic and sub-microscopic infections contributing to transmission can thus constitute part of the effective control and management of disease, with a view to eliminating malaria28,29.\nUsing molecular techniques enabled the identification of a large number of parasite infections and a high PDI (Additional file 6: Table S3) for Colombia; municipalities in Colombia’s Pacific region and the Antioquia region have reported similar results in terms of infection and PDI30. Molecular diagnostic tools have enabled the successful and highly sensitive detection of parasite species involved in mixed infections. In this study, more than 40% of the target population had mixed-species infections (Fig. 3 and Additional file 2: Fig. S1b), which was consistent with previous reports in India20, Thailand31, Papua New Guinea32 and Brazil33.\nAs previously reported for Colombia, P. vivax was associated with the highest frequency of malaria in all localities evaluated (Fig. 2)3,34; conversely, in the Peruvian Amazonian region the prevalence of this species varies in accordance with the area being evaluated35.\nP. malariae was the second most highly ranked species in terms of disease frequency and contribution to infections (Fig. 2). This parasite species is known to be widespread across sub-Saharan Africa and south-eastern Asia36; however, molecular detection methods identified a higher proportion of P. malariae compared with microscopy in our study and in previous studies in Colombia and worldwide3,10,31,33.\nP. falciparum showed lower prevalence and contribution to cases of malaria in the target population. A differential infection frequency was detected for this species with respect to the type of settlement, with the number of cases of infection with this parasite being greater in rural populations (Fig. 4b and Additional file 6: Table S3).\nDifferential parasitaemia levels were detected amongst the different areas being sampled. Individuals living in endemic areas who have been exposed to the parasite from an early age display a certain degree of immunity, as exemplified by low parasitaemia levels when exposed to new infections37,38. This may partially explain why the population inhabiting area 4 had the lowest levels of parasitaemia (Additional file 4: Fig S3b), consistent with the fact that more than 50% of this area’s inhabitants had suffered previous episodes of malaria. However, further studies regarding the association between previous episodes of malaria and parasitaemia levels are needed.\nEvaluating the factors associated with mixed-species infection revealed that high parasitaemia levels were less frequently associated with simultaneous P. falciparum and P. malariae infection (Table 2 and Additional file 9: Table S4). Cross protection has been reported for these two parasite species39, as they share common antigens37,40, therefore host immunity limits parasitaemia in this type of mixed infection.\nParasite infection may be favoured by certain host characteristics that increase the interaction of parasites with target cells, thereby leading to greater infection success41,42; for example, the probability of being bitten and the transmission frequency is greater in endemic populations32,43,44. Some areas within the Colombian Amazon region were found to be associated with higher levels of parasite infection; mixed infections (P. vivax and P. malariae) were associated with localities in areas 1 and 4 and Puerto Nariño (Additional file 9: Tables S4 and 5), whereas P. falciparum infection was concentrated in rural populations, mainly in localities in area 4 (Table 5 and Additional file 6: Table S3).\nSpatial factors influence the parasite-host-vector interaction and contribute towards the appearance of high transmission foci or hotspots within a geographical area45,46. In these foci, high levels of parasite circulation are observed, thereby facilitating dispersion to other localities and contributing to the spread of infections47,48.\nThe mean parasitaemia values were similar for different types of infection (single or mixed) (Additional file 4: Fig. S3a), suggesting that more than one species of the same organism did not seem to have an additive effect on the amount of circulating parasites. Previous studies have proposed a density-dependent regulation mechanism interacting with other factors such as a species-genotype specific immune response, resulting in stabilisation of the Plasmodium population and episodes that are not dependent on infection by particular species49, which may help to explain our findings.\nThe coexistence of more than one parasite species in the same individual may be mediated by host and pathogen factors, such as the host immune response initially directed against the species or genotype at the highest density, thereby favouring the persistence of infection at lower density in a particular host39. The species/genotype coexistence model is controlled by parasite density-dependent regulation mechanisms; this model suggests that parasitaemia of the first infecting species (which has the highest prevalence amongst the target population) is downregulated on coinfection with the second species (which has the lowest prevalence). However, when the most prevalent species exceeds a threshold, the hosts’ immune response is triggered to limit the infection; such a mechanism is turned off once the parasite density is under control, thereby favouring population growth of the second species in mixed infections and persistence of the parasites in the host39,44,49.\nSuch mechanisms are largely modulated by the host. Our study evaluated whether specific clinical profiles amongst the target population were linked to infection with particular Plasmodium species. Fever was the symptom detected at the greatest frequency with all parasite species (Additional file 8: Fig. S5), as well as headaches for mixed infections (Additional file 7: Fig. S4).\nMCA revealed dependent relationships between active and illustrative variables (Tables 3 and 4) and three profiles were compiled from the results (Table 5 and Fig. 4). The first profile suggested that symptoms such as headache and diarrhoea, along with previous episodes of malaria, occurred in the target population regardless of the species or infection status (single or mixed). It has been reported that infection-derived immunity in regions with constant parasite circulation (endemic regions), such as the Colombian Amazon region, induces a clinical course with non-specific symptomatology25.\nThe second profile related to triple infection and a population aged from 19 to 60 years (Fig. 4b and Table 5). High mixed infection frequencies were observed in this age group (Additional file 3: Fig. S2a), i.e. the economically-active population who are potentially those most exposed to mosquito bites and therefore to parasite transmission. The target region’s economic activity is related to artisan-produced handicrafts exploiting wood, fishing, mining and small-scale cultivation in community gardens, all situations that favour the transmission of disease and limit the effectiveness of parasite control measures22,34.\nThe third profile related to severe symptoms (i.e. fever) and mixed P. vivax and P. malariae infections (Fig. 4c and Table 5). This profile supported the aforementioned parasite density-dependent population regulation model39,49,50. This model illustrates that a parasite species present at higher density would influence the growth of other parasite species activating typical clinical symptoms in the host and maintaining stability of the population dynamics of parasite species51.\nIn-depth analysis is required for defining infection hotspots. Time series analysis should be used for parasite detection to establish whether infection events are due to transient infection or transmission foci, and risk maps and the population distribution (for host and vector) should be analysed to determine the localities of disease cases16,46,48. Identifying whether a specific area has high disease transmission enables appropriate management strategies to be designed to effectively limit the parasite’s transmission cycle47,48.\nControl measures implemented in Colombia have focused on reducing the disease burden by the large-scale provision of insecticide-treated mosquito nets, periodic intra-household spraying and the presence of government agencies responsible for control, diagnosis and treatment12,30,52. Although endemic countries have introduced disease mitigation measures, they have not had the desired impact as the number of malaria cases has increased, particularly in rural areas7.\nThe present study actively searched for symptomatic patients in geographically isolated localities lacking nearby healthcare posts. The average family income is less than $250 per month in these areas, so a trip to a health centre represents a considerable family expense (around $50 per trip), so many parasitic infections are not seen or treated by healthcare control programmes22.\nGreater malaria control efforts are required for progression towards the elimination of this disease; thus, understanding the distribution patterns of particular parasite species and the factors that influence malaria transmission in the Colombian Amazon region is crucial. The results of this study provide additional insight into malarial infections in the Colombian Amazon region, helping define the areas to be prioritised in terms of malaria prevention and control measures, with the aim of decreasing malarial incidence and approaching the long-term goal of eradication.; The climatic, environmental and geographic characteristics in South America provide favourable conditions for the circulation of Plasmodium spp. and vector-borne diseases such as malaria, which thereby poses a significant threat to public health in countries such as Colombia22. The population living in the Colombian Amazon region is particularly vulnerable, showing high malarial morbidity and mortality7,9.\nIn this report, most of the study population resided in rural areas lacking access to water, sewerage and/or gas (i.e. public services). Their type of housing is palafitic (i.e. stilt houses over water/alongside a river supported by pillars or simple stakes, or houses built on bodies of calm water such as lakes, lagoons and slow running large rivers), often but not always having palm-leaf roofs and wooden walls, thereby exposing their inhabitants to the environment and the vector’s ecosystem, thus increasing their probability of acquiring parasitic infections23. Such living conditions result in the high prevalence of malaria in this population, and in other populations in Colombia and worldwide8,24,25.\nThe active search for parasite infections has involved the simultaneous use of molecular and conventional microscopy techniques. This approach has enabled the diagnosis of P. malariae and mixed-species malaria infections (Additional file 2: Fig. S1). TBS as a diagnostic tool for malaria may not be sufficient as it leads to under-reporting (mainly of mixed-species malaria) and is limited in its ability of ensure timely treatment. Its use must thus be complemented by techniques providing greater sensitivity (i.e. molecular techniques)10,13,26,27. Prompt and accurate diagnosis of malarial infection in symptomatic populations and the identification of asymptomatic and sub-microscopic infections contributing to transmission can thus constitute part of the effective control and management of disease, with a view to eliminating malaria28,29.\nUsing molecular techniques enabled the identification of a large number of parasite infections and a high PDI (Additional file 6: Table S3) for Colombia; municipalities in Colombia’s Pacific region and the Antioquia region have reported similar results in terms of infection and PDI30. Molecular diagnostic tools have enabled the successful and highly sensitive detection of parasite species involved in mixed infections. In this study, more than 40% of the target population had mixed-species infections (Fig. 3 and Additional file 2: Fig. S1b), which was consistent with previous reports in India20, Thailand31, Papua New Guinea32 and Brazil33.\nAs previously reported for Colombia, P. vivax was associated with the highest frequency of malaria in all localities evaluated (Fig. 2)3,34; conversely, in the Peruvian Amazonian region the prevalence of this species varies in accordance with the area being evaluated35.\nP. malariae was the second most highly ranked species in terms of disease frequency and contribution to infections (Fig. 2). This parasite species is known to be widespread across sub-Saharan Africa and south-eastern Asia36; however, molecular detection methods identified a higher proportion of P. malariae compared with microscopy in our study and in previous studies in Colombia and worldwide3,10,31,33.\nP. falciparum showed lower prevalence and contribution to cases of malaria in the target population. A differential infection frequency was detected for this species with respect to the type of settlement, with the number of cases of infection with this parasite being greater in rural populations (Fig. 4b and Additional file 6: Table S3).\nDifferential parasitaemia levels were detected amongst the different areas being sampled. Individuals living in endemic areas who have been exposed to the parasite from an early age display a certain degree of immunity, as exemplified by low parasitaemia levels when exposed to new infections37,38. This may partially explain why the population inhabiting area 4 had the lowest levels of parasitaemia (Additional file 4: Fig S3b), consistent with the fact that more than 50% of this area’s inhabitants had suffered previous episodes of malaria. However, further studies regarding the association between previous episodes of malaria and parasitaemia levels are needed.\nEvaluating the factors associated with mixed-species infection revealed that high parasitaemia levels were less frequently associated with simultaneous P. falciparum and P. malariae infection (Table 2 and Additional file 9: Table S4). Cross protection has been reported for these two parasite species39, as they share common antigens37,40, therefore host immunity limits parasitaemia in this type of mixed infection.\nParasite infection may be favoured by certain host characteristics that increase the interaction of parasites with target cells, thereby leading to greater infection success41,42; for example, the probability of being bitten and the transmission frequency is greater in endemic populations32,43,44. Some areas within the Colombian Amazon region were found to be associated with higher levels of parasite infection; mixed infections (P. vivax and P. malariae) were associated with localities in areas 1 and 4 and Puerto Nariño (Additional file 9: Tables S4 and 5), whereas P. falciparum infection was concentrated in rural populations, mainly in localities in area 4 (Table 5 and Additional file 6: Table S3).\nSpatial factors influence the parasite-host-vector interaction and contribute towards the appearance of high transmission foci or hotspots within a geographical area45,46. In these foci, high levels of parasite circulation are observed, thereby facilitating dispersion to other localities and contributing to the spread of infections47,48.\nThe mean parasitaemia values were similar for different types of infection (single or mixed) (Additional file 4: Fig. S3a), suggesting that more than one species of the same organism did not seem to have an additive effect on the amount of circulating parasites. Previous studies have proposed a density-dependent regulation mechanism interacting with other factors such as a species-genotype specific immune response, resulting in stabilisation of the Plasmodium population and episodes that are not dependent on infection by particular species49, which may help to explain our findings.\nThe coexistence of more than one parasite species in the same individual may be mediated by host and pathogen factors, such as the host immune response initially directed against the species or genotype at the highest density, thereby favouring the persistence of infection at lower density in a particular host39. The species/genotype coexistence model is controlled by parasite density-dependent regulation mechanisms; this model suggests that parasitaemia of the first infecting species (which has the highest prevalence amongst the target population) is downregulated on coinfection with the second species (which has the lowest prevalence). However, when the most prevalent species exceeds a threshold, the hosts’ immune response is triggered to limit the infection; such a mechanism is turned off once the parasite density is under control, thereby favouring population growth of the second species in mixed infections and persistence of the parasites in the host39,44,49.\nSuch mechanisms are largely modulated by the host. Our study evaluated whether specific clinical profiles amongst the target population were linked to infection with particular Plasmodium species. Fever was the symptom detected at the greatest frequency with all parasite species (Additional file 8: Fig. S5), as well as headaches for mixed infections (Additional file 7: Fig. S4).\nMCA revealed dependent relationships between active and illustrative variables (Tables 3 and 4) and three profiles were compiled from the results (Table 5 and Fig. 4). The first profile suggested that symptoms such as headache and diarrhoea, along with previous episodes of malaria, occurred in the target population regardless of the species or infection status (single or mixed). It has been reported that infection-derived immunity in regions with constant parasite circulation (endemic regions), such as the Colombian Amazon region, induces a clinical course with non-specific symptomatology25.\nThe second profile related to triple infection and a population aged from 19 to 60 years (Fig. 4b and Table 5). High mixed infection frequencies were observed in this age group (Additional file 3: Fig. S2a), i.e. the economically-active population who are potentially those most exposed to mosquito bites and therefore to parasite transmission. The target region’s economic activity is related to artisan-produced handicrafts exploiting wood, fishing, mining and small-scale cultivation in community gardens, all situations that favour the transmission of disease and limit the effectiveness of parasite control measures22,34.\nThe third profile related to severe symptoms (i.e. fever) and mixed P. vivax and P. malariae infections (Fig. 4c and Table 5). This profile supported the aforementioned parasite density-dependent population regulation model39,49,50. This model illustrates that a parasite species present at higher density would influence the growth of other parasite species activating typical clinical symptoms in the host and maintaining stability of the population dynamics of parasite species51.\nIn-depth analysis is required for defining infection hotspots. Time series analysis should be used for parasite detection to establish whether infection events are due to transient infection or transmission foci, and risk maps and the population distribution (for host and vector) should be analysed to determine the localities of disease cases16,46,48. Identifying whether a specific area has high disease transmission enables appropriate management strategies to be designed to effectively limit the parasite’s transmission cycle47,48.\nControl measures implemented in Colombia have focused on reducing the disease burden by the large-scale provision of insecticide-treated mosquito nets, periodic intra-household spraying and the presence of government agencies responsible for control, diagnosis and treatment12,30,52. Although endemic countries have introduced disease mitigation measures, they have not had the desired impact as the number of malaria cases has increased, particularly in rural areas7.\nThe present study actively searched for symptomatic patients in geographically isolated localities lacking nearby healthcare posts. The average family income is less than $250 per month in these areas, so a trip to a health centre represents a considerable family expense (around $50 per trip), so many parasitic infections are not seen or treated by healthcare control programmes22.\nGreater malaria control efforts are required for progression towards the elimination of this disease; thus, understanding the distribution patterns of particular parasite species and the factors that influence malaria transmission in the Colombian Amazon region is crucial. The results of this study provide additional insight into malarial infections in the Colombian Amazon region, helping define the areas to be prioritised in terms of malaria prevention and control measures, with the aim of decreasing malarial incidence and approaching the long-term goal of eradication.; Methods\nStudy area and population\nThis transversal study was carried out from July 2015 to April 2016; it included the population of the Colombian Amazon trapezium, inhabitants from the towns of Leticia and Puerto Nariño and rural settlements located along the banks of the Amazon and Loretuyacu rivers. The Colombian Amazon region represents 42% of Colombia’s territory and is formed by the Caquetá, Putumayo, Vaupés, Guainía, Guaviare and Amazon departments, the latter comprising the greatest geographical area12,53,54. The Amazon department has 77,088 inhabitants (population density: 1.5 inhabitants per km2)12. The town of Leticia and its surrounding communities had a projected population of 41,639 inhabitants according to the Departamento Administrativo Nacional de Estadística (DANE – Colombian Official Statistics Department) 2016 figures; Puerto Nariño and its neighbouring communities accounted for 8,279 inhabitants12.\nFifty-seven localities were sampled and grouped into four areas, taking into account their location and mobilisation towards basins converging on major tributaries (the Amazon and Loretuyacu rivers) (Fig. 1 and Additional file 1: Table S1). Area 1 included 32 localities (including the town of Leticia, the capital of the Amazon department and the remaining rural settlements), area 2 covered 10 localities (one settlement being mainly urban and the rest rural), area 3 covered seven localities (all rural) and area 4 covered eight localities (rural settlements all along the banks of the Loretuyacu river).\nEthical considerations and sample-taking\nInclusion criteria consisted of recognising symptoms related to malarial infection when taking samples, such as headache, fever during the previous 8 days and sweating. People without malaria symptoms were not included in the study (exclusion criterion). The aim of the study was explained to patients; those who accepted an invitation to participate signed an informed consent form. A survey was then conducted that compiled information regarding participants’ socio-demographic characteristics and risk factors for malaria infection. This study was approved and supervised by the Universidad del Rosario’s (Colombia) School of Medicine and Health Sciences (EMCS) Research Ethics Committee (Comité de Ética en Investigacion - CEI) (CEI-ABN026-000161). Patients under 18 years of age who accepted the invitation to participate signed an informed consent, along with their tutors’ written approval. All methods and experiments were performed in accordance with the approved guidelines.\nTwo blood samples were collected simultaneously by capillary puncture. The first (TBS) was subjected to parasitological diagnosis by optical microscopy following Giemsa staining; the samples were processed and read on site at the time of sample collection. The second sample was stored on Flinders Technology Associates (FTA) cards and transported to the molecular biology laboratory of the FIDIC for molecular identification of the infecting parasite.\nMolecular diagnosis of Plasmodium spp\nA Pure Link Genomic DNA mini kit (Invitrogen) was used for extracting the DNA from the FTA cards, following the manufacturer’s instructions. This was followed by PCR amplification of the extracted DNA to confirm the presence of the human β-globin constitutive gene segment3,10.\nThe infecting Plasmodium species (P. vivax, P. falciparum and/or P. malariae) were identified in the β-globin-positive samples by nested PCR. Specific primers against the 18 S rRNA fragment were used in the first round of PCR for genus detection and a second amplification (using the first PCR product as template) was performed to distinguish the P. falciparum, P. vivax and P. malariae species. The amplification conditions for these PCRs have been described previously by our group3,10.\nStatistical analysis\nDescriptive statistics were used to summarise the sociodemographic variables, such as the sample-taking area, access to basic services (public water and electricity supply, sewerage service) and risk factors (nearby stagnant water, mosquito nets and insecticide use); these were presented as percentages with their respective 95% confidence intervals (95% CI). Age and parasitaemia (defined by TBS, as the number of parasites per 8,000 white cells/μL/number of white cells) were reported, along with their respective means and standard deviations (SD)55. The parasite density index (PDI) was taken as the amount of confirmed cases of malaria/population at risk56. Mixed infections were defined as the simultaneous detection of two or more Plasmodium spp. Fisher’s exact or Chi2 tests were used for establishing statistically significant differences amongst the data. ANOVA was used for comparing means and Bonferroni test was used for adjusting for multiple comparisons. A t-test was used for comparing the mean values for parasitaemia with the parasite infection status (single and/or mixed infection).\nLogistic regression analysis was used for modelling the risk of a mixed infection, taking mixed infections as a dependent variable. Independent variables included in the model were age, residing in an urban or rural area, parasitaemia reported by TBS and housing conditions such as sewerage, gas and electricity supply, nearby stagnant water and mosquito net and insecticide use. STATA 12 software was used for analysing the data.\nMultiple correspondence analysis (MCA) was used for establishing patient profiles, taking into account the nature of the clinical, epidemiological and laboratory variables (fundamentally categorical) estimated in this study. MCA was used for evaluating the degree to which each clinical and epidemiological variable participated in the compiling of profiles or groups of clinical significance in terms of similarity with or proximity to the different categories of variables, thus facilitating the incorporation of laboratory variables (infection presence/absence, parasitaemia) into these profiles’ for observing patterns57,58,59. In this way, groups were identified that had clinical significance from different groupings of categories of variables (i.e. this method was used to identify how sociodemographic characteristics and risk factors were grouped with single or multiple infections).\nTwo groups of variables were chosen for this analysis: active variables used for constructing factorial axes and supplementary or illustrative variables, which enriched factorial axes interpretation once they had been constructed58.\nSociodemographic, epidemiological and clinical variables were considered active variables, i.e. age, gender, origin, area, mosquito net and insecticide use, nearby stagnant water, fever, headache, vomiting, shivering, diarrhoea, urine colour, abdominal pain, outbreaks on the skin and previous episodes of malaria. The contribution values for each category were analysed for interpreting the axes compiled by the active variables, and the categories with a contribution value of more than 2.5 [mean contribution of 40 categories (100/40 = 2.5%)] were selected57.\nIllustrative variables were the presence/absence of P. vivax, P. falciparum and P. malariae infection and parasitaemia. Cosine values were evaluated for estimating the quality of each active variable’s representation on each axis. The test values were used to determine whether the representation of each category on each axis significantly differed from 0 (≤−2 or ≥ 2 cut-off points), thus giving an evaluation of each category’s significance57.\nThe structure and formation of each profile were analysed using a bi-dimensional graphical representation. The active variables (epidemiological and clinical variables and risk factors) were represented on each axis by filled boxes and the nominal illustrative variables (infection by each of the three species and parasitaemia) were represented by empty rhombuses. The test values sign indicated each modality’s position on the positive or negative pole of each axis. Square size was proportional to each modality’s contribution on the most representative axis. Possible dependence and similarity relationships were identified, taking into account the distance between the variables represented on the graph, regarding the categories thus represented. SPAD-5 software was used for MCA.; Study area and population\nThis transversal study was carried out from July 2015 to April 2016; it included the population of the Colombian Amazon trapezium, inhabitants from the towns of Leticia and Puerto Nariño and rural settlements located along the banks of the Amazon and Loretuyacu rivers. The Colombian Amazon region represents 42% of Colombia’s territory and is formed by the Caquetá, Putumayo, Vaupés, Guainía, Guaviare and Amazon departments, the latter comprising the greatest geographical area12,53,54. The Amazon department has 77,088 inhabitants (population density: 1.5 inhabitants per km2)12. The town of Leticia and its surrounding communities had a projected population of 41,639 inhabitants according to the Departamento Administrativo Nacional de Estadística (DANE – Colombian Official Statistics Department) 2016 figures; Puerto Nariño and its neighbouring communities accounted for 8,279 inhabitants12.\nFifty-seven localities were sampled and grouped into four areas, taking into account their location and mobilisation towards basins converging on major tributaries (the Amazon and Loretuyacu rivers) (Fig. 1 and Additional file 1: Table S1). Area 1 included 32 localities (including the town of Leticia, the capital of the Amazon department and the remaining rural settlements), area 2 covered 10 localities (one settlement being mainly urban and the rest rural), area 3 covered seven localities (all rural) and area 4 covered eight localities (rural settlements all along the banks of the Loretuyacu river).\nEthical considerations and sample-taking\nInclusion criteria consisted of recognising symptoms related to malarial infection when taking samples, such as headache, fever during the previous 8 days and sweating. People without malaria symptoms were not included in the study (exclusion criterion). The aim of the study was explained to patients; those who accepted an invitation to participate signed an informed consent form. A survey was then conducted that compiled information regarding participants’ socio-demographic characteristics and risk factors for malaria infection. This study was approved and supervised by the Universidad del Rosario’s (Colombia) School of Medicine and Health Sciences (EMCS) Research Ethics Committee (Comité de Ética en Investigacion - CEI) (CEI-ABN026-000161). Patients under 18 years of age who accepted the invitation to participate signed an informed consent, along with their tutors’ written approval. All methods and experiments were performed in accordance with the approved guidelines.\nTwo blood samples were collected simultaneously by capillary puncture. The first (TBS) was subjected to parasitological diagnosis by optical microscopy following Giemsa staining; the samples were processed and read on site at the time of sample collection. The second sample was stored on Flinders Technology Associates (FTA) cards and transported to the molecular biology laboratory of the FIDIC for molecular identification of the infecting parasite.\nMolecular diagnosis of Plasmodium spp\nA Pure Link Genomic DNA mini kit (Invitrogen) was used for extracting the DNA from the FTA cards, following the manufacturer’s instructions. This was followed by PCR amplification of the extracted DNA to confirm the presence of the human β-globin constitutive gene segment3,10.\nThe infecting Plasmodium species (P. vivax, P. falciparum and/or P. malariae) were identified in the β-globin-positive samples by nested PCR. Specific primers against the 18 S rRNA fragment were used in the first round of PCR for genus detection and a second amplification (using the first PCR product as template) was performed to distinguish the P. falciparum, P. vivax and P. malariae species. The amplification conditions for these PCRs have been described previously by our group3,10.\nStatistical analysis\nDescriptive statistics were used to summarise the sociodemographic variables, such as the sample-taking area, access to basic services (public water and electricity supply, sewerage service) and risk factors (nearby stagnant water, mosquito nets and insecticide use); these were presented as percentages with their respective 95% confidence intervals (95% CI). Age and parasitaemia (defined by TBS, as the number of parasites per 8,000 white cells/μL/number of white cells) were reported, along with their respective means and standard deviations (SD)55. The parasite density index (PDI) was taken as the amount of confirmed cases of malaria/population at risk56. Mixed infections were defined as the simultaneous detection of two or more Plasmodium spp. Fisher’s exact or Chi2 tests were used for establishing statistically significant differences amongst the data. ANOVA was used for comparing means and Bonferroni test was used for adjusting for multiple comparisons. A t-test was used for comparing the mean values for parasitaemia with the parasite infection status (single and/or mixed infection).\nLogistic regression analysis was used for modelling the risk of a mixed infection, taking mixed infections as a dependent variable. Independent variables included in the model were age, residing in an urban or rural area, parasitaemia reported by TBS and housing conditions such as sewerage, gas and electricity supply, nearby stagnant water and mosquito net and insecticide use. STATA 12 software was used for analysing the data.\nMultiple correspondence analysis (MCA) was used for establishing patient profiles, taking into account the nature of the clinical, epidemiological and laboratory variables (fundamentally categorical) estimated in this study. MCA was used for evaluating the degree to which each clinical and epidemiological variable participated in the compiling of profiles or groups of clinical significance in terms of similarity with or proximity to the different categories of variables, thus facilitating the incorporation of laboratory variables (infection presence/absence, parasitaemia) into these profiles’ for observing patterns57,58,59. In this way, groups were identified that had clinical significance from different groupings of categories of variables (i.e. this method was used to identify how sociodemographic characteristics and risk factors were grouped with single or multiple infections).\nTwo groups of variables were chosen for this analysis: active variables used for constructing factorial axes and supplementary or illustrative variables, which enriched factorial axes interpretation once they had been constructed58.\nSociodemographic, epidemiological and clinical variables were considered active variables, i.e. age, gender, origin, area, mosquito net and insecticide use, nearby stagnant water, fever, headache, vomiting, shivering, diarrhoea, urine colour, abdominal pain, outbreaks on the skin and previous episodes of malaria. The contribution values for each category were analysed for interpreting the axes compiled by the active variables, and the categories with a contribution value of more than 2.5 [mean contribution of 40 categories (100/40 = 2.5%)] were selected57.\nIllustrative variables were the presence/absence of P. vivax, P. falciparum and P. malariae infection and parasitaemia. Cosine values were evaluated for estimating the quality of each active variable’s representation on each axis. The test values were used to determine whether the representation of each category on each axis significantly differed from 0 (≤−2 or ≥ 2 cut-off points), thus giving an evaluation of each category’s significance57.\nThe structure and formation of each profile were analysed using a bi-dimensional graphical representation. The active variables (epidemiological and clinical variables and risk factors) were represented on each axis by filled boxes and the nominal illustrative variables (infection by each of the three species and parasitaemia) were represented by empty rhombuses. The test values sign indicated each modality’s position on the positive or negative pole of each axis. Square size was proportional to each modality’s contribution on the most representative axis. Possible dependence and similarity relationships were identified, taking into account the distance between the variables represented on the graph, regarding the categories thus represented. SPAD-5 software was used for MCA.; Electronic supplementary material\nSupplementary information; Supplementary information",
            "keywords": "Malaria; Parasite biology",
            "link": "https://www.nature.com/articles/s41598-018-23801-9",
            "organization_affiliated": "Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; PhD Programme in Biomedical and Biological Sciences, School of Medicine and Health Sciences, Universidad del Rosario, Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; Universidad de Ciencias Aplicadas y Ambientales (UDCA), Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; Masters in Epidemiology Programme, School of Medicine and Health Sciences, Universidad del Rosario, Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; School of Medicine, Universidad Nacional de Colombia, Bogotá, Colombia; Molecular Biology and Immunology Department, Fundación Instituto de Inmunología de Colombia (FIDIC), Bogotá, Colombia; Basic Sciences Department, School of Medicine and Health Sciences, Universidad del Rosario, Bogotá, Colombia",
            "pdf_link": "https://www.nature.com/articles/s41598-018-23801-9.pdf",
            "nature_source": "Scientific Reports 2018 8:1",
            "title": "Micro-epidemiology of mixed-species malaria infections in a rural population living in the Colombian Amazon region",
            "id": "c0abdd16-5c90-4ee7-a4a3-c11e54466587"
        },
        {
            "abstract": "Intergenerational rights to a healthy environment are protected by the constitutions of 74% of the world’s nations. These explicit commitments and similar, ancient principles of sovereign public trust are often overlooked but, if enforced, they offer sustainable protection for the biosphere.",
            "acquisition_date": "2020-06-07",
            "authors": "Adrian Treves; Kyle A. Artelle; Chris T. Darimont; William S. Lynn; Paul Paquet; Francisco J. Santiago-Ávila; Rance Shaw; Mary C. Wood",
            "category": "Conservation biology; Law; Policy",
            "citations": "7",
            "date": "2018-01-18",
            "doi": "10.1038/s41559-018-0465-y",
            "body": "Supplementary information\nSupplementary Information\nSupplementary data for Figs 1–3; Supplementary Information\nSupplementary data for Figs 1–3",
            "keywords": "Conservation biology; Law; Policy",
            "link": "https://www.nature.com/articles/s41559-018-0465-y",
            "organization_affiliated": "Nelson Institute for Environmental Studies, University of Wisconsin-Madison, Madison, USA; Earth to Ocean Research Group, Department of Biological Sciences, Simon Fraser University, 8888 University Drive, Burnaby, Canada; Raincoast Conservation Foundation, Sidney, Canada; Hakai Institute, Heriot Bay, Canada; Raincoast Conservation Foundation, Sidney, Canada; Hakai Institute, Heriot Bay, Canada; Department of Geography, University of Victoria, Victoria, Canada; George Perkins Marsh Institute, Clark University, Worcester, USA; Raincoast Conservation Foundation, Sidney, Canada; Hakai Institute, Heriot Bay, Canada; Nelson Institute for Environmental Studies, University of Wisconsin-Madison, Madison, USA; The Reynolds Law Firm, PC, Corvallis, USA; School of Law, University of Oregon, Eugene, USA",
            "pdf_link": "https://www.nature.com/articles/s41559-018-0465-y.pdf",
            "nature_source": "Nature Ecology & Evolution 2018 2:2",
            "title": "Intergenerational equity can help to prevent climate change and extinction",
            "id": "a7beed99-7382-4a49-9e7a-e46bd929752b"
        },
        {
            "abstract": "Infants with moderate to severe neonatal encephalopathy (NE) benefit significantly from therapeutic hypothermia, with reduced risk of death or disability. However, the need for therapeutic hypothermia for infants with milder NE remains unclear. It has been suggested that these infants should not be offered therapeutic hypothermia as they may not be at risk for adverse neurodevelopmental outcome and that the balance of risk against potential benefit is unknown. Several key questions need to be answered including first, whether one can define NE in the first 6 h after birth so as to accurately distinguish infants with brain injury who may be at risk for adverse neurodevelopmental consequences. Second, will treatment of infants with mild NE with therapeutic hypothermia improve or even worsen neurological outcomes? Although alternate treatment protocols for mild NE may be feasible, the use of the current approach combined with rigorous avoidance of hyperthermia and initiation of hypothermia as early as possible after birth may promote optimal outcomes. Animal experimental data support the potential for greater benefit for mild HIE compared with moderate to severe HIE. This review will summarize current knowledge of mild NE and the challenges to a trial in this population.",
            "acquisition_date": "2020-06-07",
            "authors": "Mohamed El-Dib; Terrie E. Inder; Lina F. Chalak; An N. Massaro; Marianne Thoresen; Alistair J. Gunn",
            "category": "Medicine/Public Health, general; Pediatrics; Pediatric Surgery",
            "citations": "7",
            "date": "2019-01-16",
            "doi": "10.1038/s41390-019-0291-1",
            "body": "Introduction\nThe management of mild neonatal encephalopathy (NE) remains controversial. Historically, infants with mild NE were believed to have minimal risk for adverse neurodevelopmental outcomes, with studies reporting outcomes very similar to controls.1,2,3 Thus, if infants had no adverse outcomes, then there was no reason for any intervention. Due to this and the potential for adverse effects of therapeutic hypothermia (TH), infants with mild NE were largely not included in the randomized controlled trials (RCTs) of TH. Because of the limited evidence of benefit from RCTs, the net risk to benefit ratio for infants with mild NE for treatment with TH remains unknown. Of concern, recent studies have shown an increased risk of mortality, brain injury, seizures, as well as adverse outcomes such as behavior problems, neurodevelopmental impairment, and lower intelligence quotient (IQ) in infants with mild NE.4 As TH has a wide margin of safety, and many centers have gained expertise and comfort using TH, there has been widespread therapeutic creep, such that many centers are now treating milder cases of NE with TH.5 Despite the safety of TH itself, TH may trigger significant shivering and apparent stress, leading to administration of sedatives that may have neurotoxic effects,6 and so could compromise any benefit of treatment. Additionally, TH is associated with separation from their parents for 3 days, delayed oral feeding and establishment of breast feeding, and, at least potentially, increased use of invasive treatments such as central lines, inotropes, antibiotics, and respiratory support. Finally, critically for targeted, accurate delivery of care, there is no consensus on the accurate definition of mild NE within the first 6 h after birth.5,7\nIn April 2018, an expert panel met at the annual Neonatal Neurocritical Care Special Interest Group (www.NNCC-SIG.org) meeting to examine the evidence for considering TH for mild NE. In this article, the panel will review the topic in detail, addressing factors related to (a) neurodevelopmental outcomes in mild NE as evidence of the need to consider treatment; (b) current practices in mild NE; (c) existing preclinical evidence that mild NE could benefit from TH; (d) the definition of mild NE; and (e) a proposed framework for a possible RCT for mild NE.; The management of mild neonatal encephalopathy (NE) remains controversial. Historically, infants with mild NE were believed to have minimal risk for adverse neurodevelopmental outcomes, with studies reporting outcomes very similar to controls.1,2,3 Thus, if infants had no adverse outcomes, then there was no reason for any intervention. Due to this and the potential for adverse effects of therapeutic hypothermia (TH), infants with mild NE were largely not included in the randomized controlled trials (RCTs) of TH. Because of the limited evidence of benefit from RCTs, the net risk to benefit ratio for infants with mild NE for treatment with TH remains unknown. Of concern, recent studies have shown an increased risk of mortality, brain injury, seizures, as well as adverse outcomes such as behavior problems, neurodevelopmental impairment, and lower intelligence quotient (IQ) in infants with mild NE.4 As TH has a wide margin of safety, and many centers have gained expertise and comfort using TH, there has been widespread therapeutic creep, such that many centers are now treating milder cases of NE with TH.5 Despite the safety of TH itself, TH may trigger significant shivering and apparent stress, leading to administration of sedatives that may have neurotoxic effects,6 and so could compromise any benefit of treatment. Additionally, TH is associated with separation from their parents for 3 days, delayed oral feeding and establishment of breast feeding, and, at least potentially, increased use of invasive treatments such as central lines, inotropes, antibiotics, and respiratory support. Finally, critically for targeted, accurate delivery of care, there is no consensus on the accurate definition of mild NE within the first 6 h after birth.5,7\nIn April 2018, an expert panel met at the annual Neonatal Neurocritical Care Special Interest Group (www.NNCC-SIG.org) meeting to examine the evidence for considering TH for mild NE. In this article, the panel will review the topic in detail, addressing factors related to (a) neurodevelopmental outcomes in mild NE as evidence of the need to consider treatment; (b) current practices in mild NE; (c) existing preclinical evidence that mild NE could benefit from TH; (d) the definition of mild NE; and (e) a proposed framework for a possible RCT for mild NE.; Evidence that mild NE is associated with worse neurodevelopmental outcome\nIn the pre-hypothermia era, the Sarnat neurological staging system was used serially over the first week after birth to define the severity of NE. During the TH era, the Sarnat staging system including neurological examination and formal electroencephalogram (EEG) from 24 h onwards, was shifted in its application to use only the clinical examination within 6 h of birth, much earlier than originally proposed, to align with the known limited therapeutic window of TH. Moreover, we should also note that after 2006 there was a transition to the Bayley III edition to define neurodevelopmental outcomes.8 It is essential to appreciate these changes in the definition of mild NE (related to the timing of evaluation) and of the developmental outcomes in order to interpret the outcomes mild NE.; In the pre-hypothermia era, the Sarnat neurological staging system was used serially over the first week after birth to define the severity of NE. During the TH era, the Sarnat staging system including neurological examination and formal electroencephalogram (EEG) from 24 h onwards, was shifted in its application to use only the clinical examination within 6 h of birth, much earlier than originally proposed, to align with the known limited therapeutic window of TH. Moreover, we should also note that after 2006 there was a transition to the Bayley III edition to define neurodevelopmental outcomes.8 It is essential to appreciate these changes in the definition of mild NE (related to the timing of evaluation) and of the developmental outcomes in order to interpret the outcomes mild NE.; Pre-hypothermia era outcomes\nRobertson et al. evaluated the outcome of term infants at 3.5 years of age (n = 69) and reported that none of the infants with mild NE had a major handicap, defined by cerebral palsy, visual impairment, or cognitive delay. The Stanford-Binet Intelligence Scale was 101.5 (±14.0) and the intelligence score using Peabody Picture Vocabulary Test was 104.1 (±13.7).1 At 8 years of age, school performance of the children with mild NE was similar to the control children.2 Subsequently, Van Handel and colleagues prospectively examined the effects of mild NE (n = 34) on behavioral function at 9–10 years of age. The IQ was 98.1 ± 12.3 (mean ± standard deviation (SD)) in children with mild NE compared to 109 ± 12 in control children. The authors reported that social and attention problems scores were higher among children with mild NE.9 From today’s perspective, the major limitation is that the original full Sarnat assessment consisted of serial evaluations including EEG, which were repeated over several days, and so this is likely to represent a different cohort than in modern studies where infants are identified within 6 h of birth.\nOdd and colleagues evaluated cognitive function at 8 years of age among children who were resuscitated after birth with or without NE. They found higher odds of lower IQ score in resuscitated children without NE (odds ratio 1.65 [95% confidence interval (CI) 1.13–2.43]) but the greatest difference was seen in infants who also developed NE (odds ratio 6.22 [1.57–24.65]).10 The limitations of this study are that the neonatal records were assessed in retrospect to identify NE, and while cognitive testing was obtained as part of a prospective longitudinal study, 48% of eligible infants did not attend for testing. Murray et al. evaluated the cognitive outcome at 5 years of age of 22 infants with mild NE and reported lower full-scale IQ than normal controls [99 (94–112) vs. 117 (110–124), p = 0.001], verbal IQ [105 (99–111) vs. 116 (112–125), p = 0.001], and performance IQ [103 (98–112) vs. 115 (107–124), p = 0.004].11\nA recent systematic review identified 20 studies that included infants with mild NE. The studies from before the hypothermia era reported retrospectively on long-term outcomes in 250 children following mild NE. The criteria for NE were variable and often not well defined. That review reported that abnormal outcome, defined as the presence of cerebral palsy or any standardized neurodevelopmental test score more than 1 SD below the mean at 18 months of age or older, occurred in 56 (22%) of children following mild NE.4; Robertson et al. evaluated the outcome of term infants at 3.5 years of age (n = 69) and reported that none of the infants with mild NE had a major handicap, defined by cerebral palsy, visual impairment, or cognitive delay. The Stanford-Binet Intelligence Scale was 101.5 (±14.0) and the intelligence score using Peabody Picture Vocabulary Test was 104.1 (±13.7).1 At 8 years of age, school performance of the children with mild NE was similar to the control children.2 Subsequently, Van Handel and colleagues prospectively examined the effects of mild NE (n = 34) on behavioral function at 9–10 years of age. The IQ was 98.1 ± 12.3 (mean ± standard deviation (SD)) in children with mild NE compared to 109 ± 12 in control children. The authors reported that social and attention problems scores were higher among children with mild NE.9 From today’s perspective, the major limitation is that the original full Sarnat assessment consisted of serial evaluations including EEG, which were repeated over several days, and so this is likely to represent a different cohort than in modern studies where infants are identified within 6 h of birth.\nOdd and colleagues evaluated cognitive function at 8 years of age among children who were resuscitated after birth with or without NE. They found higher odds of lower IQ score in resuscitated children without NE (odds ratio 1.65 [95% confidence interval (CI) 1.13–2.43]) but the greatest difference was seen in infants who also developed NE (odds ratio 6.22 [1.57–24.65]).10 The limitations of this study are that the neonatal records were assessed in retrospect to identify NE, and while cognitive testing was obtained as part of a prospective longitudinal study, 48% of eligible infants did not attend for testing. Murray et al. evaluated the cognitive outcome at 5 years of age of 22 infants with mild NE and reported lower full-scale IQ than normal controls [99 (94–112) vs. 117 (110–124), p = 0.001], verbal IQ [105 (99–111) vs. 116 (112–125), p = 0.001], and performance IQ [103 (98–112) vs. 115 (107–124), p = 0.004].11\nA recent systematic review identified 20 studies that included infants with mild NE. The studies from before the hypothermia era reported retrospectively on long-term outcomes in 250 children following mild NE. The criteria for NE were variable and often not well defined. That review reported that abnormal outcome, defined as the presence of cerebral palsy or any standardized neurodevelopmental test score more than 1 SD below the mean at 18 months of age or older, occurred in 56 (22%) of children following mild NE.4; Hypothermia era outcomes\nFour RCTs of TH for moderate or severe neonatal NE enrolled infants with mild NE even though the studies were not powered or designed to target mild NE. Jacobs et al. tested whole-body hypothermia in moderate to severe NE but also allowed the inclusion of mild NE (n = 40). Among infants with mild NE receiving standard care, the rate of death or major sensorineural disability was 33% (8/24) compared with 25% (4/16) in hypothermic infants (relative risk 0.53, 95% CI 0.17–1.66).12 Zhou et al. evaluated the role of selective head cooling among infants with moderate or severe NE (n = 194) and included cases with mild NE (n = 39). Abnormal outcomes occurred in 6 cooled and 7 controls with mild NE.13 Battin et al. enrolled a total of 9 infants with mild NE (5 cooled and 4 control) and reported abnormal outcomes in 1 cooled and 2 controls.14 The CoolCap trial enrolled 8 infants with mild NE (5 cooled and 3 controls) and found unfavorable outcomes in 2 cooled and 0 control infants.15 Of note, the initial amplitude integrated EEG (aEEG) patterns of all 8 mild cases of NE showed moderately or severely abnormal background voltage inferring that the clinical assessment of Sarnat grade I is subjective and challenging on clinical evaluation alone. The RCT studies were summarized reporting an abnormal outcome in 29% of cooled vs. 37% of uncooled infants with mild NE, an odds ratio of 0.67 (95% CI: 0.28–1.61, p = 0.59). While there was a trend for benefit in favor of TH, none of these studies were powered to detect a clinical effect in mild NE.4; Four RCTs of TH for moderate or severe neonatal NE enrolled infants with mild NE even though the studies were not powered or designed to target mild NE. Jacobs et al. tested whole-body hypothermia in moderate to severe NE but also allowed the inclusion of mild NE (n = 40). Among infants with mild NE receiving standard care, the rate of death or major sensorineural disability was 33% (8/24) compared with 25% (4/16) in hypothermic infants (relative risk 0.53, 95% CI 0.17–1.66).12 Zhou et al. evaluated the role of selective head cooling among infants with moderate or severe NE (n = 194) and included cases with mild NE (n = 39). Abnormal outcomes occurred in 6 cooled and 7 controls with mild NE.13 Battin et al. enrolled a total of 9 infants with mild NE (5 cooled and 4 control) and reported abnormal outcomes in 1 cooled and 2 controls.14 The CoolCap trial enrolled 8 infants with mild NE (5 cooled and 3 controls) and found unfavorable outcomes in 2 cooled and 0 control infants.15 Of note, the initial amplitude integrated EEG (aEEG) patterns of all 8 mild cases of NE showed moderately or severely abnormal background voltage inferring that the clinical assessment of Sarnat grade I is subjective and challenging on clinical evaluation alone. The RCT studies were summarized reporting an abnormal outcome in 29% of cooled vs. 37% of uncooled infants with mild NE, an odds ratio of 0.67 (95% CI: 0.28–1.61, p = 0.59). While there was a trend for benefit in favor of TH, none of these studies were powered to detect a clinical effect in mild NE.4; Contemporary outcomes of untreated mild NE\nThe PRIME Study (Prospective Research in Infants with Mild Encephalopathy) recently enrolled 54 infants with rigorously defined mild NE in the first 6 h after birth and reported neonatal intensive care unit (NICU) discharge outcomes of infants7 and neurodevelopmental follow-up.16 In that study, mild NE was defined as the presence of the National Institute of Child Health and Human Development (NICHD) criteria for evidence of hypoxia-ischemia during the perinatal period (the same as used in previous NICHD clinical trials) and ≥1 abnormality using the modified Sarnat criteria (but no evidence of three abnormal categories defining moderate or severe NE). This is the only recent study to date providing 18–24 months’ outcomes prospectively using Bayley III assessment in a contemporary cohort of untreated infants with mild NE. Forty-three infants completed the full neurodevelopmental follow-up testing (of 63 infants enrolled and 51 infants who were reviewed at a mean of 19 months), 7 (16%) had disability, including 1 (2%) infant with cerebral palsy, and 2 (5%) who had autism. Bayley III scores < 85 were documented in 17 infants (40%): 14 (32%) language domain, 7 (16%) cognitive domain, and 6 (14%) in the motor domain. The 16% rate of disability after mild NE, and 40% with Bayley III scores < 85 is higher than would be expected for infants who did not have NE, but lower than reported in moderate to severe encephalopathy.17\nInterestingly, in a recent prospective multicenter cohort study of magnetic resonance spectroscopy assessment of brain injury in NE,18 of 30 infants with mild NE, all of whom were treated with TH, just 1 infant developed disability, and 20 had mild white matter injury on formal magnetic resonance imaging (MRI) assessment. Although this study was not controlled, these results are very encouraging for potential benefit of TH in this population.\nIn older studies, before the era of hypothermia, the severity of NE was defined in retrospect. For treatment, it is essential to define NE prospectively as early as possible in the first 6 h after birth, in a phase when the severity of neurological findings often changes over time. Thus, the large RCTs of TH excluded infants who had mild NE as assessed in the first 6 h after birth in order to improve their trial power since these infants were less likely to have an unfavorable outcome. This means that the real world clinical benefits of treating these infants with TH are unknown. Moreover, it is important to appreciate that in absence of TH, the severity of clinical signs of NE often increases over the first 2–3 days after birth19,20 and that the original Sarnat and Sarnat classification, was based on retrospective assessment of neurological progress over the first week plus multimodal assessment, typically including formal EEG and imaging. Thus, potentially, some infants with observed disability after “mild” NE identified within 6 h of birth in contemporary prospective studies like the PRIME study may have been classified in the pre-hypothermia era as “moderate”.; The PRIME Study (Prospective Research in Infants with Mild Encephalopathy) recently enrolled 54 infants with rigorously defined mild NE in the first 6 h after birth and reported neonatal intensive care unit (NICU) discharge outcomes of infants7 and neurodevelopmental follow-up.16 In that study, mild NE was defined as the presence of the National Institute of Child Health and Human Development (NICHD) criteria for evidence of hypoxia-ischemia during the perinatal period (the same as used in previous NICHD clinical trials) and ≥1 abnormality using the modified Sarnat criteria (but no evidence of three abnormal categories defining moderate or severe NE). This is the only recent study to date providing 18–24 months’ outcomes prospectively using Bayley III assessment in a contemporary cohort of untreated infants with mild NE. Forty-three infants completed the full neurodevelopmental follow-up testing (of 63 infants enrolled and 51 infants who were reviewed at a mean of 19 months), 7 (16%) had disability, including 1 (2%) infant with cerebral palsy, and 2 (5%) who had autism. Bayley III scores < 85 were documented in 17 infants (40%): 14 (32%) language domain, 7 (16%) cognitive domain, and 6 (14%) in the motor domain. The 16% rate of disability after mild NE, and 40% with Bayley III scores < 85 is higher than would be expected for infants who did not have NE, but lower than reported in moderate to severe encephalopathy.17\nInterestingly, in a recent prospective multicenter cohort study of magnetic resonance spectroscopy assessment of brain injury in NE,18 of 30 infants with mild NE, all of whom were treated with TH, just 1 infant developed disability, and 20 had mild white matter injury on formal magnetic resonance imaging (MRI) assessment. Although this study was not controlled, these results are very encouraging for potential benefit of TH in this population.\nIn older studies, before the era of hypothermia, the severity of NE was defined in retrospect. For treatment, it is essential to define NE prospectively as early as possible in the first 6 h after birth, in a phase when the severity of neurological findings often changes over time. Thus, the large RCTs of TH excluded infants who had mild NE as assessed in the first 6 h after birth in order to improve their trial power since these infants were less likely to have an unfavorable outcome. This means that the real world clinical benefits of treating these infants with TH are unknown. Moreover, it is important to appreciate that in absence of TH, the severity of clinical signs of NE often increases over the first 2–3 days after birth19,20 and that the original Sarnat and Sarnat classification, was based on retrospective assessment of neurological progress over the first week plus multimodal assessment, typically including formal EEG and imaging. Thus, potentially, some infants with observed disability after “mild” NE identified within 6 h of birth in contemporary prospective studies like the PRIME study may have been classified in the pre-hypothermia era as “moderate”.; Hypothermia for mild NE: therapeutic creep\nDespite the exclusion of infants with mild NE from most hypothermia trials, therapeutic creep has been observed, so that TH has been extended to babies with mild NE in many NICUs. Reports from single centers as well as multicenter registries in the post-hypothermia era highlight the recognition by the clinical community that infants with mild NE are at risk for adverse outcomes. While it is not possible to be certain of the reasons behind this change, the use of TH in this population may reflect clinicians’ assumption that TH must also be beneficial for mild NE, but also might reflect medicolegal concerns or misdiagnosis.\nA report from McGill University in Canada described that among the 215 infants referred for cooling between 2008 and 2012, 79 (36%) had mild NE, of whom 13 (16%) were cooled.21 In these 13 infants, TH was initiated based on amplitude integrated EEG findings consistent with moderate encephalopathy, despite mild staging based on neurological exam. Brain MRI was available in 50 non-cooled and all cooled infants. Infants who were not cooled had higher frequency of MRI-defined brain injury than patients who were cooled (40% vs. 31%). In another single-center report, Walsh et al. reported brain MRI findings for infants with encephalopathy treated with hypothermia at the Brigham and Women’s Hospital between 2013 and 2015, based on institutional criteria that included cooling infants who were >34 weeks gestational age, with pH ≤ 7.1, base deficit (BD) ≥ 12 mEq/L, and any stage of NE.22 Of the 64 cooled infants, 33 (51.5%) had mild NE. Almost 30% of these infants with mild NE had features of moderate/severe brain injury on MRI and a similar rate of MRI injury to infants with moderate NE. However, neurodevelopmental outcome at 2 years of age is unknown.\nData registries also provide evidence of therapeutic creep across centers. Data from the Vermont Oxford Network Neonatal Encephalopathy Registry (2006–2011) revealed that amongst 2457 enrolled cases from 99 centers, only 57% met standard eligibility criteria used in the randomized trials. Of the infants who did not meet eligibility criteria for cooling, 40% had neither moderate to severe NE nor seizures before initiation of hypothermia.23 Azzopardi and colleagues reported data from the TOBY registry (2006–2011) that include over 2000 registered cases of NE treated with hypothermia in the United Kingdom.24 Of the 513 cases that had Thompson encephalopathy score data recorded before initiation of cooling, lower scores (0–5) consistent with mild NE were recorded in 91 (18%) infants. Kracer and colleagues reported the use of TH for NE in the state of California using the California Perinatal Quality Care Collaborative and California Perinatal Transport System 2010–2012 datasets.25 Of 829 cases with NE, 237 (28.5%) were mild. Overall, 50% of neonates with mild NE were treated with hypothermia, with an increasing trend over time (38% in 2010, 53% in 2011, and 55% in 2012). In the most recent registry report from 27 regional NICUs in the United States, the Children’s Hospital Neonatal Consortium reported short-term outcomes of infants with NE born between 2010 and 2013.26 Of the 945 infants with NE, 160 cases were mild. The majority (76%) received hypothermia, and brain MRI was normal in only 41% of cases of mild NE. Unfortunately, there are no neurodevelopmental outcome data in these registry cohorts. There is significant variation between MRI scoring systems and unless documented with outcome one cannot assume that mild-moderate changes on the MRI necessarily denotes poor outcome.27\nThese reports reflect the recognition that babies with mild NE assessed in the first 6 h after birth are at risk for adverse outcomes and that many clinicians, nationally and internationally, have adopted the practice of extending TH on a clinical basis to this population. These reports also highlight the potential for lack of equipoise in the clinical community that will need to be considered to support future therapeutic trials aimed to improve outcomes in babies with mild NE.; Despite the exclusion of infants with mild NE from most hypothermia trials, therapeutic creep has been observed, so that TH has been extended to babies with mild NE in many NICUs. Reports from single centers as well as multicenter registries in the post-hypothermia era highlight the recognition by the clinical community that infants with mild NE are at risk for adverse outcomes. While it is not possible to be certain of the reasons behind this change, the use of TH in this population may reflect clinicians’ assumption that TH must also be beneficial for mild NE, but also might reflect medicolegal concerns or misdiagnosis.\nA report from McGill University in Canada described that among the 215 infants referred for cooling between 2008 and 2012, 79 (36%) had mild NE, of whom 13 (16%) were cooled.21 In these 13 infants, TH was initiated based on amplitude integrated EEG findings consistent with moderate encephalopathy, despite mild staging based on neurological exam. Brain MRI was available in 50 non-cooled and all cooled infants. Infants who were not cooled had higher frequency of MRI-defined brain injury than patients who were cooled (40% vs. 31%). In another single-center report, Walsh et al. reported brain MRI findings for infants with encephalopathy treated with hypothermia at the Brigham and Women’s Hospital between 2013 and 2015, based on institutional criteria that included cooling infants who were >34 weeks gestational age, with pH ≤ 7.1, base deficit (BD) ≥ 12 mEq/L, and any stage of NE.22 Of the 64 cooled infants, 33 (51.5%) had mild NE. Almost 30% of these infants with mild NE had features of moderate/severe brain injury on MRI and a similar rate of MRI injury to infants with moderate NE. However, neurodevelopmental outcome at 2 years of age is unknown.\nData registries also provide evidence of therapeutic creep across centers. Data from the Vermont Oxford Network Neonatal Encephalopathy Registry (2006–2011) revealed that amongst 2457 enrolled cases from 99 centers, only 57% met standard eligibility criteria used in the randomized trials. Of the infants who did not meet eligibility criteria for cooling, 40% had neither moderate to severe NE nor seizures before initiation of hypothermia.23 Azzopardi and colleagues reported data from the TOBY registry (2006–2011) that include over 2000 registered cases of NE treated with hypothermia in the United Kingdom.24 Of the 513 cases that had Thompson encephalopathy score data recorded before initiation of cooling, lower scores (0–5) consistent with mild NE were recorded in 91 (18%) infants. Kracer and colleagues reported the use of TH for NE in the state of California using the California Perinatal Quality Care Collaborative and California Perinatal Transport System 2010–2012 datasets.25 Of 829 cases with NE, 237 (28.5%) were mild. Overall, 50% of neonates with mild NE were treated with hypothermia, with an increasing trend over time (38% in 2010, 53% in 2011, and 55% in 2012). In the most recent registry report from 27 regional NICUs in the United States, the Children’s Hospital Neonatal Consortium reported short-term outcomes of infants with NE born between 2010 and 2013.26 Of the 945 infants with NE, 160 cases were mild. The majority (76%) received hypothermia, and brain MRI was normal in only 41% of cases of mild NE. Unfortunately, there are no neurodevelopmental outcome data in these registry cohorts. There is significant variation between MRI scoring systems and unless documented with outcome one cannot assume that mild-moderate changes on the MRI necessarily denotes poor outcome.27\nThese reports reflect the recognition that babies with mild NE assessed in the first 6 h after birth are at risk for adverse outcomes and that many clinicians, nationally and internationally, have adopted the practice of extending TH on a clinical basis to this population. These reports also highlight the potential for lack of equipoise in the clinical community that will need to be considered to support future therapeutic trials aimed to improve outcomes in babies with mild NE.; Preclinical evidence of role of hypothermia in mild NE\nExperimentally, the efficacy of neuroprotection with hypothermia is highly related both to the severity and nature of the insult and to the timing of initiation of cooling, its duration, and its depth.28 These factors interact in complex ways to determine the outcome of any particular regime. After moderate to severe HI, optimal outcomes in humans and large animals are seen with a reduction in brain temperature of approximately 33.5 °C, induced as early as possible within the first 6 h after birth and continued for 72 h.28 At present, the minimum duration of treatment for any given period of hypoxia-ischemia (HI) can only be determined empirically and there is little direct evidence for the optimal parameters for mild HI. Overall, as discussed next, the available animal evidence suggests that TH after mild injury is likely to show even better relative neuroprotection than after moderate to severe HI, if TH is applied within the same 6 h time window, depth (33.5 °C), and duration (72 h) as the current recommended cooling protocol.; Experimentally, the efficacy of neuroprotection with hypothermia is highly related both to the severity and nature of the insult and to the timing of initiation of cooling, its duration, and its depth.28 These factors interact in complex ways to determine the outcome of any particular regime. After moderate to severe HI, optimal outcomes in humans and large animals are seen with a reduction in brain temperature of approximately 33.5 °C, induced as early as possible within the first 6 h after birth and continued for 72 h.28 At present, the minimum duration of treatment for any given period of hypoxia-ischemia (HI) can only be determined empirically and there is little direct evidence for the optimal parameters for mild HI. Overall, as discussed next, the available animal evidence suggests that TH after mild injury is likely to show even better relative neuroprotection than after moderate to severe HI, if TH is applied within the same 6 h time window, depth (33.5 °C), and duration (72 h) as the current recommended cooling protocol.; What does mild HI injury look like in experimental models?\nThe impact of HI around term on different areas of the brain is a function both of the nature of the insult and the susceptibility of different brain regions.29 Broadly speaking, injury often follows basal ganglia or watershed predominant patterns. In fetal sheep, a watershed pattern is seen in multiple models, including pure cerebral ischemia,30 prolonged partial umbilical cord occlusion,31,32,33 and repeated brief cord occlusion.34 By contrast, basal ganglia and thalamic damage is clinically associated with more severe or “sentinel” events at birth.35 Consistent with this, in near-term fetal sheep this pattern is seen after prolonged complete umbilical cord occlusion.36\nWithin these models of HI injury, it is notable that short insults such as 10 min of cerebral ischemia and the same duration of complete umbilical cord occlusion are associated with highly selective hippocampal injury, particularly affecting the cornu ammonis regions 3 and 1/2.37,38 Both insults lead to a highly similar pattern of transient suppression of EEG activity and few or no secondary electrographic seizures. As the insults are continued for longer, more regions are affected, and seizures become more prominent. Twenty minutes of cerebral ischemia leads to profound hippocampal damage and moderate injury of the parasagittal cortex, followed by marked but discrete secondary seizures, and 30 min leads to parasagittal laminar necrosis and delayed onset of status epilepticus.38 Umbilical cord occlusion continued until fetal arterial blood pressure was <8 mm Hg was associated with severe basal ganglia damage and all fetuses developed seizures, including status epilepticus in approximately half.36 These patterns, seen across multiple models, suggest that predominantly hippocampal damage will be seen after mild HI without significant delayed seizures, whereas thalamic or cortical damage with multiple electrographic seizures are features of moderate to severe injury.; The impact of HI around term on different areas of the brain is a function both of the nature of the insult and the susceptibility of different brain regions.29 Broadly speaking, injury often follows basal ganglia or watershed predominant patterns. In fetal sheep, a watershed pattern is seen in multiple models, including pure cerebral ischemia,30 prolonged partial umbilical cord occlusion,31,32,33 and repeated brief cord occlusion.34 By contrast, basal ganglia and thalamic damage is clinically associated with more severe or “sentinel” events at birth.35 Consistent with this, in near-term fetal sheep this pattern is seen after prolonged complete umbilical cord occlusion.36\nWithin these models of HI injury, it is notable that short insults such as 10 min of cerebral ischemia and the same duration of complete umbilical cord occlusion are associated with highly selective hippocampal injury, particularly affecting the cornu ammonis regions 3 and 1/2.37,38 Both insults lead to a highly similar pattern of transient suppression of EEG activity and few or no secondary electrographic seizures. As the insults are continued for longer, more regions are affected, and seizures become more prominent. Twenty minutes of cerebral ischemia leads to profound hippocampal damage and moderate injury of the parasagittal cortex, followed by marked but discrete secondary seizures, and 30 min leads to parasagittal laminar necrosis and delayed onset of status epilepticus.38 Umbilical cord occlusion continued until fetal arterial blood pressure was <8 mm Hg was associated with severe basal ganglia damage and all fetuses developed seizures, including status epilepticus in approximately half.36 These patterns, seen across multiple models, suggest that predominantly hippocampal damage will be seen after mild HI without significant delayed seizures, whereas thalamic or cortical damage with multiple electrographic seizures are features of moderate to severe injury.; More severe insults lead to more rapid evolution of programmed cell death\nProgrammed cell death, involving activation of multiple pathways, including programmed necrosis, apoptotic, and autophagy, plays a key role in the delayed evolution of HI injury after resuscitation.28 Data support that the initiation of neuronal degeneration occurs more slowly after a shorter, less severe period of HI compared with severe insults leading to infarction.39 The reader should note that DNA fragmentation and classic ischemic cell change represent the terminal events of this cascade and so their appearance only means that cell death is now irreversible.; Programmed cell death, involving activation of multiple pathways, including programmed necrosis, apoptotic, and autophagy, plays a key role in the delayed evolution of HI injury after resuscitation.28 Data support that the initiation of neuronal degeneration occurs more slowly after a shorter, less severe period of HI compared with severe insults leading to infarction.39 The reader should note that DNA fragmentation and classic ischemic cell change represent the terminal events of this cascade and so their appearance only means that cell death is now irreversible.; Early initiation of cooling after hypoxia-ischemia\nConsistent with the evidence of slow evolution of programmed cell death in milder insults, early initiation of cooling after brief ischemia in adult rodents was highly protective. For example, after 3 min of cerebral ischemia in adult gerbils, cooling to 32 °C for 12 h that was initiated at 1 h, attenuated abnormal open field behavior and substantially reduced CA1 necrosis at 10 and 30 days, but was only partially effective after 5 min of occlusion.40 By contrast, extending the duration of hypothermia to 24 h provided near total protection after 5 min of ischemia. Learning in an open field and T-maze were improved by hypothermia after 6 months recovery.41 Moreover, in adult gerbils, when the delay before initiating a 24 h period of cooling was increased from 1 to 4 h after ischemia, neuroprotection in the CA1 field of the hippocampus after 6 months of recovery fell from 70 to 12%.41 However, neuroprotection was almost completely restored by extending the interval of moderate hypothermia (a reduction in body temperature of up to 5 °C) to 48 h or more, even when the start of cooling was delayed until 6 h after reperfusion.42\nSimilarly, in 7-day-old rat pups, hypothermia was found to be notably protective after a “moderate” duration of HI (90 min),43 such that immediate induction of hypothermia after moderate HI significantly reduced the area of cortical infarction (P < 0.05), with a linear loss of effect with greater delay in starting cooling, at least up to 6 h of delay. By contrast, even immediate hypothermia did not improve outcomes after very prolonged HI (150 min).\nIt is important to contrast the finding of neuroprotection with a relatively short duration of just 6 h of moderate hypothermia in P7 rats44 but not in older rodents or large animals.45 Potentially, the apparent protection with such a short duration of TH might reflect more rapid rate of brain development in rodents than larger animals. A more likely explanation is that rectal temperatures of healthy nesting neonatal rats in the vivarium are significantly lower than in later life (median of 35.4 °C at P7 vs. ~38 °C in adults).46,47 Thus, P7 rats may be exposed to continuing mild hypothermia after the acute study period, and so the exact duration of hypothermia cannot be compared with human or large animal studies or adult rodent studies with rigorous temperature control.\nIt is important to appreciate that these experimental protocols do not, and are not intended to, reflect the complex nature of human NE. Keeping this caveat in mind, these findings as a whole support that early treatment of infants with milder HIE with TH applied in the most effective manner using the current approach is likely to be effective.; Consistent with the evidence of slow evolution of programmed cell death in milder insults, early initiation of cooling after brief ischemia in adult rodents was highly protective. For example, after 3 min of cerebral ischemia in adult gerbils, cooling to 32 °C for 12 h that was initiated at 1 h, attenuated abnormal open field behavior and substantially reduced CA1 necrosis at 10 and 30 days, but was only partially effective after 5 min of occlusion.40 By contrast, extending the duration of hypothermia to 24 h provided near total protection after 5 min of ischemia. Learning in an open field and T-maze were improved by hypothermia after 6 months recovery.41 Moreover, in adult gerbils, when the delay before initiating a 24 h period of cooling was increased from 1 to 4 h after ischemia, neuroprotection in the CA1 field of the hippocampus after 6 months of recovery fell from 70 to 12%.41 However, neuroprotection was almost completely restored by extending the interval of moderate hypothermia (a reduction in body temperature of up to 5 °C) to 48 h or more, even when the start of cooling was delayed until 6 h after reperfusion.42\nSimilarly, in 7-day-old rat pups, hypothermia was found to be notably protective after a “moderate” duration of HI (90 min),43 such that immediate induction of hypothermia after moderate HI significantly reduced the area of cortical infarction (P < 0.05), with a linear loss of effect with greater delay in starting cooling, at least up to 6 h of delay. By contrast, even immediate hypothermia did not improve outcomes after very prolonged HI (150 min).\nIt is important to contrast the finding of neuroprotection with a relatively short duration of just 6 h of moderate hypothermia in P7 rats44 but not in older rodents or large animals.45 Potentially, the apparent protection with such a short duration of TH might reflect more rapid rate of brain development in rodents than larger animals. A more likely explanation is that rectal temperatures of healthy nesting neonatal rats in the vivarium are significantly lower than in later life (median of 35.4 °C at P7 vs. ~38 °C in adults).46,47 Thus, P7 rats may be exposed to continuing mild hypothermia after the acute study period, and so the exact duration of hypothermia cannot be compared with human or large animal studies or adult rodent studies with rigorous temperature control.\nIt is important to appreciate that these experimental protocols do not, and are not intended to, reflect the complex nature of human NE. Keeping this caveat in mind, these findings as a whole support that early treatment of infants with milder HIE with TH applied in the most effective manner using the current approach is likely to be effective.; How should we define mild NE?\nAlthough mild NE is commonly cited, the exact definition of mild NE is variable. In addition, in mild NE, as in all forms of NE, we cannot be absolutely sure of the underlying etiology of the NE, which may be more complex than just HI and so might not benefit from TH. For example, there is some evidence that TH may be less helpful in infants with preceding infection/inflammation.48,49 Nevertheless, others reported, in a retrospective cohort study of 1084 infants treated with TH for NE, that the majority of 42 infants with NE and early-onset sepsis had a favorable outcome.50 As we consider trials of TH in infants with milder NE, our aim should be to correctly identify infants with brain injury from hypoxia-ischemia who may benefit most from TH. On the other hand, we must not ignore or downplay the stress of being hypothermic, the multiple interventions associated with intensive care including sedation, respiratory support, intravenous lines, blood pressure support, antibiotics, separation from parents for at least 3 days, and delayed oral feeding to more mildly affected infants since such interventions could have net adverse effects.\nTo assist in defining the presence of mild NE, particularly associated with evidence of hypoxia and ischemia, an array of markers may assist. While neurological clinical examination is the cornerstone for the classification of the presence and severity of NE,19,20 this approach has notable limitations. The neurological state is dynamic and may evolve over hours, and so a baby with an early normal examination may evolve over a few hours of age into mild NE while a baby with mild NE may evolve into more moderate NE.51,52 Although the Sarnat clinical criteria are widely used, another neurological scoring system, the Thompson score has been used in clinical trials for infant selection.53,54 In addition, because of the changes over time of the neurological examination, timed and standardized clinical evaluation will help strengthen its validity,20,55,56 and videotaping of the examination may be valuable for training and quality control.55,56\nStandard biochemical markers\nStandard biochemical markers of acid-base, including pH and BD, have been traditionally used to assess the severity of perinatal HI. The earliest metabolic or circulatory sign of reduced delivery of oxygen and substrate to the brain is reduced cardiac output leading to hypotension, and so reduced cerebral blood flow (CBF). In the adult brain, a fall in CBF of 30% is associated with reduced protein synthesis in the brain.57 When CBF is reduced by 40–50%, sensory evoked potentials and EEG power are progressively suppressed. Reduced ATP and anoxic depolarization with cytotoxic edema develop when CBF is reduced by >70–90%—from that time to cell death is relatively short, as the ion pumps stop working. Standard biochemical changes following energy deprivation, inflammation, or generalized stress measurable in plasma include acidosis, lactate, glucose, C-reactive protein (CRP), lactate dehydrogenase (LDH), and more. Current cutoff values used as entry criteria for cooling therapy ranged from <7.0 to 7.15 for pH and >10 to 16 mmol/L for BD. However, the values used as significant criteria in the major RCTs were pH < 7.0 and BD ≥ 16. It has been suggested that a cutoff of pH ≤ 7.1 would be more sensitive in detecting infants with NE,58 but at the cost of increasing the number of infants who would need to be formally examined for some hours after birth. In that study 25 infants with pH between 7.0 and ≤7.1 needed to be screened to identify one additional infant with moderate to severe NE who would otherwise have been missed, representing a 15% increase in infants correctly selected for treatment.58 The impact of a higher pH threshold on screening for mild NE is unknown but it is plausible that less severe acidosis would capture a higher proportion of infants with milder NE.\nThe peak CRP value associated with NE has been shown to be delayed by 36 h and to stay high for longer in cooled babies.59 Cooling itself increases CRP without any documented infection, as a nonspecific response to stress, just as CRP is slightly increased after surgery. Therefore, cooled infants tend to receive antibiotics for a longer period than standard care babies. Nevertheless, high CRP levels are associated with neonatal sepsis.60\nFinally, LDH levels measured within 6 h after birth in infants with NE discriminated between acute and nonacute perinatal HI.61 Moreover, increased LDH levels were associated with worse neurodevelopmental outcome at 18–24 months of age.62\nMore specific potential biomarkers\nMore specific potential biomarkers of neurological injury have been suggested including neuron-specific enolase, myelin basic protein, S-100β, glial fibrillary acidic protein, ubiquitin carboxyl-terminal hydrolase-L1, brain-derived neurotrophic factor, cleaved Tau, microRNA-21, and activin. Other categories of biomarkers include vascular markers, e.g. vascular endothelial growth factor; oxidative stress markers e.g., superoxide dismutase; inflammatory markers such as high-sensitivity CRP, interleukins, and tumor necrosis factor-α, as well as exosomes. Details of these biomarkers are described elsewhere.63,64 The sensitivity and specificity of using these markers or combinations of them to select babies with mild NE for cooling are not yet known and these biomarkers have not been validated in large cohorts.\nAmplitude integrated EEG\naEEG is a widely available real-time continuous cotside marker that displays brain activity and its changes over time. In Europe, the technique has been in routine use for infants with NE for 25 years. The background aEEG amplitude and pattern within 6 h of age are strong predictors of later neurodevelopmental outcomes in normothermic children with perinatal NE.65,66 In the setting of TH, early (<6 h) aEEG has limited positive predictive value (PPV). Thus, early aEEG is more useful for diagnosing/grading encephalopathy for recruitment than for outcome prediction after treatment.67 Continuous aEEG, however, remains a strong predictor of outcome in HIE. The key features of the aEEG trace that predict long-term neurodevelopmental outcome in cooled children are the time it takes for the aEEG to recover to a normal background pattern and the time of onset of sleep-wake cycling.67\nIn a Norwegian, prospectively recruited, cohort of 47 TH infants in whom aEEG data were recorded, but not used for treatment selection, 15 infants had normal aEEG (continuous normal voltage (CNV)) on retrospective analysis. Of these, 3 infants had an unfavorable outcome (defined as a Bayley III score < 85 in any domain, with language scores of 76, 82, and cognition 81, respectively).68 Of 14 infants with initial CNV who were cooled in a Bristol dataset,69 all had good outcomes and normal MRI. Gagne-Loranger et al. used aEEG to select for TH in a cohort study. Thirteen babies with mild NE had abnormal aEEG and were cooled; 31% had abnormal MRI. By contrast, 9 babies with mild NE and normal aEEG who were not cooled had no brain injury on MRI.21\nThe CoolCap and TOBY trials included an abnormal aEEG within 6 h as one of three main criteria for TH.54,70 In the TOBY study of 314 infants randomized to standard care or TH, the PPV of a severe aEEG assessed by the voltage and pattern methods within 6 h of birth for death or disability at 18 months of age was 0.63 and 0.59 respectively in non-cooled infants and 0.55 and 0.51 in cooled infants (p > 0.05).71\nMagnetic resonance imaging\nFinally, while injury on MRI is common in babies with mild NE, predictive patterns are typically not able to be identified until after the first 3 days of life.27 Thus, its utility in the first 6 h after birth is limited by the timing of evolution of injury as well as by availability, and lack of studies looking at serial MRI. Having readily available MRI in NICUs to undertake serial MRIs in such babies may provide greater insight into early MRI as a selective tool.72; Although mild NE is commonly cited, the exact definition of mild NE is variable. In addition, in mild NE, as in all forms of NE, we cannot be absolutely sure of the underlying etiology of the NE, which may be more complex than just HI and so might not benefit from TH. For example, there is some evidence that TH may be less helpful in infants with preceding infection/inflammation.48,49 Nevertheless, others reported, in a retrospective cohort study of 1084 infants treated with TH for NE, that the majority of 42 infants with NE and early-onset sepsis had a favorable outcome.50 As we consider trials of TH in infants with milder NE, our aim should be to correctly identify infants with brain injury from hypoxia-ischemia who may benefit most from TH. On the other hand, we must not ignore or downplay the stress of being hypothermic, the multiple interventions associated with intensive care including sedation, respiratory support, intravenous lines, blood pressure support, antibiotics, separation from parents for at least 3 days, and delayed oral feeding to more mildly affected infants since such interventions could have net adverse effects.\nTo assist in defining the presence of mild NE, particularly associated with evidence of hypoxia and ischemia, an array of markers may assist. While neurological clinical examination is the cornerstone for the classification of the presence and severity of NE,19,20 this approach has notable limitations. The neurological state is dynamic and may evolve over hours, and so a baby with an early normal examination may evolve over a few hours of age into mild NE while a baby with mild NE may evolve into more moderate NE.51,52 Although the Sarnat clinical criteria are widely used, another neurological scoring system, the Thompson score has been used in clinical trials for infant selection.53,54 In addition, because of the changes over time of the neurological examination, timed and standardized clinical evaluation will help strengthen its validity,20,55,56 and videotaping of the examination may be valuable for training and quality control.55,56\nStandard biochemical markers\nStandard biochemical markers of acid-base, including pH and BD, have been traditionally used to assess the severity of perinatal HI. The earliest metabolic or circulatory sign of reduced delivery of oxygen and substrate to the brain is reduced cardiac output leading to hypotension, and so reduced cerebral blood flow (CBF). In the adult brain, a fall in CBF of 30% is associated with reduced protein synthesis in the brain.57 When CBF is reduced by 40–50%, sensory evoked potentials and EEG power are progressively suppressed. Reduced ATP and anoxic depolarization with cytotoxic edema develop when CBF is reduced by >70–90%—from that time to cell death is relatively short, as the ion pumps stop working. Standard biochemical changes following energy deprivation, inflammation, or generalized stress measurable in plasma include acidosis, lactate, glucose, C-reactive protein (CRP), lactate dehydrogenase (LDH), and more. Current cutoff values used as entry criteria for cooling therapy ranged from <7.0 to 7.15 for pH and >10 to 16 mmol/L for BD. However, the values used as significant criteria in the major RCTs were pH < 7.0 and BD ≥ 16. It has been suggested that a cutoff of pH ≤ 7.1 would be more sensitive in detecting infants with NE,58 but at the cost of increasing the number of infants who would need to be formally examined for some hours after birth. In that study 25 infants with pH between 7.0 and ≤7.1 needed to be screened to identify one additional infant with moderate to severe NE who would otherwise have been missed, representing a 15% increase in infants correctly selected for treatment.58 The impact of a higher pH threshold on screening for mild NE is unknown but it is plausible that less severe acidosis would capture a higher proportion of infants with milder NE.\nThe peak CRP value associated with NE has been shown to be delayed by 36 h and to stay high for longer in cooled babies.59 Cooling itself increases CRP without any documented infection, as a nonspecific response to stress, just as CRP is slightly increased after surgery. Therefore, cooled infants tend to receive antibiotics for a longer period than standard care babies. Nevertheless, high CRP levels are associated with neonatal sepsis.60\nFinally, LDH levels measured within 6 h after birth in infants with NE discriminated between acute and nonacute perinatal HI.61 Moreover, increased LDH levels were associated with worse neurodevelopmental outcome at 18–24 months of age.62\nMore specific potential biomarkers\nMore specific potential biomarkers of neurological injury have been suggested including neuron-specific enolase, myelin basic protein, S-100β, glial fibrillary acidic protein, ubiquitin carboxyl-terminal hydrolase-L1, brain-derived neurotrophic factor, cleaved Tau, microRNA-21, and activin. Other categories of biomarkers include vascular markers, e.g. vascular endothelial growth factor; oxidative stress markers e.g., superoxide dismutase; inflammatory markers such as high-sensitivity CRP, interleukins, and tumor necrosis factor-α, as well as exosomes. Details of these biomarkers are described elsewhere.63,64 The sensitivity and specificity of using these markers or combinations of them to select babies with mild NE for cooling are not yet known and these biomarkers have not been validated in large cohorts.\nAmplitude integrated EEG\naEEG is a widely available real-time continuous cotside marker that displays brain activity and its changes over time. In Europe, the technique has been in routine use for infants with NE for 25 years. The background aEEG amplitude and pattern within 6 h of age are strong predictors of later neurodevelopmental outcomes in normothermic children with perinatal NE.65,66 In the setting of TH, early (<6 h) aEEG has limited positive predictive value (PPV). Thus, early aEEG is more useful for diagnosing/grading encephalopathy for recruitment than for outcome prediction after treatment.67 Continuous aEEG, however, remains a strong predictor of outcome in HIE. The key features of the aEEG trace that predict long-term neurodevelopmental outcome in cooled children are the time it takes for the aEEG to recover to a normal background pattern and the time of onset of sleep-wake cycling.67\nIn a Norwegian, prospectively recruited, cohort of 47 TH infants in whom aEEG data were recorded, but not used for treatment selection, 15 infants had normal aEEG (continuous normal voltage (CNV)) on retrospective analysis. Of these, 3 infants had an unfavorable outcome (defined as a Bayley III score < 85 in any domain, with language scores of 76, 82, and cognition 81, respectively).68 Of 14 infants with initial CNV who were cooled in a Bristol dataset,69 all had good outcomes and normal MRI. Gagne-Loranger et al. used aEEG to select for TH in a cohort study. Thirteen babies with mild NE had abnormal aEEG and were cooled; 31% had abnormal MRI. By contrast, 9 babies with mild NE and normal aEEG who were not cooled had no brain injury on MRI.21\nThe CoolCap and TOBY trials included an abnormal aEEG within 6 h as one of three main criteria for TH.54,70 In the TOBY study of 314 infants randomized to standard care or TH, the PPV of a severe aEEG assessed by the voltage and pattern methods within 6 h of birth for death or disability at 18 months of age was 0.63 and 0.59 respectively in non-cooled infants and 0.55 and 0.51 in cooled infants (p > 0.05).71\nMagnetic resonance imaging\nFinally, while injury on MRI is common in babies with mild NE, predictive patterns are typically not able to be identified until after the first 3 days of life.27 Thus, its utility in the first 6 h after birth is limited by the timing of evolution of injury as well as by availability, and lack of studies looking at serial MRI. Having readily available MRI in NICUs to undertake serial MRIs in such babies may provide greater insight into early MRI as a selective tool.72; Framework for a RCT\nSince there is agreement on the growing evidence of abnormal neurodevelopmental outcomes of some infants with mild NE, and since it is plausible that hypothermia will be beneficial, a RCT seems prudent to provide definitive clinical evidence. In a survey sent by email to members of the Neonatal Neurocritical Care Special Interest Group (www.NNCC-SIG.org) who attended the 2018 annual meeting, of 52 respondents (from 45 different centers), 46 (88%) said they would support an RCT of neuroprotection in mild NE. When asked about what type of neuroprotective therapy to use, 43 (93%) supported TH and 31 (67%) supported using erythropoietin. While there is consensus on the need of a RCT, there was disagreement on the exact inclusion criteria for such study.\nOne approach to inclusion criteria for such an RCT would be to use the same strict inclusion criteria used in previous RCTs for evidence of exposure to HI but to be more inclusive of clinical signs of a lower severity of encephalopathy. This population would be very similar to the one studied in the PRIME study, which has characterized their outcomes.16\nAn alternate approach would be to broaden the acidosis inclusion criteria and add other complementary available biomarkers. Using a pH of 7.1 and BD of 10 mmol/L could provide a marker of a significant insult responsible for the presence of encephalopathy. Additionally, one could combine aEEG monitoring with a clinical neurological examination. It is important to agree on when and how to manage the start of passive and active cooling and the time window in which to undertake the entry examinations. We recommend filming the neurological examination of trial babies for later review and comparisons of interpretation between sites. We know from compelling preclinical evidence and indicative clinical findings that the earlier cooling is started, the greater the neuroprotective benefits.28 In infants requiring resuscitation or fulfilling the blood gas entry criteria, slow passive cooling should be allowed, at the pace of their own metabolism with continuous monitoring of core temperature, should have serial standardized neurological examinations, and aEEG monitoring and optimally have a decision regarding starting active cooling within 3 h.73\nIn order to make valid comparisons we will need a detailed management protocol that minimizes differences in regional practices including intubation, sedation, EEG monitoring, therapy for seizures, and feeding. Finally, the Bayley Scales of Infant and Toddler Development, Third Edition (Bayley III) underestimate the percentage of infants with delay compared to Bayley-II.8 If the Bayley III scale is used for follow-up, using a cutoff of ≤90 (rather than the conventional 85) may be more appropriate to capture abnormal outcomes after mild NE. This would naturally increase the rate of adverse outcomes. In the PRIME study, 7 infants with mild NE had cognitive scores ≤ 85 (16%) and 12 had scores of ≤90 (23%). Seventeen of infants had at least one cognitive, motor, or language score ≤ 85 (40%) and 24 infants had at least one score of ≤90 (56%, unpublished data). It is evident that a range of study designs could reasonably be adopted.\nWe propose a framework consistent with that used in the PRIME study, as follows:\n1.\nInfants with cord arterial pH ≤ 7.0 or BD ≥ 16 mmol/L, or pH ≤ 7.15 and BD of >10 mmol/L if intubated and or received bagging for 10 min, or APGAR scores < 5 would be assessed for presence of encephalopathy by trained observers as reported in the PRIME trial.16 Mild NE would be defined as ≥1 abnormality using the modified Sarnat criteria but not meeting the criteria for moderate or severe NE. Potentially, continuous aEEG recordings could be started in all infants meeting the clinical criteria for mild NE; this addition is not critical, but would allow infants with moderate to severe NE to be identified within the first 6 h and offered TH as part of standard care.53 Infants meeting the criteria and whose parents gave informed consent would be randomized to either standard care or TH for 3 days.\n2.\nThe primary outcome would be Bayley III neurodevelopmental scores in either cognition, motor, or language ≤ 90. Secondary outcomes would include time to recover sleep-wake cycling on the neonatal aEEG, MRI imaging, and moderate to severe disability at 2 years of age.16\n3.\nStudy size. Based on personal communication from the PRIME study 56% of infants with mild NE managed with normothermia would have at least 1 abnormal Bayley score if we use a cutoff ≤ 90. Based on this, an absolute reduction in risk of from 56 to 40%, with 80% power and with alpha 0.05, would require randomizing 152 infants per group. Allowing for 20% loss to follow-up, this suggests that a total 365 infants would need to be randomized. A slightly larger cohort would increase power for long-term follow-up. The greater incidence of impaired Bayley scores than disability after mild NE suggests that Bayley scores are the most appropriate end point. For example, if 14% of control infants show moderate to severe disability, then at least twice as many infants would need to be randomized to detect an absolute reduction of 7%.\nGiven the limitations of assessing language and cognition in infancy then Bayley III neurodevelopmental scores would only be the first outcome, supplemented by secondary outcomes. We strongly suggest that infants should be followed to school age to allow definitive assessment of intellectual and academic performance.; Since there is agreement on the growing evidence of abnormal neurodevelopmental outcomes of some infants with mild NE, and since it is plausible that hypothermia will be beneficial, a RCT seems prudent to provide definitive clinical evidence. In a survey sent by email to members of the Neonatal Neurocritical Care Special Interest Group (www.NNCC-SIG.org) who attended the 2018 annual meeting, of 52 respondents (from 45 different centers), 46 (88%) said they would support an RCT of neuroprotection in mild NE. When asked about what type of neuroprotective therapy to use, 43 (93%) supported TH and 31 (67%) supported using erythropoietin. While there is consensus on the need of a RCT, there was disagreement on the exact inclusion criteria for such study.\nOne approach to inclusion criteria for such an RCT would be to use the same strict inclusion criteria used in previous RCTs for evidence of exposure to HI but to be more inclusive of clinical signs of a lower severity of encephalopathy. This population would be very similar to the one studied in the PRIME study, which has characterized their outcomes.16\nAn alternate approach would be to broaden the acidosis inclusion criteria and add other complementary available biomarkers. Using a pH of 7.1 and BD of 10 mmol/L could provide a marker of a significant insult responsible for the presence of encephalopathy. Additionally, one could combine aEEG monitoring with a clinical neurological examination. It is important to agree on when and how to manage the start of passive and active cooling and the time window in which to undertake the entry examinations. We recommend filming the neurological examination of trial babies for later review and comparisons of interpretation between sites. We know from compelling preclinical evidence and indicative clinical findings that the earlier cooling is started, the greater the neuroprotective benefits.28 In infants requiring resuscitation or fulfilling the blood gas entry criteria, slow passive cooling should be allowed, at the pace of their own metabolism with continuous monitoring of core temperature, should have serial standardized neurological examinations, and aEEG monitoring and optimally have a decision regarding starting active cooling within 3 h.73\nIn order to make valid comparisons we will need a detailed management protocol that minimizes differences in regional practices including intubation, sedation, EEG monitoring, therapy for seizures, and feeding. Finally, the Bayley Scales of Infant and Toddler Development, Third Edition (Bayley III) underestimate the percentage of infants with delay compared to Bayley-II.8 If the Bayley III scale is used for follow-up, using a cutoff of ≤90 (rather than the conventional 85) may be more appropriate to capture abnormal outcomes after mild NE. This would naturally increase the rate of adverse outcomes. In the PRIME study, 7 infants with mild NE had cognitive scores ≤ 85 (16%) and 12 had scores of ≤90 (23%). Seventeen of infants had at least one cognitive, motor, or language score ≤ 85 (40%) and 24 infants had at least one score of ≤90 (56%, unpublished data). It is evident that a range of study designs could reasonably be adopted.\nWe propose a framework consistent with that used in the PRIME study, as follows:\n1.\nInfants with cord arterial pH ≤ 7.0 or BD ≥ 16 mmol/L, or pH ≤ 7.15 and BD of >10 mmol/L if intubated and or received bagging for 10 min, or APGAR scores < 5 would be assessed for presence of encephalopathy by trained observers as reported in the PRIME trial.16 Mild NE would be defined as ≥1 abnormality using the modified Sarnat criteria but not meeting the criteria for moderate or severe NE. Potentially, continuous aEEG recordings could be started in all infants meeting the clinical criteria for mild NE; this addition is not critical, but would allow infants with moderate to severe NE to be identified within the first 6 h and offered TH as part of standard care.53 Infants meeting the criteria and whose parents gave informed consent would be randomized to either standard care or TH for 3 days.\n2.\nThe primary outcome would be Bayley III neurodevelopmental scores in either cognition, motor, or language ≤ 90. Secondary outcomes would include time to recover sleep-wake cycling on the neonatal aEEG, MRI imaging, and moderate to severe disability at 2 years of age.16\n3.\nStudy size. Based on personal communication from the PRIME study 56% of infants with mild NE managed with normothermia would have at least 1 abnormal Bayley score if we use a cutoff ≤ 90. Based on this, an absolute reduction in risk of from 56 to 40%, with 80% power and with alpha 0.05, would require randomizing 152 infants per group. Allowing for 20% loss to follow-up, this suggests that a total 365 infants would need to be randomized. A slightly larger cohort would increase power for long-term follow-up. The greater incidence of impaired Bayley scores than disability after mild NE suggests that Bayley scores are the most appropriate end point. For example, if 14% of control infants show moderate to severe disability, then at least twice as many infants would need to be randomized to detect an absolute reduction of 7%.\nGiven the limitations of assessing language and cognition in infancy then Bayley III neurodevelopmental scores would only be the first outcome, supplemented by secondary outcomes. We strongly suggest that infants should be followed to school age to allow definitive assessment of intellectual and academic performance.; Conclusions\nThere is compelling clinical and experimental evidence that TH initiated in the first 6 h after birth and continued 72 h is associated with long-term improved survival without disability in babies with moderate to severe NE.17 Despite exclusion of babies with mild NE from most neuroprotection intervention trials to date, increasing evidence supports that this population is at risk for adverse neurodevelopmental outcomes. Formal trials of neuroprotective therapies in infants with mild NE are now essential to confirm the risk:benefit ratio for treatment of this larger group. Given that the definition of mild NE is still controversial and the ability to differentiate infants at high risk of disability from those who are truly “mildly” affected is poor, research into improving our tools (e.g. revised neurological examination, incorporation of EEG/aEEG, and biomarkers for risk stratification) is urgently needed. At present, a pragmatic RCT investigating the effect of TH on infants with mild NE seems prudent.; There is compelling clinical and experimental evidence that TH initiated in the first 6 h after birth and continued 72 h is associated with long-term improved survival without disability in babies with moderate to severe NE.17 Despite exclusion of babies with mild NE from most neuroprotection intervention trials to date, increasing evidence supports that this population is at risk for adverse neurodevelopmental outcomes. Formal trials of neuroprotective therapies in infants with mild NE are now essential to confirm the risk:benefit ratio for treatment of this larger group. Given that the definition of mild NE is still controversial and the ability to differentiate infants at high risk of disability from those who are truly “mildly” affected is poor, research into improving our tools (e.g. revised neurological examination, incorporation of EEG/aEEG, and biomarkers for risk stratification) is urgently needed. At present, a pragmatic RCT investigating the effect of TH on infants with mild NE seems prudent.",
            "keywords": "Medicine/Public Health, general; Pediatrics; Pediatric Surgery",
            "link": "https://www.nature.com/articles/s41390-019-0291-1",
            "organization_affiliated": "Department of Pediatric Newborn Medicine, Brigham and Women’s Hospital, Harvard Medical School, Boston, USA; Department of Pediatric Newborn Medicine, Brigham and Women’s Hospital, Harvard Medical School, Boston, USA; Department of Pediatrics, University of Texas Southwestern Medical Center, Dallas, USA; Department of Pediatrics – Neonatology Division, The George Washington University School of Medicine and Children’s National Health Systems, Washington, USA; Neonatal Neuroscience, Translational Medicine, University of Bristol, Bristol, UK; Department of Physiology, School of Medical Sciences, University of Auckland, Auckland, New Zealand",
            "pdf_link": "https://www.nature.com/articles/s41390-019-0291-1.pdf",
            "nature_source": "Pediatric Research 2019 85:4",
            "title": "Should therapeutic hypothermia be offered to babies with mild neonatal encephalopathy in the first 6 h after birth?",
            "id": "366e5b37-5f59-4258-a258-2674cbe1b842"
        },
        {
            "abstract": "While bismuth ferrite BiFeO3 (BFO) is a well studied multiferroic material, its electronic and magnetic properties in the presence of A-site dopants have not been explored widely. Here we report the results of a systematic study of the local electronic structure, spontaneous polarization, and magnetic properties of lanthanum (La) and strontium (Sr) doped rhombohedral bismuth ferrite within density functional theory. An enhanced ferroelectric polarization of 122.43 μC/cm2 is predicted in the uniformly doped BiLaFe2O6. We find that substitution of Sr in the A-site drives the system into a metallic state. The nature of magnetism arises mainly from the B-site Fe exhibiting a G-type antiferromagnetic ordering. Our study finds that upon dopant substitution, the local magnetic moment is decreased and its magnitude is dependent on the distance between the Fe and the dopant atom. The correlation between the local moment and the distance between the Fe and the dopant atom is discussed.",
            "acquisition_date": "2020-06-07",
            "authors": "Ayana Ghosh; Dennis P. Trujillo; Hongchul Choi; S. M. Nakhmanson; S. Pamir Alpay; Jian-Xin Zhu",
            "category": "Ferroelectrics and multiferroics; Magnetic properties and materials",
            "citations": "7",
            "date": "2019-01-17",
            "doi": "10.1038/s41598-018-37339-3",
            "body": "Introduction\nThe correlation between magnetic, electronic, and ferroelectric properties of transition-metal oxides has been studied for several technological applications ranging from tunable multifunctional spintronics to magnetoelectric random access memory devices and various kinds of optoelectronic devices. The most well-studied single-phase multiferroic1,2,3,4,5,6,7,8,9,10,11,12,13 material is the perovskite BiFeO3 (BFO)3, which shows a strong coupling between the spontaneous electric polarization and magnetic ground state. BFO undergoes two phase transitions upon cooling; one at its Curie temperature of 830 °C, from a paraelectric to ferroelectric and one where it becomes magnetically ordered at its Néel temperature of 370 °C. Hence, the low temperature phase with rhombohedrally distorted perovskite structure, which is both ferroelectric and anti-ferromagnetic, is of interest to our research. This phase has been reported both theoretically and experimentally, to show high spontaneous polarization and weak ferromagnetic ordering. The large orbital radius of the Bi 6s2 lone pairs is responsible for the spontaneous electric polarization whereas the magnetism originates from Fe 3d electrons. One of the challenges is that BFO thin films exhibit low electrical resistivity14, which limits its application in designing novel multifunctional non-volatile random-access memory devices.\nRecent research to enhance electronic and magnetic properties of BFO has shown that the presence of common A-site dopants such as La and Sr can have a significant effect on decreasing leakage current in BFO thin films15,16,17,18,19,20,21,22,23. Furthermore, such additions may also control the volatile nature of Bi atoms, whereas B-site dopants are also studied in order to enhance the magnetic ordering in BiFeO3 which may help with loss and leakage24,25,26,27,28,29,30,31,32,33,34,35,36. Formation of oxygen vacancies may also be suppressed in the presence of these dopants due to charge compensation. Oxygen vacancies have also been shown to affect significantly the electronic and magnetic properties of related double perovskites37. Therefore, improving the antiferromagnetic ordering along with retaining high spontaneous polarization of BFO through judicious doping to make it technologically more feasible has captured much interest in the condensed matter and materials physics communities. We note that both La and Sr are commonly used dopants in prototypical ferroelectrics such as PLZT ((Pb1−xLax)(Zr1−yTiy)O3), SBT (SrBi2(Ta2O9)), SBN (SrBi2(Nb2O9)), BST (BaxSr1−xTiO3) and BIT (Bi4Ti3O12) to improve characteristic functional/physical properties. In lead zirconate titanate (PZT) thin films, La3+ dopants help to increase dielectric constant and reduce the coercive field to make it more useful for ferroelectric memory and sensing/actuating applications38,39. For BIT thin films, La3+ helps to improve fatigue characteristics while maintaining high remanent polarization40,41. Sr2+ in BST thin films shifts its paraelectric-ferroelectric transformation temperature to near room temperature for applications in telecommunications which require highly electrically tunable dielectric responses42. The presence of Bi3+ improves dielectric properties in SBT and SBN thin films by increasing its Curie temperature43. Previous reports44,45 also indicate suppression of local magnetic moments and enhancement of overall magnetic ordering in the presence of Sr doping while electronic properties and size of ferroelectric polarization for La-doped BFO is comparable46,47,48 to that of pristine BFO in thin films.\nThe purpose of the present work is to investigate dopant effects, specifically that of La and Sr on the electronic, magnetic and ferroelectric properties of BFO within density functional theory. The paper is organized as follows: Sec. II briefly reviews the computational details of formulating structural optimization, calculations of magnetic moment and spontaneous polarization using the Berry phase method of various supercells within first-principles theory. In Secs. III and IV, we discuss the results of our calculations, progressing from smallest unit cells to bigger supercells. Finally, Sec. V presents concluding remarks.; The correlation between magnetic, electronic, and ferroelectric properties of transition-metal oxides has been studied for several technological applications ranging from tunable multifunctional spintronics to magnetoelectric random access memory devices and various kinds of optoelectronic devices. The most well-studied single-phase multiferroic1,2,3,4,5,6,7,8,9,10,11,12,13 material is the perovskite BiFeO3 (BFO)3, which shows a strong coupling between the spontaneous electric polarization and magnetic ground state. BFO undergoes two phase transitions upon cooling; one at its Curie temperature of 830 °C, from a paraelectric to ferroelectric and one where it becomes magnetically ordered at its Néel temperature of 370 °C. Hence, the low temperature phase with rhombohedrally distorted perovskite structure, which is both ferroelectric and anti-ferromagnetic, is of interest to our research. This phase has been reported both theoretically and experimentally, to show high spontaneous polarization and weak ferromagnetic ordering. The large orbital radius of the Bi 6s2 lone pairs is responsible for the spontaneous electric polarization whereas the magnetism originates from Fe 3d electrons. One of the challenges is that BFO thin films exhibit low electrical resistivity14, which limits its application in designing novel multifunctional non-volatile random-access memory devices.\nRecent research to enhance electronic and magnetic properties of BFO has shown that the presence of common A-site dopants such as La and Sr can have a significant effect on decreasing leakage current in BFO thin films15,16,17,18,19,20,21,22,23. Furthermore, such additions may also control the volatile nature of Bi atoms, whereas B-site dopants are also studied in order to enhance the magnetic ordering in BiFeO3 which may help with loss and leakage24,25,26,27,28,29,30,31,32,33,34,35,36. Formation of oxygen vacancies may also be suppressed in the presence of these dopants due to charge compensation. Oxygen vacancies have also been shown to affect significantly the electronic and magnetic properties of related double perovskites37. Therefore, improving the antiferromagnetic ordering along with retaining high spontaneous polarization of BFO through judicious doping to make it technologically more feasible has captured much interest in the condensed matter and materials physics communities. We note that both La and Sr are commonly used dopants in prototypical ferroelectrics such as PLZT ((Pb1−xLax)(Zr1−yTiy)O3), SBT (SrBi2(Ta2O9)), SBN (SrBi2(Nb2O9)), BST (BaxSr1−xTiO3) and BIT (Bi4Ti3O12) to improve characteristic functional/physical properties. In lead zirconate titanate (PZT) thin films, La3+ dopants help to increase dielectric constant and reduce the coercive field to make it more useful for ferroelectric memory and sensing/actuating applications38,39. For BIT thin films, La3+ helps to improve fatigue characteristics while maintaining high remanent polarization40,41. Sr2+ in BST thin films shifts its paraelectric-ferroelectric transformation temperature to near room temperature for applications in telecommunications which require highly electrically tunable dielectric responses42. The presence of Bi3+ improves dielectric properties in SBT and SBN thin films by increasing its Curie temperature43. Previous reports44,45 also indicate suppression of local magnetic moments and enhancement of overall magnetic ordering in the presence of Sr doping while electronic properties and size of ferroelectric polarization for La-doped BFO is comparable46,47,48 to that of pristine BFO in thin films.\nThe purpose of the present work is to investigate dopant effects, specifically that of La and Sr on the electronic, magnetic and ferroelectric properties of BFO within density functional theory. The paper is organized as follows: Sec. II briefly reviews the computational details of formulating structural optimization, calculations of magnetic moment and spontaneous polarization using the Berry phase method of various supercells within first-principles theory. In Secs. III and IV, we discuss the results of our calculations, progressing from smallest unit cells to bigger supercells. Finally, Sec. V presents concluding remarks.; Computational Details\nWe perform first-principles calculations using the projector-augmented plane-wave (PAW) method as implemented in the Vienna ab initio Simulation Package49,50. The generalized gradient approximation (GGA) is adopted for the exchange-correlation functional. The GGA + U method is introduced to capture the strong correlation in d localized orbitals.\nWe use a Hubbard parameter Ueff = 2 eV, which is shown to be reasonable in previous calculations51,52. We note that other values of Ueff around 4 eV have also been used in the literature. We have systematically studied the band gap for Ueff = 0, 2, 4 and 6 eV with the GGA exchange-correlation functional for the pristine BFO in primitive unit cell and obtained values of 1.0 eV, 2.2 eV, 2.5 eV and 3.2 eV respectively. Throughout the work, we report the results for Ueff = 2 eV. Although the corresponding band gap value is slightly lower than the experimental band gap53,54,55,56,57, this difference should not significantly affect the trend in electronic and magnetic properties for doped BFO systems.\nFor all calculations, we consider G-type antiferromagnetic ordering on Fe cations with spins aligned oppositely in two sublattices.\nWe first perform the structure optimization of the rhombohedral 2 formula units of (10 atoms) BiFeO3 by relaxing the atoms steadily toward the equilibrium until the Hellman-Feynman forces are less than 10−3 eV/Å. We refer to this 2 formula unit crystal cell as the primitive unit cell hereafter. We use these lattice parameters to construct the supercells for the exploration of the dopant effects with varying concentrations. In this primitive unit cell, substitution of one La or Sr for one Bi gives rise to compound BiLaFe2O6 and BiSrFe2O6 as shown in Fig. 1. These two specific structures also provide us an opportunity to compare the results for 50% doped BFO as calculated in the supercell technique. We note that for the rare-earth-based ferrites the crystal structure can be orthorhombic58,59, which could originate from the 4f-electron physics. Therefore, we also check the possible structure change for 50% La-doped BFO when we do the ferroelectric polarization calculations and find the R3-rhombohedral structure still sustained. The reason lies in the fact that the La has no active 4f-electron physics involved.\nFigure 1\nStructural models for (a) BiLaFe2O6 and BiSrFe2O6. (b) 80-atoms unit cell with x = 25% and (c) x = 50% doping in three distinct configurations where distances between dopants are varied.\nFull size image\nIn the 2 × 2 × 2 supercell with 16 formula units of BFO (80 atoms), we vary the concentration of dopant atoms by 6%, 25% and 50% to study the response of electronic and magnetic properties. For 50% doping, it is also interesting to explore the connection of the results in primitive unit cells and supercells. All calculations for the primitive unit cells and supercells are performed with a 5 × 5 × 5 Monkhorst-Pack60 k-point mesh51 centered at Γ and a 500 eV plane-wave cut off energy, for which the results are converged. For both 25% and 50% concentrations, we build three supercells. For each of them, the distances between the dopant atoms are varied as shown in Fig. 1. For both 25% and 50% dopant concentrations, Configuration III represents the structural model where the dopants are placed at the most elongated position along [111] direction in the supercell. Configuration I has the dopants most packed with respect to each other, i.e. has the minimum average distance between dopants. Configuration II is such designed where the dopant atoms are placed in between these two extremums. We also provide an example of how this average distance between dopants are calculated as well as atomic coordinates of A-site and B-site atoms for all of these configurations in Supplementary Material (See SM-1 and SM-2, respectively). The structural relaxations were performed only for the pristine BFO, 6% doped, 25% and 50% doped in Configuration III, for which the spontaneous polarization exists. We choose Configuration III only because we anticipate that this quantity is insensitive to the distribution of the dopants. These relaxations followed the same convergence criterion as explained previously in the section. The choices of supercells are based on experimental evidence reported elsewhere15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36. These particular cases are chosen to explore the location (with respect to Fe atoms) dependence of dopant effects in these supercells.\nThe macroscopic polarization in an infinite periodic solid can be written as the sum of ionic and electronic terms:\n$${\\boldsymbol{P}}={{\\boldsymbol{P}}}_{{\\rm{ion}}}+{{\\boldsymbol{P}}}_{{\\rm{el}}}=\\frac{e}{V}\\sum _{\\tau }{Z}_{\\tau }{{\\boldsymbol{b}}}_{\\tau }-\\frac{1}{V}{\\int }_{V}{\\boldsymbol{r}}\\,\\rho ({\\boldsymbol{r}})\\,d{\\boldsymbol{r}},$$ (1)\nwhere V is the volume of the unit cell, Zτ and bτ are the charge and position of the τ-th atom in the cell, and ρ(r) is the cell-periodic density of electron charge. The electron-charge density can be expanded into the sum of occupied Bloch states ψikσ(r) or Wannier functions Wiσ(r) as represented below within modern theory of polarization61,62:\n$$\\rho ({\\boldsymbol{r}})=-\\,\\frac{e}{{\\mathrm{(2}\\pi )}^{3}}\\sum _{i,\\sigma \\,{\\rm{occ}}}{\\int }_{BZ}d{\\boldsymbol{k}}|{\\psi }_{i{\\boldsymbol{k}}\\sigma }({\\boldsymbol{r}}{)|}^{2}=-\\,e\\sum _{i,\\sigma \\,{\\rm{occ}}}|{W}_{i\\sigma }({\\boldsymbol{r}}{)|}^{2}.$$ (2)\nUtilizing the Bloch-state representation for ρ(r) one can calculate the total electronic contribution of polarization as the solutions to the delocalized Bloch functions along a density-sampled string of neighboring points in k-space for a given crystalline geometry. For a specific choice of basis vectors, the ionic contribution is calculated by summing the product of the position of each ion in the unit cell with the nominal charge of its rigid core. Therefore, the total spontaneous polarization is obtained by summing the electronic and ionic part of the polarizations using Berry phase method. Using the Berry phase approach, the total polarization can only be reported up to integer multiples of the indeterminate polarization quanta with the latter computed by eR/Ω. Structurally, displacements of ions along [111] and counter-rotations about the oxygen octahedra about [111] of cubic perovskite (undistorted structure) yields rhombohedral R3c (fully distorted) structures for pristine BFO and R3 for La-doped BFO. To avoid any discrepancy in choosing one specific path that connects the smallest polarization of the undistorted phase to that of the fully distorted phase, we only look at the residual polarizations by following the procedure proposed in ref.51. In other words, we first calculate the total polarizations of both phases for each system. We then compare those to the polarization quanta and take the difference of their residues for the true polarization.; We perform first-principles calculations using the projector-augmented plane-wave (PAW) method as implemented in the Vienna ab initio Simulation Package49,50. The generalized gradient approximation (GGA) is adopted for the exchange-correlation functional. The GGA + U method is introduced to capture the strong correlation in d localized orbitals.\nWe use a Hubbard parameter Ueff = 2 eV, which is shown to be reasonable in previous calculations51,52. We note that other values of Ueff around 4 eV have also been used in the literature. We have systematically studied the band gap for Ueff = 0, 2, 4 and 6 eV with the GGA exchange-correlation functional for the pristine BFO in primitive unit cell and obtained values of 1.0 eV, 2.2 eV, 2.5 eV and 3.2 eV respectively. Throughout the work, we report the results for Ueff = 2 eV. Although the corresponding band gap value is slightly lower than the experimental band gap53,54,55,56,57, this difference should not significantly affect the trend in electronic and magnetic properties for doped BFO systems.\nFor all calculations, we consider G-type antiferromagnetic ordering on Fe cations with spins aligned oppositely in two sublattices.\nWe first perform the structure optimization of the rhombohedral 2 formula units of (10 atoms) BiFeO3 by relaxing the atoms steadily toward the equilibrium until the Hellman-Feynman forces are less than 10−3 eV/Å. We refer to this 2 formula unit crystal cell as the primitive unit cell hereafter. We use these lattice parameters to construct the supercells for the exploration of the dopant effects with varying concentrations. In this primitive unit cell, substitution of one La or Sr for one Bi gives rise to compound BiLaFe2O6 and BiSrFe2O6 as shown in Fig. 1. These two specific structures also provide us an opportunity to compare the results for 50% doped BFO as calculated in the supercell technique. We note that for the rare-earth-based ferrites the crystal structure can be orthorhombic58,59, which could originate from the 4f-electron physics. Therefore, we also check the possible structure change for 50% La-doped BFO when we do the ferroelectric polarization calculations and find the R3-rhombohedral structure still sustained. The reason lies in the fact that the La has no active 4f-electron physics involved.\nFigure 1\nStructural models for (a) BiLaFe2O6 and BiSrFe2O6. (b) 80-atoms unit cell with x = 25% and (c) x = 50% doping in three distinct configurations where distances between dopants are varied.\nFull size image\nIn the 2 × 2 × 2 supercell with 16 formula units of BFO (80 atoms), we vary the concentration of dopant atoms by 6%, 25% and 50% to study the response of electronic and magnetic properties. For 50% doping, it is also interesting to explore the connection of the results in primitive unit cells and supercells. All calculations for the primitive unit cells and supercells are performed with a 5 × 5 × 5 Monkhorst-Pack60 k-point mesh51 centered at Γ and a 500 eV plane-wave cut off energy, for which the results are converged. For both 25% and 50% concentrations, we build three supercells. For each of them, the distances between the dopant atoms are varied as shown in Fig. 1. For both 25% and 50% dopant concentrations, Configuration III represents the structural model where the dopants are placed at the most elongated position along [111] direction in the supercell. Configuration I has the dopants most packed with respect to each other, i.e. has the minimum average distance between dopants. Configuration II is such designed where the dopant atoms are placed in between these two extremums. We also provide an example of how this average distance between dopants are calculated as well as atomic coordinates of A-site and B-site atoms for all of these configurations in Supplementary Material (See SM-1 and SM-2, respectively). The structural relaxations were performed only for the pristine BFO, 6% doped, 25% and 50% doped in Configuration III, for which the spontaneous polarization exists. We choose Configuration III only because we anticipate that this quantity is insensitive to the distribution of the dopants. These relaxations followed the same convergence criterion as explained previously in the section. The choices of supercells are based on experimental evidence reported elsewhere15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36. These particular cases are chosen to explore the location (with respect to Fe atoms) dependence of dopant effects in these supercells.\nThe macroscopic polarization in an infinite periodic solid can be written as the sum of ionic and electronic terms:\n$${\\boldsymbol{P}}={{\\boldsymbol{P}}}_{{\\rm{ion}}}+{{\\boldsymbol{P}}}_{{\\rm{el}}}=\\frac{e}{V}\\sum _{\\tau }{Z}_{\\tau }{{\\boldsymbol{b}}}_{\\tau }-\\frac{1}{V}{\\int }_{V}{\\boldsymbol{r}}\\,\\rho ({\\boldsymbol{r}})\\,d{\\boldsymbol{r}},$$ (1)\nwhere V is the volume of the unit cell, Zτ and bτ are the charge and position of the τ-th atom in the cell, and ρ(r) is the cell-periodic density of electron charge. The electron-charge density can be expanded into the sum of occupied Bloch states ψikσ(r) or Wannier functions Wiσ(r) as represented below within modern theory of polarization61,62:\n$$\\rho ({\\boldsymbol{r}})=-\\,\\frac{e}{{\\mathrm{(2}\\pi )}^{3}}\\sum _{i,\\sigma \\,{\\rm{occ}}}{\\int }_{BZ}d{\\boldsymbol{k}}|{\\psi }_{i{\\boldsymbol{k}}\\sigma }({\\boldsymbol{r}}{)|}^{2}=-\\,e\\sum _{i,\\sigma \\,{\\rm{occ}}}|{W}_{i\\sigma }({\\boldsymbol{r}}{)|}^{2}.$$ (2)\nUtilizing the Bloch-state representation for ρ(r) one can calculate the total electronic contribution of polarization as the solutions to the delocalized Bloch functions along a density-sampled string of neighboring points in k-space for a given crystalline geometry. For a specific choice of basis vectors, the ionic contribution is calculated by summing the product of the position of each ion in the unit cell with the nominal charge of its rigid core. Therefore, the total spontaneous polarization is obtained by summing the electronic and ionic part of the polarizations using Berry phase method. Using the Berry phase approach, the total polarization can only be reported up to integer multiples of the indeterminate polarization quanta with the latter computed by eR/Ω. Structurally, displacements of ions along [111] and counter-rotations about the oxygen octahedra about [111] of cubic perovskite (undistorted structure) yields rhombohedral R3c (fully distorted) structures for pristine BFO and R3 for La-doped BFO. To avoid any discrepancy in choosing one specific path that connects the smallest polarization of the undistorted phase to that of the fully distorted phase, we only look at the residual polarizations by following the procedure proposed in ref.51. In other words, we first calculate the total polarizations of both phases for each system. We then compare those to the polarization quanta and take the difference of their residues for the true polarization.; Results\nIn this section, we report comparative results of the electronic, magnetic properties of BiLaFe2O6 and BiSrFe2O6 and other doped BFO treated in the supercells.\nBiLaFe2O6 and BiSrFe2O6\nWe observe the change in the electronic and magnetic properties for BiLaFe2O6 and BiSrFe2O6 as compared to pristine BFO. The relaxed structure parameters of the 10-atom unit cell of BFO belonging to R3c 161 space group are a = b = c = 5.69Å and αrh = 58.54°. The relaxed cell volume is 125.72 Å3. This is in good agreement with previous experimental and theoretical predictions51,63. We have used these same lattice parameters for the doped unit cells, noting that the minimal changes in atomic positions during additional structural optimization do not affect the metallic or insulating states obtained for these configurations. The band structure calculations for primitive unit cells are performed along high-symmetry-k-points for a rhombohedral crystal system (F-Γ-Z-L-F) as shown in Fig. 2. The system remains insulating for pristine BFO and BiLaFe2O6. The indirect band gap is smaller in BiLaFe2O6 as compared to BFO. The valence band maxima (VBM) is located in between F and Γ points for BFO while the conduction band minimum (CBM) is located at Z. For BiLaFe2O6 and BiSrFe2O6, the VBM and CBM are both located at point Z. The locations of the energy levels as shown in Fig. 2 are referenced with respect to the low-lying O 2s states, whose energy is considered to be the same in all the compounds considered in this study. This is done specifically to emphasize the upward/downward shifts of the bands in energy in the doped BiFeO3 compounds. A few electronic bands in the valence band (Γ-Z-L) region are shifted above the Fermi level for BiSrFe2O6 leading to a metallic state. This is due to the hole doping effect when Sr atoms are substituted for Bi atoms with Sr giving up nominally two electrons in its divalent state. It leads to the shift of the chemical potential with the minor change of bonding nature. As shown in Fig. 3, this corresponds to the crossing of the Fe-3d band with the Fermi energy, driving the system to be metallic. Our finding for Sr-doped BFO is consistent with the observation from the electronic structure calculations for SrFeO3 in AFM state64,65.\nFigure 2\nBand structures of (a,d) pristine BFO, (b,e) BiLaFe2O6 and (c,f) BiSrFe2O6 in [−4, 4] eV energy range as calculated along high-symmetry-k-points for a rhombohedral crystal system along (F-Γ-Z-L-F). Blue represents spin-up and red represents spin-down bands. Energy is measured with respect to the Fermi energy.\nFull size image\nFigure 3\nPartial spin-resolved density (spin-up - solid and spin-down - dashed lines) of states of Fe-3d for pristine BFO, BiLaFe2O6 and BiSrFe2O6. Energy is measured with respect to the Fermi energy.\nFull size image\nThe nature of magnetism is assumed to be G-type66,67,68 arising from Fe atoms. In addition, with the A-site substitution, the results from our first-principles calculations follow the Goodenough-Kanamori rules that the partially filled d orbitals of two Fe ions can have a strong antiferromagnetic superexchange coupling when they form a 180 degree Fe3+-O2−-Fe3+ bonds. A table listing total energies for all doped and undoped systems in the primitive unit cell and the supercell with G-type AFM and FM ordering is given in Supplementary Material (See SM-3). For the pristine BFO, the average of the staggered magnetic moment is 4.02 μB per Fe, which reduces to 3.95 μB and 3.74 μB for La and Sr doped BFO, respectively. Therefore, A-site dopants will overall suppress the magnetic moments in these systems. More importantly, the net magnetic moment for pristine BFO is 0 μB whereas net moments for the La, Sr cases are 0.004 μB and −0.630 μB, respectively.\nSince calculations of spontaneous polarization demand the system to be perfectly insulating, we cannot report any polarization for Sr doped BFO. For the pristine BFO and 50% La doped BFO, the values of the polarization are 114.90 μC/cm2 and 122.43 μC/cm2 respectively. These are the largest reported polarizations of these systems in these specific geometric configurations. The change in polarization of R3 BiLaFe2O6 as compared to R3c pristine BiFeO3 is due to difference in ionic radii and local charge distribution of these A-site cations. For Bi (5d10 6s2 6p3) there are total 3 valence electrons whereas 3 for La (5s2 5p6 5d1 6s2) and 2 for Sr (4s2 4p6 5s2). For pristine BFO, there is a hybridization between 6s and 6p states that gives rise to active lone pair electrons. For La and Sr doped cases, the degree of Fe 3d-4p orbital mixing23 is reduced. This is due to the movements of local ions to a more symmetric position. This is further analyzed by Bader charge density approach69,70,71,72 as reported in Sec. III.C where the local charge distributions are compared for La and Sr doped BFO to that of pristine BFO. Because of these, the ionic and electronic contributions to the total polarization for La doped BFO are higher than those of the pristine BFO, leading to a higher spontaneous polarization.\nSupercell\nTo observe and quantify the effects of dopants more rigorously, we have constructed 80-atom supercells with a = b = c = 11.37Å and αrh = 58.54 as shown in Fig. 1. The total electron density of states for both spin-resolved channels have been computed for 6%, 25%, and 50% La, Sr doped BFO. The results are plotted in Fig. 4 within specific energy ranges in comparison to that of the pristine BFO. Figure 4(b) shows that by introducing only 6% Sr doping, which amounts to only one Sr atom in the BFO supercell, the system goes to a metallic state73; while the La-doped BFO remains insulating. This behavior also suggests a p-type electrical behavior in Sr-doped BFO, where holes are the main charge carriers. As the dopant concentration is increased from 6% to 25% and 50%, these electronic properties are more pronounced as shown in Fig. 4(c–h). Even for 50% dopant concentration, La doped BFO maintains an insulating state.\nFor 6% dopant concentration, the Fe atom with the smallest distance 3.30 Å away from the dopant has the local magnetic moments of 4.03 μB for La and 3.98 μB for Sr cases, respectively; while the Fe atom with distance 3.11 Å away from the dopant has the local moment of −4.03 μB for La and −3.96 μB for Sr cases, respectively. In addition, the local moment on the other Fe atoms varies with their distance from the dopant site, suggesting a strong dependency on the atomic environment. The Fe atom with the farthest distance from the dopant has the largest local magnetic moments. We report local moments for each Fe atom along with its distance from the dopant atoms for both La and Sr cases in Supplementary Material (See SM-4). As the distance between the dopants to Fe atoms increases, the doped case behaves more like the pristine and the effects of the dopants are less pronounced. Similar behavior has been obtained for 25% and 50% dopant concentrations and the results are summarized in Table I. Overall, A-site dopants suppress magnetic moments. In our calculations, we obtained average magnetic moment of 4.04 μB (4.00) for 6% La (Sr) concentrations. For 25% La (Sr) concentrations, the average magnetic moments are 4.03 μB (3.78), 4.04 μB (3.88) and 4.03 μB (3.88) in Configuration I, II and III, respectively. For 50% La (Sr) concentrations, the average magnetic moments are 4.03 μB (3.75), 4.03 μB (3.76) and 4.03 μB (3.75) in Configuration I, II and III respectively. We remark that our results for 50% concentration in the Configuration III supercell calculations are consistent with those in primitive unit cells.\nOverall, the difference in the highest and the lowest local moment for 6%, 25% and 50% dopant concentrations are listed in Table 1. The overall magnetic moment of Fe atoms is decreased as the dopant concentration is increased. The change is the greatest when BFO is doped with 50% Sr which suggests that the Sr dopant has a greater impact on the magnetic properties compared to La because of the dissimilar nature of its A-site cations as compared to pristine BFO.\nTable 1 Maximum and minimum local magnetic moments (μB) of Fe in the doped BFO with varying concentrations.\nFull size table\nWe also report the polarizations (P) of pristine, 6%, 25%, 50% La-doped BFO as 115.61 μC/cm2, 116.59 μC/cm2, 118.71 μC/cm2 and 120.09 μC/cm2, respectively. There is a 7–10% change in polarization as is shown in Table 2. Again our results on the polarization for the 50% La-doped case in Configuration III is consistent with that reported with that reported for the primitive unit cell. We note that for the pristine BFO, the 0.6% difference in the polarization between the calculations with primitive unit cell and supercell could be attributed to the slight difference in the atomic positions during structural relaxation.\nTable 2 Spontaneous polarization (μC/cm2) of La-doped BFO for various percentages of La doping.\nFull size table\nThe relaxed cell volumes corresponding to each case are 1005.78 Å3 (pristine), 1023.58 Å3 (6% La-doped), 1010.38 Å3 (25% La-doped in Configuration III) and 1009.54 Å3 (50% La-doped in Configuration III), respectively which is used to calculate the true polarization. It is important to mention that these relaxed supercells still belong to the same rhombohedral R3 symmetry group family and thus the reference states for each of these cases are their corresponding cubic perovskites (undistorted) structures with equal volumes of the respective undistorted ones. Furthermore these computations are only performed for one specific structural configuration such as Configuration III since we do not expect major differences in this trend of enhanced spontaneous polarization as the distances between dopants sites are varied. There is no spontaneous polarization for Sr-doped BFO because they are metallic.; In this section, we report comparative results of the electronic, magnetic properties of BiLaFe2O6 and BiSrFe2O6 and other doped BFO treated in the supercells.\nBiLaFe2O6 and BiSrFe2O6\nWe observe the change in the electronic and magnetic properties for BiLaFe2O6 and BiSrFe2O6 as compared to pristine BFO. The relaxed structure parameters of the 10-atom unit cell of BFO belonging to R3c 161 space group are a = b = c = 5.69Å and αrh = 58.54°. The relaxed cell volume is 125.72 Å3. This is in good agreement with previous experimental and theoretical predictions51,63. We have used these same lattice parameters for the doped unit cells, noting that the minimal changes in atomic positions during additional structural optimization do not affect the metallic or insulating states obtained for these configurations. The band structure calculations for primitive unit cells are performed along high-symmetry-k-points for a rhombohedral crystal system (F-Γ-Z-L-F) as shown in Fig. 2. The system remains insulating for pristine BFO and BiLaFe2O6. The indirect band gap is smaller in BiLaFe2O6 as compared to BFO. The valence band maxima (VBM) is located in between F and Γ points for BFO while the conduction band minimum (CBM) is located at Z. For BiLaFe2O6 and BiSrFe2O6, the VBM and CBM are both located at point Z. The locations of the energy levels as shown in Fig. 2 are referenced with respect to the low-lying O 2s states, whose energy is considered to be the same in all the compounds considered in this study. This is done specifically to emphasize the upward/downward shifts of the bands in energy in the doped BiFeO3 compounds. A few electronic bands in the valence band (Γ-Z-L) region are shifted above the Fermi level for BiSrFe2O6 leading to a metallic state. This is due to the hole doping effect when Sr atoms are substituted for Bi atoms with Sr giving up nominally two electrons in its divalent state. It leads to the shift of the chemical potential with the minor change of bonding nature. As shown in Fig. 3, this corresponds to the crossing of the Fe-3d band with the Fermi energy, driving the system to be metallic. Our finding for Sr-doped BFO is consistent with the observation from the electronic structure calculations for SrFeO3 in AFM state64,65.\nFigure 2\nBand structures of (a,d) pristine BFO, (b,e) BiLaFe2O6 and (c,f) BiSrFe2O6 in [−4, 4] eV energy range as calculated along high-symmetry-k-points for a rhombohedral crystal system along (F-Γ-Z-L-F). Blue represents spin-up and red represents spin-down bands. Energy is measured with respect to the Fermi energy.\nFull size image\nFigure 3\nPartial spin-resolved density (spin-up - solid and spin-down - dashed lines) of states of Fe-3d for pristine BFO, BiLaFe2O6 and BiSrFe2O6. Energy is measured with respect to the Fermi energy.\nFull size image\nThe nature of magnetism is assumed to be G-type66,67,68 arising from Fe atoms. In addition, with the A-site substitution, the results from our first-principles calculations follow the Goodenough-Kanamori rules that the partially filled d orbitals of two Fe ions can have a strong antiferromagnetic superexchange coupling when they form a 180 degree Fe3+-O2−-Fe3+ bonds. A table listing total energies for all doped and undoped systems in the primitive unit cell and the supercell with G-type AFM and FM ordering is given in Supplementary Material (See SM-3). For the pristine BFO, the average of the staggered magnetic moment is 4.02 μB per Fe, which reduces to 3.95 μB and 3.74 μB for La and Sr doped BFO, respectively. Therefore, A-site dopants will overall suppress the magnetic moments in these systems. More importantly, the net magnetic moment for pristine BFO is 0 μB whereas net moments for the La, Sr cases are 0.004 μB and −0.630 μB, respectively.\nSince calculations of spontaneous polarization demand the system to be perfectly insulating, we cannot report any polarization for Sr doped BFO. For the pristine BFO and 50% La doped BFO, the values of the polarization are 114.90 μC/cm2 and 122.43 μC/cm2 respectively. These are the largest reported polarizations of these systems in these specific geometric configurations. The change in polarization of R3 BiLaFe2O6 as compared to R3c pristine BiFeO3 is due to difference in ionic radii and local charge distribution of these A-site cations. For Bi (5d10 6s2 6p3) there are total 3 valence electrons whereas 3 for La (5s2 5p6 5d1 6s2) and 2 for Sr (4s2 4p6 5s2). For pristine BFO, there is a hybridization between 6s and 6p states that gives rise to active lone pair electrons. For La and Sr doped cases, the degree of Fe 3d-4p orbital mixing23 is reduced. This is due to the movements of local ions to a more symmetric position. This is further analyzed by Bader charge density approach69,70,71,72 as reported in Sec. III.C where the local charge distributions are compared for La and Sr doped BFO to that of pristine BFO. Because of these, the ionic and electronic contributions to the total polarization for La doped BFO are higher than those of the pristine BFO, leading to a higher spontaneous polarization.\nSupercell\nTo observe and quantify the effects of dopants more rigorously, we have constructed 80-atom supercells with a = b = c = 11.37Å and αrh = 58.54 as shown in Fig. 1. The total electron density of states for both spin-resolved channels have been computed for 6%, 25%, and 50% La, Sr doped BFO. The results are plotted in Fig. 4 within specific energy ranges in comparison to that of the pristine BFO. Figure 4(b) shows that by introducing only 6% Sr doping, which amounts to only one Sr atom in the BFO supercell, the system goes to a metallic state73; while the La-doped BFO remains insulating. This behavior also suggests a p-type electrical behavior in Sr-doped BFO, where holes are the main charge carriers. As the dopant concentration is increased from 6% to 25% and 50%, these electronic properties are more pronounced as shown in Fig. 4(c–h). Even for 50% dopant concentration, La doped BFO maintains an insulating state.\nFor 6% dopant concentration, the Fe atom with the smallest distance 3.30 Å away from the dopant has the local magnetic moments of 4.03 μB for La and 3.98 μB for Sr cases, respectively; while the Fe atom with distance 3.11 Å away from the dopant has the local moment of −4.03 μB for La and −3.96 μB for Sr cases, respectively. In addition, the local moment on the other Fe atoms varies with their distance from the dopant site, suggesting a strong dependency on the atomic environment. The Fe atom with the farthest distance from the dopant has the largest local magnetic moments. We report local moments for each Fe atom along with its distance from the dopant atoms for both La and Sr cases in Supplementary Material (See SM-4). As the distance between the dopants to Fe atoms increases, the doped case behaves more like the pristine and the effects of the dopants are less pronounced. Similar behavior has been obtained for 25% and 50% dopant concentrations and the results are summarized in Table I. Overall, A-site dopants suppress magnetic moments. In our calculations, we obtained average magnetic moment of 4.04 μB (4.00) for 6% La (Sr) concentrations. For 25% La (Sr) concentrations, the average magnetic moments are 4.03 μB (3.78), 4.04 μB (3.88) and 4.03 μB (3.88) in Configuration I, II and III, respectively. For 50% La (Sr) concentrations, the average magnetic moments are 4.03 μB (3.75), 4.03 μB (3.76) and 4.03 μB (3.75) in Configuration I, II and III respectively. We remark that our results for 50% concentration in the Configuration III supercell calculations are consistent with those in primitive unit cells.\nOverall, the difference in the highest and the lowest local moment for 6%, 25% and 50% dopant concentrations are listed in Table 1. The overall magnetic moment of Fe atoms is decreased as the dopant concentration is increased. The change is the greatest when BFO is doped with 50% Sr which suggests that the Sr dopant has a greater impact on the magnetic properties compared to La because of the dissimilar nature of its A-site cations as compared to pristine BFO.\nTable 1 Maximum and minimum local magnetic moments (μB) of Fe in the doped BFO with varying concentrations.\nFull size table\nWe also report the polarizations (P) of pristine, 6%, 25%, 50% La-doped BFO as 115.61 μC/cm2, 116.59 μC/cm2, 118.71 μC/cm2 and 120.09 μC/cm2, respectively. There is a 7–10% change in polarization as is shown in Table 2. Again our results on the polarization for the 50% La-doped case in Configuration III is consistent with that reported with that reported for the primitive unit cell. We note that for the pristine BFO, the 0.6% difference in the polarization between the calculations with primitive unit cell and supercell could be attributed to the slight difference in the atomic positions during structural relaxation.\nTable 2 Spontaneous polarization (μC/cm2) of La-doped BFO for various percentages of La doping.\nFull size table\nThe relaxed cell volumes corresponding to each case are 1005.78 Å3 (pristine), 1023.58 Å3 (6% La-doped), 1010.38 Å3 (25% La-doped in Configuration III) and 1009.54 Å3 (50% La-doped in Configuration III), respectively which is used to calculate the true polarization. It is important to mention that these relaxed supercells still belong to the same rhombohedral R3 symmetry group family and thus the reference states for each of these cases are their corresponding cubic perovskites (undistorted) structures with equal volumes of the respective undistorted ones. Furthermore these computations are only performed for one specific structural configuration such as Configuration III since we do not expect major differences in this trend of enhanced spontaneous polarization as the distances between dopants sites are varied. There is no spontaneous polarization for Sr-doped BFO because they are metallic.; Discussion\nFrom the previous sections, it is evident that the electronic properties of La doped BFO in each supercell is comparable to that of pristine BFO. The differences as shown in the comparative total electron density states in Fig. 4(c–h) arise due to reduction in anisotropy in Fe-O bond distances and local structural distortions as the dopants concentrations are increased. Moreover, for La-doped cases, the Fe 3d-4p orbital mixing and differences in electronegativities are the additional factors to enhance the spontaneous polarization and magnetic properties. Similarly, for the Sr case, the Fe ion in the FeO6 moves to a more symmetric position that gives rise to variation in electron densities. However, the electronegativity of Sr is quite low compared to Bi and the Fe-3d band upshift across the Fermi energy makes it non-insulating.\nFigure 4\nPartial density of states of Fe-3d orbitals on atoms closest to the (a) La and (b) Sr atoms for 6%, 25% and 50% (Configuration III) concentrations respectively. Total electron density of states for 6% doped (c), 25% doped (d–f) and 50% doped (g–i) BFO in all three configurations. Energy is measured with respect to the Fermi energy.\nFull size image\nHere, we also provide a Bader charge analysis in Fig. 5 for pristine BFO as compared to the various doped cases. Bader analysis gives the electronic charge and density of atoms suitable to discuss electronic structure and ionic-covalent character of a compound. The normalization of volume as considered by this technique is necessary to highlight electronic structure modifications due to exact exchange.\nFigure 5\nRepresentative Bader charge volumes of comparative A-site cations in (a) pristine and A-site dopants in (b–d) 6%, 25%, 50% doped BFO corresponding to Configuration III respectively. (e) Bader charges of Fe atoms closest to dopant atom in each case.\nFull size image\nThe number of valence electrons included in each atomic species pseudo potential are 15e for Bi (5d10 6s2 6p3), 8e for Fe (3d7 4s1), 6e for O (2s2 2p4), 11e for La (5s2 5p6 5d1 6s2) and 10e for Sr (4s2 4p6 5s2). We only consider the valence electrons in this analysis since the effects of core electrons on the electronic behavior74 of these systems are expected to be minimal. Only one type of configuration (Configuration III) for 25% and 50% is considered here since the overall properties do not vary significantly for different configurations. The Bader charge volumes as represented in Fig. 5(a–d) are suggestive of more symmetric charge distributions around the A-site dopants in BFO, as described earlier. The average Bader charge for Bi cations is 12.32 electrons and 8.92 and 8.42 electrons for La and Sr cations, respectively. Therefore, the estimated valence charges of Bi, La and Sr are 2.68, 2.08 and 1.58 (cf. formal valence charges of 3, 3 and 2), respectively. Figure 5(e) shows the Bader charges of Fe atoms closest to the dopant atoms for varying concentrations. It also implies that valence charge of Fe is close to 2 + (8e −∼ 6e) for pristine and doped BFO compounds. Charges on oxygen atoms are also reduced to ∼1.4- (cf. formal valence charge of 2-) states for all systems to maintain charge neutrality. There is nominal difference in Fe valence states as compared between pristine and La-doped BFO supercells. There is overall ∼2% reduction in the local charges of Fe atoms between pristine and Sr doped BFO, which provides an explanation for the overall reduced moment in this case. Bader charges and volumes (Å3) for all the atoms for pristine, 6%, 25% and 50% La and Sr doped BFO (in Configuration III) are also given in Supplementary Material (See SM-5, SM-6 and SM-7 respectively). We observe the valence charge of the La dopant atoms is higher than that of Sr by 0.5 electrons. This analysis is also suggestive of mixed ionic-covalent character as observed in such compounds74.\nFinally, we present the optical properties such as dielectric function as a function of frequency and refractive indices to provide a sufficient insight to how La and Sr can improve the energy loss. This computation was performed using Kramers-Kronig relation as implemented in VASP49,50. From Fig. 6(a,b), it is clear that both the phase lag and energy loss are improved as dopants are introduced in pristine BFO75,76. The dopant sites may no longer be considered as isolated sites in the presence of higher dopant concentrations, which may lead to a dielectric breakdown of such materials when subjected to intense electric fields. From the imaginary part of the dielectric functions, the transitions between O-p electron to unoccupied Fe-d states, O-p electron to p states high energy conduction bands and other inner electron excitations can also be identified in each case. The highest value of refractive index n for pristine BFO is reported as 2.88 at an energy of 2.22 eV. For 6% La and Sr doped cases these values shift to 2.82 at an energy of 1.4 eV and 2.84 at 2.12 eV. As the dopant concentration is increased to 25% and 50%, these values decrease to 2.34 and 2.67 at same energies, suggesting the same behavior of major absorption due to transition from valence to conduction bands as predicted by the frequency dependent dielectric functions.\nFigure 6\n(a) Real and (b) imaginary part of dielectric functions, ε(ω) for pristine and 6%, 25% and 50% La, Sr doped BFO supercells.\nFull size image; From the previous sections, it is evident that the electronic properties of La doped BFO in each supercell is comparable to that of pristine BFO. The differences as shown in the comparative total electron density states in Fig. 4(c–h) arise due to reduction in anisotropy in Fe-O bond distances and local structural distortions as the dopants concentrations are increased. Moreover, for La-doped cases, the Fe 3d-4p orbital mixing and differences in electronegativities are the additional factors to enhance the spontaneous polarization and magnetic properties. Similarly, for the Sr case, the Fe ion in the FeO6 moves to a more symmetric position that gives rise to variation in electron densities. However, the electronegativity of Sr is quite low compared to Bi and the Fe-3d band upshift across the Fermi energy makes it non-insulating.\nFigure 4\nPartial density of states of Fe-3d orbitals on atoms closest to the (a) La and (b) Sr atoms for 6%, 25% and 50% (Configuration III) concentrations respectively. Total electron density of states for 6% doped (c), 25% doped (d–f) and 50% doped (g–i) BFO in all three configurations. Energy is measured with respect to the Fermi energy.\nFull size image\nHere, we also provide a Bader charge analysis in Fig. 5 for pristine BFO as compared to the various doped cases. Bader analysis gives the electronic charge and density of atoms suitable to discuss electronic structure and ionic-covalent character of a compound. The normalization of volume as considered by this technique is necessary to highlight electronic structure modifications due to exact exchange.\nFigure 5\nRepresentative Bader charge volumes of comparative A-site cations in (a) pristine and A-site dopants in (b–d) 6%, 25%, 50% doped BFO corresponding to Configuration III respectively. (e) Bader charges of Fe atoms closest to dopant atom in each case.\nFull size image\nThe number of valence electrons included in each atomic species pseudo potential are 15e for Bi (5d10 6s2 6p3), 8e for Fe (3d7 4s1), 6e for O (2s2 2p4), 11e for La (5s2 5p6 5d1 6s2) and 10e for Sr (4s2 4p6 5s2). We only consider the valence electrons in this analysis since the effects of core electrons on the electronic behavior74 of these systems are expected to be minimal. Only one type of configuration (Configuration III) for 25% and 50% is considered here since the overall properties do not vary significantly for different configurations. The Bader charge volumes as represented in Fig. 5(a–d) are suggestive of more symmetric charge distributions around the A-site dopants in BFO, as described earlier. The average Bader charge for Bi cations is 12.32 electrons and 8.92 and 8.42 electrons for La and Sr cations, respectively. Therefore, the estimated valence charges of Bi, La and Sr are 2.68, 2.08 and 1.58 (cf. formal valence charges of 3, 3 and 2), respectively. Figure 5(e) shows the Bader charges of Fe atoms closest to the dopant atoms for varying concentrations. It also implies that valence charge of Fe is close to 2 + (8e −∼ 6e) for pristine and doped BFO compounds. Charges on oxygen atoms are also reduced to ∼1.4- (cf. formal valence charge of 2-) states for all systems to maintain charge neutrality. There is nominal difference in Fe valence states as compared between pristine and La-doped BFO supercells. There is overall ∼2% reduction in the local charges of Fe atoms between pristine and Sr doped BFO, which provides an explanation for the overall reduced moment in this case. Bader charges and volumes (Å3) for all the atoms for pristine, 6%, 25% and 50% La and Sr doped BFO (in Configuration III) are also given in Supplementary Material (See SM-5, SM-6 and SM-7 respectively). We observe the valence charge of the La dopant atoms is higher than that of Sr by 0.5 electrons. This analysis is also suggestive of mixed ionic-covalent character as observed in such compounds74.\nFinally, we present the optical properties such as dielectric function as a function of frequency and refractive indices to provide a sufficient insight to how La and Sr can improve the energy loss. This computation was performed using Kramers-Kronig relation as implemented in VASP49,50. From Fig. 6(a,b), it is clear that both the phase lag and energy loss are improved as dopants are introduced in pristine BFO75,76. The dopant sites may no longer be considered as isolated sites in the presence of higher dopant concentrations, which may lead to a dielectric breakdown of such materials when subjected to intense electric fields. From the imaginary part of the dielectric functions, the transitions between O-p electron to unoccupied Fe-d states, O-p electron to p states high energy conduction bands and other inner electron excitations can also be identified in each case. The highest value of refractive index n for pristine BFO is reported as 2.88 at an energy of 2.22 eV. For 6% La and Sr doped cases these values shift to 2.82 at an energy of 1.4 eV and 2.84 at 2.12 eV. As the dopant concentration is increased to 25% and 50%, these values decrease to 2.34 and 2.67 at same energies, suggesting the same behavior of major absorption due to transition from valence to conduction bands as predicted by the frequency dependent dielectric functions.\nFigure 6\n(a) Real and (b) imaginary part of dielectric functions, ε(ω) for pristine and 6%, 25% and 50% La, Sr doped BFO supercells.\nFull size image; Concluding Remarks\nIn conclusion, we have investigated systematically the La and Sr dopant effect on electronic and magnetic properties in BFO. We have found that La-doped BFO maintains an insulating state whereas adding Sr drives the system to be metallic. This behavior is evident from the band structure calculations. We have also obtained an enhancement of the total polarization in La-doped BFO by 4–8% over the pristine BFO, because of the variance in ionic radii, electronegativity and valence electrons in Bi3+ and La3+. The average magnetic moment of Fe atoms decreases as we increase dopant concentration. This behavior is also dependent on the local atomic environment. In the structural configuration where the distances between dopant atoms with respect to Fe atoms is the smallest, the variance is the highest for lowest local moments. The local charge distribution is responsible for these changes in electronic and magnetic properties. Variance in s and d orbitals occupancy for La and Sr and d orbital occupancy for the Fe-like transition metal ion may also contribute to changes in these properties.\nThe following remarks are in order: Our study gives an estimate of the magnetic moments in primitive unit cells and supercells as compared to pristine BFO. We note that we do not perform any structural relaxation for every supercell because the minimal changes in atomic positions will not affect the metallic or insulating states obtained for the doped system. We anticipate no substantial change in the electronic properties (density of states, band structures) if the impurity concentration is varied in La doped case. Structural relaxations were performed only for pristine BFO, 6%, 25% and 50% La doped BFO in Configuration III, for which the spontaneous polarization occurs. The interference caused by large concentration of dopants in BFO does not affect the polarization significantly. The net ferromagnetic component of La and Sr doped BFO is increased as compared to the pristine BFO. This increase gives the potential of ferromagnetic, ferroelectric coupling in at least La-doped BFO. The specific three structural configurations were chosen judiciously to quantify the effects of dopants with respect to wide change in the surrounding atomic environment. We reason that the use of the sample averaging technique77,78 for a large number of dopant atoms situated at every possible site may give us deeper insights into these effects. But such calculations will become extremely expensive for relatively large impurity configurations and are therefore beyond the scope of this paper. In addition, we expect that the electronic properties explored here in seven distinct structural configurations with 6%, 25% and 50% concentrations may not differ much compared to other possible structural configurations to cause significant variations in our predictions.; In conclusion, we have investigated systematically the La and Sr dopant effect on electronic and magnetic properties in BFO. We have found that La-doped BFO maintains an insulating state whereas adding Sr drives the system to be metallic. This behavior is evident from the band structure calculations. We have also obtained an enhancement of the total polarization in La-doped BFO by 4–8% over the pristine BFO, because of the variance in ionic radii, electronegativity and valence electrons in Bi3+ and La3+. The average magnetic moment of Fe atoms decreases as we increase dopant concentration. This behavior is also dependent on the local atomic environment. In the structural configuration where the distances between dopant atoms with respect to Fe atoms is the smallest, the variance is the highest for lowest local moments. The local charge distribution is responsible for these changes in electronic and magnetic properties. Variance in s and d orbitals occupancy for La and Sr and d orbital occupancy for the Fe-like transition metal ion may also contribute to changes in these properties.\nThe following remarks are in order: Our study gives an estimate of the magnetic moments in primitive unit cells and supercells as compared to pristine BFO. We note that we do not perform any structural relaxation for every supercell because the minimal changes in atomic positions will not affect the metallic or insulating states obtained for the doped system. We anticipate no substantial change in the electronic properties (density of states, band structures) if the impurity concentration is varied in La doped case. Structural relaxations were performed only for pristine BFO, 6%, 25% and 50% La doped BFO in Configuration III, for which the spontaneous polarization occurs. The interference caused by large concentration of dopants in BFO does not affect the polarization significantly. The net ferromagnetic component of La and Sr doped BFO is increased as compared to the pristine BFO. This increase gives the potential of ferromagnetic, ferroelectric coupling in at least La-doped BFO. The specific three structural configurations were chosen judiciously to quantify the effects of dopants with respect to wide change in the surrounding atomic environment. We reason that the use of the sample averaging technique77,78 for a large number of dopant atoms situated at every possible site may give us deeper insights into these effects. But such calculations will become extremely expensive for relatively large impurity configurations and are therefore beyond the scope of this paper. In addition, we expect that the electronic properties explored here in seven distinct structural configurations with 6%, 25% and 50% concentrations may not differ much compared to other possible structural configurations to cause significant variations in our predictions.; Supplementary information\nSupplementary Materials; Supplementary Materials",
            "keywords": "Ferroelectrics and multiferroics; Magnetic properties and materials",
            "link": "https://www.nature.com/articles/s41598-018-37339-3",
            "organization_affiliated": "Department of Materials Science & Engineering and Institute of Materials Science, University of Connecticut, Storrs, USA; Theoretical Division, Los Alamos National Laboratory, Los Alamos, USA; Department of Materials Science & Engineering and Institute of Materials Science, University of Connecticut, Storrs, USA; Theoretical Division, Los Alamos National Laboratory, Los Alamos, USA; Theoretical Division, Los Alamos National Laboratory, Los Alamos, USA; Department of Materials Science & Engineering and Institute of Materials Science, University of Connecticut, Storrs, USA; Department of Physics, University of Connecticut, Storrs, USA; Department of Materials Science & Engineering and Institute of Materials Science, University of Connecticut, Storrs, USA; Department of Physics, University of Connecticut, Storrs, USA; Theoretical Division, Los Alamos National Laboratory, Los Alamos, USA; Center for Integrated Nanotechnologies, Los Alamos National Laboratory, Los Alamos, USA",
            "pdf_link": "https://www.nature.com/articles/s41598-018-37339-3.pdf",
            "nature_source": "Scientific Reports 2019 9:1",
            "title": "Electronic and Magnetic Properties of Lanthanum and Strontium Doped Bismuth Ferrite: A First-Principles Study",
            "id": "87766a03-0f64-4701-842f-24531b60c407"
        }
    ]
}