{
    "table_name": "earthquakes",
    "table_fullname": "bigquery-public-data.noaa_significant_earthquakes.earthquakes",
    "column_names": [
        "id",
        "flag_tsunami",
        "year",
        "month",
        "day",
        "hour",
        "minute",
        "second",
        "focal_depth",
        "eq_primary",
        "eq_mag_mw",
        "eq_mag_ms",
        "eq_mag_mb",
        "eq_mag_ml",
        "eq_mag_mfa",
        "eq_mag_unk",
        "intensity",
        "country",
        "state",
        "location_name",
        "latitude",
        "longitude",
        "region_code",
        "deaths",
        "deaths_description",
        "missing",
        "missing_description",
        "injuries",
        "injuries_description",
        "damage_millions_dollars",
        "damage_description",
        "houses_destroyed",
        "houses_destroyed_description",
        "houses_damaged",
        "houses_damaged_description",
        "total_deaths",
        "total_deaths_description",
        "total_missing",
        "total_missing_description",
        "total_injuries",
        "total_injuries_description",
        "total_damage_millions_dollars",
        "total_damage_description",
        "total_houses_destroyed",
        "total_houses_destroyed_description",
        "total_houses_damaged",
        "total_houses_damaged_description"
    ],
    "column_types": [
        "INT64",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "FLOAT64",
        "FLOAT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64"
    ],
    "nested_column_names": [
        "id",
        "flag_tsunami",
        "year",
        "month",
        "day",
        "hour",
        "minute",
        "second",
        "focal_depth",
        "eq_primary",
        "eq_mag_mw",
        "eq_mag_ms",
        "eq_mag_mb",
        "eq_mag_ml",
        "eq_mag_mfa",
        "eq_mag_unk",
        "intensity",
        "country",
        "state",
        "location_name",
        "latitude",
        "longitude",
        "region_code",
        "deaths",
        "deaths_description",
        "missing",
        "missing_description",
        "injuries",
        "injuries_description",
        "damage_millions_dollars",
        "damage_description",
        "houses_destroyed",
        "houses_destroyed_description",
        "houses_damaged",
        "houses_damaged_description",
        "total_deaths",
        "total_deaths_description",
        "total_missing",
        "total_missing_description",
        "total_injuries",
        "total_injuries_description",
        "total_damage_millions_dollars",
        "total_damage_description",
        "total_houses_destroyed",
        "total_houses_destroyed_description",
        "total_houses_damaged",
        "total_houses_damaged_description"
    ],
    "nested_column_types": [
        "INT64",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "FLOAT64",
        "FLOAT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64"
    ],
    "description": [
        "",
        "If a tsunami was recorded.",
        "Century and year of the significant earthquake. Format +/-yyyy (-is B.C, +is A.D.). Valid values: -2000 to present. The Date and Time are given in Universal Coordinated Time.",
        "Month of the significant earthquake. Valid values: 1-12. The Date and Time are given in Universal Coordinated Time. The local date may be one day different.",
        "Day of the significant earthquake. Valid values: 1-31 (where months apply). The Date and Time are given in Universal Coordinated Time. The local date may be one day different.",
        "Hour of the significant earthquake. Valid values: 0-23. The Date and Time are given in Universal Coordinated Time. The local date may be one day different.",
        "Minute of the significant earthquake. Valid values: 0-59. The Date and Time are given in Universal Coordinated Time. The local date may be one day different.",
        "Second of the significant earthquake. Valid values: 0-59. The Date and Time are given in Universal Coordinated Time. The local date may be one day different.",
        "The depth of the earthquake is given in kilometers. Valid values 0 to 700 km.",
        "The primary earthquake magnitude is chosen from the available magnitude scales in this order: Mw Magnitude  Ms Magnitude  Mb Magnitude  Ml Magnitude  Mfa Magnitude  Unknown Magnitude",
        "Earthquake magnitude Mw. Valid values 0 to 9.9 The Mw magnitude is based on the moment magnitude scale",
        "Earthquake magnitude MS. Valid values 0 to 9.9 The Ms magnitude is the surface-wave magnitude of the earthquake.",
        "Earthquake magnitude mb. Valid values 0 to 9.9 The Mb magnitude is the compressional body wave (P-wave) magnitude.",
        "Earthquake magnitude ML. Valid values 0 to 9.9 The ML magnitude was the original magnitude relationship defined by Richter and Gutenberg for local earthquakes in 1935.",
        "Earthquake magnitude Mfa (based on felt area). Valid values 0 to 9.9 The Mfa magnitudes are computed from the felt area, for earthquakes that occurred before seismic instruments were in general use.",
        "Earthquake magnitude type is Unknown. Valid values 0 to 9.9 The computational method for the earthquake magnitude was unknown and could not be determined from the published sources.",
        "The effect of an earthquake on the Earth's surface is called the intensity. The Modified Mercalli Intensity (MMI) is given in Roman Numerals (converted to numbers in the digital database)",
        "Country. The name of the country where earthquake was located.",
        "The State, Province or Prefecture of the earthquake was located.",
        "Earthquake Location Name. The location (city, state or island) where the earthquake was located.",
        "Latitude: Valid values: -90 to +90 Latitude: 0 to 90 (Northern Hemisphere), -90 to 0 (Southern Hemisphere). The latitude of the location (city, state or island) where the earthquake was located.",
        "Longitude. Valid values: -180 to +180 Longitude: 0 to 180 (Eastern Hemisphere), -180 to 0 (Western Hemisphere). The longitude of the location (city, state or island) where the earthquake was located.",
        "Region Name (Code). Regional boundaries were assigned based on the frequency of occurrence of earthquakes, geophysical relations, risk in distant areas and political justification. The codes are defined as: 10 = Central, Western and S. Africa 15 = Northern Africa 20 = Antarctica 30 = East Asia 40 = Central Asia and Caucasus 50 = Kamchatka and Kuril Islands 60 = S. and SE. Asia and Indian Ocean 70 = Atlantic Ocean 80 = Bering Sea 90 = Caribbean 100 = Central America 110 = Eastern Europe 120 = Northern and Western Europe 130 = Southern Europe 140 = Middle East 150 = North America and Hawaii 160 = South America 170 = Central and South Pacific",
        "Number of deaths from the earthquake, it may also include deaths caused by the secondary effects such as the tsunami, volcanic eruption or landslide that was triggered by the earthquake.",
        "Description of Deaths from the earthquake. Valid values: 0 to 4. When a description was found in the historical literature instead of an actual number of deaths, this value was coded and listed in the Deaths_amount_order column. If the actual number of deaths was listed, a descriptor was also added for search purposes according to the following definition. 0 = None 1 = Few (~1 to 50 deaths)  2 = Some (~51 to 100 deaths)  3 = Many (~101 to 1000 deaths) 4 = Very Many (~1001 or more deaths)",
        "Number of missing from the earthquake, it may also include missing caused by the secondary effects such as the tsunami, volcanic eruption or landslide that was triggered by the earthquake.",
        "Description of Deaths from the earthquake. Valid values: 0 to 4. When a description was found in the historical literature instead of an actual number of missing, this value was coded and listed in the Missing_amount_order column. If the actual number of missing was listed, a descriptor was also added for search purposes according to the following definition. 0 = None 1 = Few (~1 to 50 missing)  2 = Some (~51 to 100 missing)  3 = Many (~101 to 1000 missing) 4 = Very Many (~1001 or more missing)",
        "Number of injuries from the earthquake, it may also include deaths caused by a secondary effect such as the tsunami, volcanic eruption or landslide that was triggered by the earthquake.",
        "Description of injuries from the earthquake. Valid values: 0 to 4. When a description was found in the historical literature instead of an actual number of injuries, this value was coded and listed in the Injuries_amount_order column. If the actual number of injuries was listed, a descriptor was also added for search purposes according to the following definition. 0 = None 1 = Few (~1 to 50 injuries)  2 = Some (~51 to 100 injuries)  3 = Many (~101 to 1000 injuries) 4 = Very Many (~1001 or more injuries)",
        "Damage in Millions of Dollars from the earthquake. The damage amount may also include damage caused by a secondary effect such as a tsunami, volcanic eruption, or landslide that was triggered by the earthquake. The value in the Damage column should be multipled by 1,000,000 to obtain the actual dollar amount in U.S. dollars. The dollar value listed is the value at the time of the event.",
        "Description of Damage from the earthquake. For those events not offering a monetary evaluation of damage, the following five-level scale was used to classify damage and was listed in the  Damage column.  If the actual dollar amount of damage was listed, a descriptor was also added for search purposes. 0 = NONE 1 = LIMITED (roughly corresponding to less than $1 million) 2 = MODERATE (~$1 to $5 million)  3 = SEVERE (~>$5 to $24 million) 4 = EXTREME (~$25 million or more) When possible, a rough estimate was made of the dollar amount of damage based upon the description provided, in order to choose the damage category. In many cases, only a single  descriptive term was available. These terms were converted to the damage categories based upon the author’s apparent use of the term elsewhere. In the absence of other information,  LIMITED is considered synonymous with slight, minor, and light, SEVERE as synonymous with major, extensive, and heavy, and EXTREME as synonymous with catastrophic.",
        "Number of Houses Destroyed. Whenever possible, number of houses destroyed by the earthquake are listed; it may also include houses destroyed caused by a secondary effect such as the tsunami, volcanic eruption, or landslide that was triggered by the earthquake.",
        "Description of Houses Destroyed by the Earthquake. For those earthquakes not offering an exact number of houses destroyed, the following four-level scale was used to classify the destruction and was listed in the Houses_amount_order column.  If the actual number of houses destroyed was listed, a descriptor was also added for search purposes.   0 = None 1 = Few (~1 to 50 houses)  2 = Some (~51 to 100 houses)  3 = Many (~101 to 1000 houses) 4 = Very Many (~1001 or more houses)",
        "Number of Houses Damaged. Whenever possible, number of houses damaged by the earthquake are listed; it may also include houses damaged caused by a secondary effect such as the tsunami, volcanic eruption, or landslide that was triggered by the earthquake.",
        "Description of Houses Damaged by the Earthquake. For those earthquakes not offering an exact number of houses damaged, the following four-level scale was used to classify the damage and was listed in the Houses_damaged_amount_order column.  If the actual number of houses destroyed was listed, a descriptor was also added for search purposes.   0 = None 1 = Few (~1 to 50 houses)  2 = Some (~51 to 100 houses)  3 = Many (~101 to 1000 houses) 4 = Very Many (~1001 or more houses)",
        "Number of deaths from the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide.",
        "Description of Deaths from the earthquake and the secondary effects such as the tsunami, volcanic eruption or landslide. Valid values: 0 to 4. When a description was found in the historical literature instead of an actual number of deaths, this value was coded and listed in the Deaths_amount_order_total column. If the actual number of deaths was listed, a descriptor was also added for search purposes according to the following definition. 0 = None 1 = Few (~1 to 50 deaths)  2 = Some (~51 to 100 deaths)  3 = Many (~101 to 1000 deaths) 4 = Very Many (~1001 or more deaths)",
        "Number of missing from the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide.",
        "Description of Deaths from the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide. Valid values: 0 to 4. When a description was found in the historical literature instead of an actual number of missing, this value was coded and listed in the Missing_amount_order_total column. If the actual number of missing was listed, a descriptor was also added for search purposes according to the following definition. 0 = None 1 = Few (~1 to 50 missing)  2 = Some (~51 to 100 missing)  3 = Many (~101 to 1000 missing) 4 = Very Many (~1001 or more missing)",
        "Number of injuries from the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide.",
        "Description of injuries from the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide. Valid values: 0 to 4. When a description was found in the historical literature instead of an actual number of injuries, this value was coded and listed in the Injuries_amount_order_total column. If the actual number of injuries was listed, a descriptor was also added for search purposes according to the following definition. 0 = None 1 = Few (~1 to 50 injuries)  2 = Some (~51 to 100 injuries)  3 = Many (~101 to 1000 injuries) 4 = Very Many (~1001 or more injuries)",
        "Damage in Millions of Dollars from the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide. The value in the Damage column should be multipled by 1,000,000 to obtain the actual dollar amount in U.S. dollars. The dollar value listed is the value at the time of the event.",
        "For those events not offering a monetary evaluation of damage, the following five-level scale was used to classify damage and was listed in the Damage column.  If the actual dollar amount of damage was listed, a descriptor was also added for search purposes. 0 = NONE 1 = LIMITED (roughly corresponding to less than $1 million) 2 = MODERATE (~$1 to $5 million)  3 = SEVERE (~>$5 to $24 million) 4 = EXTREME (~$25 million or more) When possible, a rough estimate was made of the dollar amount of damage based upon the description provided, in order to choose the damage category. In many cases, only a single descriptive term was available. These terms were converted to the damage categories based upon the author’s apparent use of the term elsewhere. In the absence of other information, LIMITED is considered synonymous with slight, minor, and light, SEVERE as synonymous with major, extensive, and heavy, and EXTREME as synonymous with catastrophic.",
        "Number of Houses Destroyed by the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide.",
        "Description of Houses Destroyed by the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide. For those earthquakes not offering an exact number of houses destroyed, the following four-level scale was used to classify the destruction and was listed in the Houses_amount_order_total column.  If the actual number of houses destroyed was listed, a descriptor was also added for search purposes.   0 = None 1 = Few (~1 to 50 houses)  2 = Some (~51 to 100 houses)  3 = Many (~101 to 1000 houses) 4 = Very Many (~1001 or more houses)",
        "Number of Houses Damaged by the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide.",
        "Description of Houses Damaged by the earthquake and secondary effects such as the tsunami, volcanic eruption or landslide. For those earthquakes not offering an exact number of houses damaged, the following four-level scale was used to classify the damage and was listed in the Houses_dam_amount_order_total column.  If the actual number of houses destroyed was listed, a descriptor was also added for search purposes.   0 = None 1 = Few (~1 to 50 houses)  2 = Some (~51 to 100 houses)  3 = Many (~101 to 1000 houses) 4 = Very Many (~1001 or more houses)"
    ],
    "sample_rows": [
        {
            "id": 338,
            "flag_tsunami": null,
            "year": 1048,
            "month": null,
            "day": null,
            "hour": null,
            "minute": null,
            "second": NaN,
            "focal_depth": null,
            "eq_primary": NaN,
            "eq_mag_mw": NaN,
            "eq_mag_ms": NaN,
            "eq_mag_mb": NaN,
            "eq_mag_ml": NaN,
            "eq_mag_mfa": NaN,
            "eq_mag_unk": NaN,
            "intensity": null,
            "country": "UK",
            "state": null,
            "location_name": "UNITED KINGDOM:  BRITIAN",
            "latitude": 52.0,
            "longitude": NaN,
            "region_code": 120,
            "deaths": null,
            "deaths_description": 3,
            "missing": null,
            "missing_description": null,
            "injuries": null,
            "injuries_description": null,
            "damage_millions_dollars": NaN,
            "damage_description": null,
            "houses_destroyed": null,
            "houses_destroyed_description": null,
            "houses_damaged": null,
            "houses_damaged_description": null,
            "total_deaths": null,
            "total_deaths_description": null,
            "total_missing": null,
            "total_missing_description": null,
            "total_injuries": null,
            "total_injuries_description": null,
            "total_damage_millions_dollars": NaN,
            "total_damage_description": null,
            "total_houses_destroyed": null,
            "total_houses_destroyed_description": null,
            "total_houses_damaged": null,
            "total_houses_damaged_description": null
        },
        {
            "id": 771,
            "flag_tsunami": "Tsu",
            "year": 1580,
            "month": 4,
            "day": 6,
            "hour": null,
            "minute": null,
            "second": NaN,
            "focal_depth": 33,
            "eq_primary": 6.2,
            "eq_mag_mw": NaN,
            "eq_mag_ms": NaN,
            "eq_mag_mb": NaN,
            "eq_mag_ml": 6.2,
            "eq_mag_mfa": NaN,
            "eq_mag_unk": NaN,
            "intensity": null,
            "country": "UK",
            "state": null,
            "location_name": "UNITED KINGDOM:  DOVER STRAITS",
            "latitude": 51.019,
            "longitude": 1.309,
            "region_code": 120,
            "deaths": null,
            "deaths_description": 2,
            "missing": null,
            "missing_description": null,
            "injuries": null,
            "injuries_description": null,
            "damage_millions_dollars": NaN,
            "damage_description": 2,
            "houses_destroyed": null,
            "houses_destroyed_description": null,
            "houses_damaged": null,
            "houses_damaged_description": null,
            "total_deaths": null,
            "total_deaths_description": null,
            "total_missing": null,
            "total_missing_description": null,
            "total_injuries": null,
            "total_injuries_description": null,
            "total_damage_millions_dollars": NaN,
            "total_damage_description": null,
            "total_houses_destroyed": null,
            "total_houses_destroyed_description": null,
            "total_houses_damaged": null,
            "total_houses_damaged_description": null
        },
        {
            "id": 7889,
            "flag_tsunami": "Tsu",
            "year": 1757,
            "month": 7,
            "day": 15,
            "hour": null,
            "minute": null,
            "second": NaN,
            "focal_depth": null,
            "eq_primary": NaN,
            "eq_mag_mw": NaN,
            "eq_mag_ms": NaN,
            "eq_mag_mb": NaN,
            "eq_mag_ml": NaN,
            "eq_mag_mfa": NaN,
            "eq_mag_unk": NaN,
            "intensity": null,
            "country": "UK",
            "state": null,
            "location_name": "UNITED KINGDOM:  ENGLAND: ST. MARY, SCILLY ISLANDS",
            "latitude": 49.92,
            "longitude": -6.32,
            "region_code": 120,
            "deaths": null,
            "deaths_description": null,
            "missing": null,
            "missing_description": null,
            "injuries": null,
            "injuries_description": null,
            "damage_millions_dollars": NaN,
            "damage_description": null,
            "houses_destroyed": null,
            "houses_destroyed_description": null,
            "houses_damaged": null,
            "houses_damaged_description": null,
            "total_deaths": null,
            "total_deaths_description": null,
            "total_missing": null,
            "total_missing_description": null,
            "total_injuries": null,
            "total_injuries_description": null,
            "total_damage_millions_dollars": NaN,
            "total_damage_description": null,
            "total_houses_destroyed": null,
            "total_houses_destroyed_description": null,
            "total_houses_damaged": null,
            "total_houses_damaged_description": null
        },
        {
            "id": 6697,
            "flag_tsunami": "Tsu",
            "year": 1500,
            "month": null,
            "day": null,
            "hour": null,
            "minute": null,
            "second": NaN,
            "focal_depth": null,
            "eq_primary": NaN,
            "eq_mag_mw": NaN,
            "eq_mag_ms": NaN,
            "eq_mag_mb": NaN,
            "eq_mag_ml": NaN,
            "eq_mag_mfa": NaN,
            "eq_mag_unk": NaN,
            "intensity": null,
            "country": "USA",
            "state": "HI",
            "location_name": "HAWAII",
            "latitude": NaN,
            "longitude": NaN,
            "region_code": 150,
            "deaths": null,
            "deaths_description": null,
            "missing": null,
            "missing_description": null,
            "injuries": null,
            "injuries_description": null,
            "damage_millions_dollars": NaN,
            "damage_description": null,
            "houses_destroyed": null,
            "houses_destroyed_description": null,
            "houses_damaged": null,
            "houses_damaged_description": null,
            "total_deaths": null,
            "total_deaths_description": 2,
            "total_missing": null,
            "total_missing_description": null,
            "total_injuries": null,
            "total_injuries_description": null,
            "total_damage_millions_dollars": NaN,
            "total_damage_description": null,
            "total_houses_destroyed": null,
            "total_houses_destroyed_description": null,
            "total_houses_damaged": null,
            "total_houses_damaged_description": null
        },
        {
            "id": 6013,
            "flag_tsunami": "Tsu",
            "year": 1668,
            "month": 4,
            "day": 13,
            "hour": null,
            "minute": null,
            "second": NaN,
            "focal_depth": null,
            "eq_primary": NaN,
            "eq_mag_mw": NaN,
            "eq_mag_ms": NaN,
            "eq_mag_mb": NaN,
            "eq_mag_ml": NaN,
            "eq_mag_mfa": NaN,
            "eq_mag_unk": NaN,
            "intensity": 4,
            "country": "USA",
            "state": "MA",
            "location_name": "BOSTON AND SALEM, MASSACHUSETTS",
            "latitude": 42.35,
            "longitude": -71.05,
            "region_code": 150,
            "deaths": null,
            "deaths_description": null,
            "missing": null,
            "missing_description": null,
            "injuries": null,
            "injuries_description": null,
            "damage_millions_dollars": NaN,
            "damage_description": null,
            "houses_destroyed": null,
            "houses_destroyed_description": null,
            "houses_damaged": null,
            "houses_damaged_description": null,
            "total_deaths": null,
            "total_deaths_description": null,
            "total_missing": null,
            "total_missing_description": null,
            "total_injuries": null,
            "total_injuries_description": null,
            "total_damage_millions_dollars": NaN,
            "total_damage_description": null,
            "total_houses_destroyed": null,
            "total_houses_destroyed_description": null,
            "total_houses_damaged": null,
            "total_houses_damaged_description": null
        }
    ]
}