{
    "table_name": "healthcare_provider_taxonomy_code_set_110",
    "table_fullname": "bigquery-public-data.nppes.healthcare_provider_taxonomy_code_set_110",
    "column_names": [
        "code",
        "grouping",
        "classification",
        "specialization",
        "definition",
        "notes"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "code",
        "grouping",
        "classification",
        "specialization",
        "definition",
        "notes"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "sample_rows": [
        {
            "code": "193200000X",
            "grouping": "Group",
            "classification": "Multi-Specialty",
            "specialization": "",
            "definition": "A business group of one or more individual practitioners, who practice with different areas of specialization.",
            "notes": "[7/1/2003: new]"
        },
        {
            "code": "193400000X",
            "grouping": "Group",
            "classification": "Single Specialty",
            "specialization": "",
            "definition": "A business group of one or more individual practitioners, all of who practice with the same area of specialization.",
            "notes": "[7/1/2003: new]"
        },
        {
            "code": "251300000X",
            "grouping": "Agencies",
            "classification": "Local Education Agency (LEA)",
            "specialization": "",
            "definition": "The term local education agency means a public board of education or other public authority legally constituted within a State to either provide administrative control or direction of, or perform a service function for public schools serving individuals ages 0 – 21 in a state, city, county, township, school district, or other political subdivision including a combination of school districts or counties recognized in a State as an administrative agency for its public schools.  An LEA may provide, or employ professional who provide, services to children included in the Individuals with Disabilities Education Act (IDEA), such services may include, but are not limited to, such medical services as physical, occupational, and speech therapy.",
            "notes": "Source: Portions of IDEA Regulations Part B (34 CFR Part 300.18, Assistance to States for the Education of Children with Disabilities)  [1/1/2006: new]"
        },
        {
            "code": "251B00000X",
            "grouping": "Agencies",
            "classification": "Case Management",
            "specialization": "",
            "definition": "An organization that is responsible for providing case management services.  The agency provides services which assist an individual in gaining access to needed medical, social, educational, and/or other services.  Case management services may be used to locate, coordinate, and monitor necessary appropriate services.  It may be used to encourage the use of cost-effective medical care by referrals to appropriate providers and to discourage over utilization of costly services.  Case management may also serve to provide necessary coordination of non-medical services such as vocational rehabilitation, education, employment, when the services provided enable the individual to function at the highest level.",
            "notes": "Source:  CMS State Medicaid Manual Section 4442.3 [7/1/2006: definition modified]"
        },
        {
            "code": "251E00000X",
            "grouping": "Agencies",
            "classification": "Home Health",
            "specialization": "",
            "definition": "A public agency or private organization, or a subdivision of such an agency or organization, that is primarily engaged in providing skilled nursing services and other therapeutic services, such as physical therapy, speech-language pathology services, or occupational therapy, medical social services, and home health aide services. It has policies established by a professional group associated with the agency or organization (including at least one physician and one registered nurse) to govern the services and provides for supervision of such services by a physician or a registered nurse; maintains clinical records on all patients; is licensed in accordance with State or local law or is approved by the State or local licensing agency as meeting the licensing standards, where applicable; and meets other conditions found by the Secretary of Health and Human Services to be necessary for health and safety.",
            "notes": "Source:  CFR42 Chapter IV Part 484,  http://www.access.gpo.gov/nara/cfr/waisidx_99/42cfr484_99.html [7/1/2007: definition added, source added]"
        }
    ]
}