{
    "table_name": "patent_claims_fulltext_2014",
    "table_fullname": "bigquery-public-data.uspto_oce_claims.patent_claims_fulltext_2014",
    "column_names": [
        "pat_no",
        "claim_no",
        "claim_txt",
        "dependencies",
        "ind_flg",
        "appl_id"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "pat_no",
        "claim_no",
        "claim_txt",
        "dependencies",
        "ind_flg",
        "appl_id"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "pat_no": "3930271",
            "claim_no": "1",
            "claim_txt": "1. A golf glove comprising at least an index finger receptacle, a middle finger receptacle and a back surface extending from said receptacles in the direction of the wrist, and further comprising another finger receptacle disposed adjacent said index finger receptacle and said middle finger receptacle and overlapping a portion of said back section.",
            "dependencies": null,
            "ind_flg": "1",
            "appl_id": null
        },
        {
            "pat_no": "3930271",
            "claim_no": "4",
            "claim_txt": "4. A golf glove adapted for use on one hand of a golf player comprising at least an index finger receptacle and further comprising a finger receptacle attached to the side of said index finger receptacle most nearly adjacent to the thumb and adapted to receive a finger of the golf player's other hand.",
            "dependencies": null,
            "ind_flg": "1",
            "appl_id": null
        },
        {
            "pat_no": "3930271",
            "claim_no": "3",
            "claim_txt": "3. A glove comprising an index finger receptacle, a middle finger receptacle, a back surface extending in the direction of the wrist, a finger restraining strap extending between said receptacles, and a finger restraining strap attached to said back surface adjacent said index finger receptacle and said middle finger receptacle and aligned in a direction substantially parallel to said finger restraining strap extending between said finger receptacles.",
            "dependencies": null,
            "ind_flg": "1",
            "appl_id": null
        },
        {
            "pat_no": "3930271",
            "claim_no": "2",
            "claim_txt": "2. A golf glove in accordance with claim 1 wherein said other finger receptacle is attached along its periphery to said index finger receptacle, said middle finger receptacle and said back surface.",
            "dependencies": "1",
            "ind_flg": "0",
            "appl_id": null
        },
        {
            "pat_no": "3930272",
            "claim_no": "1",
            "claim_txt": "1. In combination with a height adjustable crib or the like of the type having a corner post and an extensible leg slidably connected to the corner post and having a series of holes along its length, a lock comprisingA. a rigid bracket extending around the extensible leg and having sides lying flush against opposite sides of the corner post;B. means for pivotally connecting the bracket sides to the corner post so that the bracket can be swung toward and away from the leg;C. a rigid nose projecting from the bracket and extending toward the leg, said nose being arranged to engage in one of the leg holes when the bracket is swung against the leg so as to lock the leg at a selected position of lengthwise adjustment relative to the corner post, andD. means mounted on the corner post and cooperating with the bracket for removably retaining the bracket with its nose in said hole said retaining means comprising1. a latch pivotally connected to the corner post adjacent to the bracket, and a slot formed in a side of the bracket, the sides of the slot being engaged by the latch when the bracket is positioned with its nose in said hole.",
            "dependencies": null,
            "ind_flg": "1",
            "appl_id": null
        }
    ]
}