{
    "table_name": "clinical_tier1_moleculartest_r2",
    "table_fullname": "isb-cgc-bq.HTAN_versioned.clinical_tier1_moleculartest_r2",
    "column_names": [
        "Component",
        "HTAN_Participant_ID",
        "Timepoint_Label",
        "Start_Days_from_Index",
        "Stop_Days_from_Index",
        "Gene_Symbol",
        "Molecular_Analysis_Method",
        "Test_Result",
        "AA_Change",
        "Antigen",
        "Clinical_Biospecimen_Type",
        "Blood_Test_Normal_Range_Upper",
        "Blood_Test_Normal_Range_Lower",
        "Cell_Count",
        "Chromosome",
        "Clonality",
        "Copy_Number",
        "Cytoband",
        "Exon",
        "Histone_Family",
        "Histone_Variant",
        "Intron",
        "Laboratory_Test",
        "Loci_Abnormal_Count",
        "Loci_Count",
        "Locus",
        "Mismatch_Repair_Mutation",
        "Molecular_Consequence",
        "Pathogenicity",
        "Ploidy",
        "Second_Exon",
        "Second_Gene_Symbol",
        "Specialized_Molecular_Test",
        "Test_Analyte_Type",
        "Test_Units",
        "Test_Value",
        "Transcript",
        "Variant_Origin",
        "Variant_Type",
        "Zygosity",
        "Mutational_Signatures",
        "Mismatch_Repair_System_Status",
        "Lab_Tests_for_MMR_Status",
        "entityId",
        "HTAN_Center",
        "Data_Release"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "Component",
        "HTAN_Participant_ID",
        "Timepoint_Label",
        "Start_Days_from_Index",
        "Stop_Days_from_Index",
        "Gene_Symbol",
        "Molecular_Analysis_Method",
        "Test_Result",
        "AA_Change",
        "Antigen",
        "Clinical_Biospecimen_Type",
        "Blood_Test_Normal_Range_Upper",
        "Blood_Test_Normal_Range_Lower",
        "Cell_Count",
        "Chromosome",
        "Clonality",
        "Copy_Number",
        "Cytoband",
        "Exon",
        "Histone_Family",
        "Histone_Variant",
        "Intron",
        "Laboratory_Test",
        "Loci_Abnormal_Count",
        "Loci_Count",
        "Locus",
        "Mismatch_Repair_Mutation",
        "Molecular_Consequence",
        "Pathogenicity",
        "Ploidy",
        "Second_Exon",
        "Second_Gene_Symbol",
        "Specialized_Molecular_Test",
        "Test_Analyte_Type",
        "Test_Units",
        "Test_Value",
        "Transcript",
        "Variant_Origin",
        "Variant_Type",
        "Zygosity",
        "Mutational_Signatures",
        "Mismatch_Repair_System_Status",
        "Lab_Tests_for_MMR_Status",
        "entityId",
        "HTAN_Center",
        "Data_Release"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        "Category of metadata (e.g. Diagnosis, Biospecimen, scRNA-seq Level 1, etc.); provide the same one for all items/rows.",
        "HTAN ID associated with a patient based on HTAN ID SOP (eg HTANx_yyy )",
        "Label to identify the time point at which the clinical data or biospecimen was obtained (e.g. Baseline, End of Treatment, Overall survival, Final). NO PHI/PII INFORMATION IS ALLOWED.",
        "Number of days from the date of birth (index date) to the date of an event (e.g. exposure to environmental factor, treatment start, etc.). If not applicable please enter 'Not Applicable'",
        "Number of days from the date of birth (index date) to the end date of the event (e.g. exposure to environmental factor, treatment start, etc.). Note: if the event occurs at a single time point, e.g. a diagnosis or a lab test, the values for this column is 'Not Applicable'",
        "The text term used to describe a gene targeted or included in molecular analysis. For rearrangements, this is should be used to represent the reference gene. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the method used for molecular analysis. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the result of the molecular test. If the test result was a numeric value see test_value. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Alphanumeric value used to describe the amino acid change for a specific genetic variant. Example: R116Q. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe an antigen included in molecular testing. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the biological material used for testing, diagnostic, treatment or research purposes. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Numeric value used to describe the upper limit of the normal range used to describe a healthy individual at the institution where the test was completed.",
        "Numeric value used to describe the lower limit of the normal range used to describe a healthy individual at the institution where the test was completed.",
        "Numeric value used to describe the number of cells used for molecular testing. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe a chromosome targeted or included in molecular testing. If a specific genetic variant is being reported, this property can be used to capture the chromosome where that variant is located. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe whether a genomic variant is related by descent from a single progenitor cell. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Numeric value used to describe the number of times a section of the genome is repeated or copied within an insertion, duplication or deletion variant. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Alphanumeric value used to describe the cytoband or chromosomal location targeted or included in molecular analysis. If a specific genetic variant is being reported, this property can be used to capture the cytoband where the variant is located. Format: [chromosome][chromosome arm].[band+sub-bands]. Example: 17p13.1. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Exon number targeted or included in a molecular analysis. If a specific genetic variant is being reported, this property can be used to capture the exon where that variant is located. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the family, or classification of a group of basic proteins found in chromatin, called histones.",
        "The text term used to describe a specific histone variants, which are proteins that substitute for the core canonical histones.",
        "Intron number targeted or included in molecular analysis. If a specific genetic variant is being reported, this property can be used to capture the intron where that variant is located.",
        "The text term used to describe the medical testing used to diagnose, treat or further understand a patient's disease.",
        "Numeric value used to describe the number of loci determined to be abnormal.",
        "Numeric value used to describe the number of loci tested.",
        "Alphanumeric value used to describe the locus of a specific genetic variant. Example: NM_001126114.",
        "The yes/no/unknown indicator used to describe whether the mutation included in molecular testing was known to have an affect on the mismatch repair process. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the molecular consequence of genetic variation. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text used to describe a variant's level of involvement in the cause of the patient's disease according to the standards outlined by the American College of Medical Genetics and Genomics (ACMG).",
        "Text term used to describe the number of sets of homologous chromosomes.",
        "The second exon number involved in molecular variation. If a specific genetic variant is being reported, this property can be used to capture the second exon where that variant is located. This property is typically used for a translocation where two different locations are involved in the variation.",
        "The text term used to describe a secondary gene targeted or included in molecular analysis. For rearrangements, this is should represent the location of the variant. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "Text term used to describe a specific test that is not covered in the list of molecular analysis methods. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the type of analyte used for molecular testing. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the units of the test value for a molecular test. This property is used in conjunction with test_value. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term or numeric value used to describe a specific result of a molecular test. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here",
        "Alphanumeric value used to describe the transcript of a specific genetic variant. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the biological origin of a specific genetic variant. Note: This node is meant to capture molecular tests that were completed clinically for the participant and only includes data from diagnostic array that was completed prior to research sequencing was done. Do not include data related to research assay outputs here.",
        "The text term used to describe the type of genetic variation.",
        "The text term used to describe the zygosity of a specific genetic variant.",
        "Mutational signatures identified in the patient, includes signatures linked to selected exogenous carcinogens, endogenous and enzymatic modification of DNA or defective DNA repair. Note: Include only outputs of tests that were completed clinically for the participant and only include data from a diagnostic array that was completed prior to research sequencing was done. ",
        "The text that best describes the condition or state of MMR (mismatch repair system) in the patient",
        "Laboratory tests used to evaluate the status of mismatch repair pathways",
        "Synapse ID of entity",
        "Name of HTAN Center e.g. HTAN HTAPP",
        "Inclusion in HTAN Data Release e.g. Release 1.0"
    ],
    "sample_rows": [
        {
            "Component": "MolecularTest",
            "HTAN_Participant_ID": "HTA13_2",
            "Timepoint_Label": "Not applicable",
            "Start_Days_from_Index": "Not applicable",
            "Stop_Days_from_Index": "None",
            "Gene_Symbol": "Not applicable",
            "Molecular_Analysis_Method": "Not Applicable",
            "Test_Result": "Not Applicable",
            "AA_Change": "None",
            "Antigen": "None",
            "Clinical_Biospecimen_Type": "None",
            "Blood_Test_Normal_Range_Upper": "None",
            "Blood_Test_Normal_Range_Lower": "None",
            "Cell_Count": "None",
            "Chromosome": "None",
            "Clonality": "None",
            "Copy_Number": "None",
            "Cytoband": "None",
            "Exon": "None",
            "Histone_Family": "None",
            "Histone_Variant": "None",
            "Intron": "None",
            "Laboratory_Test": "None",
            "Loci_Abnormal_Count": "None",
            "Loci_Count": "None",
            "Locus": "None",
            "Mismatch_Repair_Mutation": "None",
            "Molecular_Consequence": "None",
            "Pathogenicity": "None",
            "Ploidy": "None",
            "Second_Exon": "None",
            "Second_Gene_Symbol": "None",
            "Specialized_Molecular_Test": "None",
            "Test_Analyte_Type": "None",
            "Test_Units": "None",
            "Test_Value": "None",
            "Transcript": "None",
            "Variant_Origin": "None",
            "Variant_Type": "None",
            "Zygosity": "None",
            "Mutational_Signatures": "None",
            "Mismatch_Repair_System_Status": "None",
            "Lab_Tests_for_MMR_Status": "None",
            "entityId": "syn26602162",
            "HTAN_Center": "HTAN TNP SARDANA",
            "Data_Release": "Release 2.0"
        },
        {
            "Component": "MolecularTest",
            "HTAN_Participant_ID": "HTA13_1",
            "Timepoint_Label": "pt_timepoint_1",
            "Start_Days_from_Index": "25185",
            "Stop_Days_from_Index": "None",
            "Gene_Symbol": "Not applicable",
            "Molecular_Analysis_Method": "Microsatellite Analysis",
            "Test_Result": "High",
            "AA_Change": "None",
            "Antigen": "None",
            "Clinical_Biospecimen_Type": "None",
            "Blood_Test_Normal_Range_Upper": "None",
            "Blood_Test_Normal_Range_Lower": "None",
            "Cell_Count": "None",
            "Chromosome": "None",
            "Clonality": "None",
            "Copy_Number": "None",
            "Cytoband": "None",
            "Exon": "None",
            "Histone_Family": "None",
            "Histone_Variant": "None",
            "Intron": "None",
            "Laboratory_Test": "None",
            "Loci_Abnormal_Count": "None",
            "Loci_Count": "None",
            "Locus": "None",
            "Mismatch_Repair_Mutation": "None",
            "Molecular_Consequence": "None",
            "Pathogenicity": "None",
            "Ploidy": "None",
            "Second_Exon": "None",
            "Second_Gene_Symbol": "None",
            "Specialized_Molecular_Test": "None",
            "Test_Analyte_Type": "None",
            "Test_Units": "None",
            "Test_Value": "None",
            "Transcript": "None",
            "Variant_Origin": "None",
            "Variant_Type": "None",
            "Zygosity": "None",
            "Mutational_Signatures": "None",
            "Mismatch_Repair_System_Status": "None",
            "Lab_Tests_for_MMR_Status": "None",
            "entityId": "syn25556984",
            "HTAN_Center": "HTAN TNP SARDANA",
            "Data_Release": "Release 2.0"
        },
        {
            "Component": "MolecularTest",
            "HTAN_Participant_ID": "HTA13_1",
            "Timepoint_Label": "pt_timepoint_1",
            "Start_Days_from_Index": "25185",
            "Stop_Days_from_Index": "None",
            "Gene_Symbol": "BRAF",
            "Molecular_Analysis_Method": "Targeted Sequencing",
            "Test_Result": "Positive",
            "AA_Change": "None",
            "Antigen": "None",
            "Clinical_Biospecimen_Type": "None",
            "Blood_Test_Normal_Range_Upper": "None",
            "Blood_Test_Normal_Range_Lower": "None",
            "Cell_Count": "None",
            "Chromosome": "None",
            "Clonality": "None",
            "Copy_Number": "None",
            "Cytoband": "None",
            "Exon": "None",
            "Histone_Family": "None",
            "Histone_Variant": "None",
            "Intron": "None",
            "Laboratory_Test": "None",
            "Loci_Abnormal_Count": "None",
            "Loci_Count": "None",
            "Locus": "None",
            "Mismatch_Repair_Mutation": "None",
            "Molecular_Consequence": "None",
            "Pathogenicity": "None",
            "Ploidy": "None",
            "Second_Exon": "None",
            "Second_Gene_Symbol": "None",
            "Specialized_Molecular_Test": "None",
            "Test_Analyte_Type": "None",
            "Test_Units": "None",
            "Test_Value": "None",
            "Transcript": "None",
            "Variant_Origin": "None",
            "Variant_Type": "None",
            "Zygosity": "None",
            "Mutational_Signatures": "None",
            "Mismatch_Repair_System_Status": "None",
            "Lab_Tests_for_MMR_Status": "None",
            "entityId": "syn25556982",
            "HTAN_Center": "HTAN TNP SARDANA",
            "Data_Release": "Release 2.0"
        },
        {
            "Component": "MolecularTest",
            "HTAN_Participant_ID": "HTA7_1",
            "Timepoint_Label": "Baseline",
            "Start_Days_from_Index": "22559",
            "Stop_Days_from_Index": "None",
            "Gene_Symbol": "BRAF",
            "Molecular_Analysis_Method": "IHC",
            "Test_Result": "Negative",
            "AA_Change": "None",
            "Antigen": "None",
            "Clinical_Biospecimen_Type": "None",
            "Blood_Test_Normal_Range_Upper": "None",
            "Blood_Test_Normal_Range_Lower": "None",
            "Cell_Count": "None",
            "Chromosome": "None",
            "Clonality": "None",
            "Copy_Number": "None",
            "Cytoband": "None",
            "Exon": "None",
            "Histone_Family": "None",
            "Histone_Variant": "None",
            "Intron": "None",
            "Laboratory_Test": "None",
            "Loci_Abnormal_Count": "None",
            "Loci_Count": "None",
            "Locus": "None",
            "Mismatch_Repair_Mutation": "None",
            "Molecular_Consequence": "None",
            "Pathogenicity": "None",
            "Ploidy": "None",
            "Second_Exon": "None",
            "Second_Gene_Symbol": "None",
            "Specialized_Molecular_Test": "None",
            "Test_Analyte_Type": "None",
            "Test_Units": "None",
            "Test_Value": "None",
            "Transcript": "None",
            "Variant_Origin": "None",
            "Variant_Type": "None",
            "Zygosity": "None",
            "Mutational_Signatures": "None",
            "Mismatch_Repair_System_Status": "None",
            "Lab_Tests_for_MMR_Status": "None",
            "entityId": "syn26486605",
            "HTAN_Center": "HTAN HMS",
            "Data_Release": "Release 2.0"
        },
        {
            "Component": "MolecularTest",
            "HTAN_Participant_ID": "HTA7_8",
            "Timepoint_Label": "Baseline",
            "Start_Days_from_Index": "19629",
            "Stop_Days_from_Index": "None",
            "Gene_Symbol": "BRAF",
            "Molecular_Analysis_Method": "IHC",
            "Test_Result": "Negative",
            "AA_Change": "None",
            "Antigen": "None",
            "Clinical_Biospecimen_Type": "None",
            "Blood_Test_Normal_Range_Upper": "None",
            "Blood_Test_Normal_Range_Lower": "None",
            "Cell_Count": "None",
            "Chromosome": "None",
            "Clonality": "None",
            "Copy_Number": "None",
            "Cytoband": "None",
            "Exon": "None",
            "Histone_Family": "None",
            "Histone_Variant": "None",
            "Intron": "None",
            "Laboratory_Test": "None",
            "Loci_Abnormal_Count": "None",
            "Loci_Count": "None",
            "Locus": "None",
            "Mismatch_Repair_Mutation": "None",
            "Molecular_Consequence": "None",
            "Pathogenicity": "None",
            "Ploidy": "None",
            "Second_Exon": "None",
            "Second_Gene_Symbol": "None",
            "Specialized_Molecular_Test": "None",
            "Test_Analyte_Type": "None",
            "Test_Units": "None",
            "Test_Value": "None",
            "Transcript": "None",
            "Variant_Origin": "None",
            "Variant_Type": "None",
            "Zygosity": "None",
            "Mutational_Signatures": "None",
            "Mismatch_Repair_System_Status": "None",
            "Lab_Tests_for_MMR_Status": "None",
            "entityId": "syn26486607",
            "HTAN_Center": "HTAN HMS",
            "Data_Release": "Release 2.0"
        }
    ]
}