{
    "table_name": "referring_durable_medical_equip_2014",
    "table_fullname": "bigquery-public-data.cms_medicare.referring_durable_medical_equip_2014",
    "column_names": [
        "referring_npi",
        "provider_last_name",
        "provider_first_name",
        "provider_middle_initial",
        "provider_credentials",
        "provider_gender",
        "provider_entity_code",
        "provider_street_1",
        "provider_street_2",
        "provider_city",
        "provider_state",
        "provider_zip",
        "provider_country",
        "provider_type",
        "provider_type_flag",
        "number_of_suppliers",
        "number_of_supplier_hcpcs",
        "number_of_supplier_beneficiaries",
        "number_of_supplier_claims",
        "number_of_supplier_services",
        "supplier_submitted_charges",
        "supplier_medicare_allowed_amount",
        "supplier_medicare_payment_amount",
        "supplier_medicare_standard_payment_amount",
        "durable_medical_equipment_suppression_indicator",
        "dme_suppliers",
        "dme_hcpcs",
        "dme_beneficiaries",
        "dme_claims",
        "dme_services",
        "dme_submitted_charges",
        "dme_medicare_allowed_amount",
        "dme_medicare_payment_amount",
        "dme_medicare_standard_payment_amount",
        "prosthetic_and_orthotic_suppression_indicator",
        "po_suppliers",
        "po_hcpcs",
        "po_beneficiaries",
        "po_claims",
        "po_services",
        "po_submitted_charges",
        "po_medicare_allowed_amount",
        "po_medicare_payment_amount",
        "po_medicare_standard_payment_amount",
        "drug_and_nutritional_suppression_indicator",
        "number_of_drug_and_nutritional_products_suppliers",
        "number_of_drug_and_nutritional_products_hcpcs",
        "number_of_drug_and_nutritional_products_beneficiaries",
        "number_of_drug_and_nutritional_products_claims",
        "number_of_drug_and_nutritional_products_services",
        "drug_and_nutritional_products_submitted_charges",
        "drug_and_nutritional_products_medicare_allowed_amount",
        "drug_and_nutritional_products_medicare_payment_amount",
        "drug_and_nutritional_products_medicare_standard_payment_amount"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64"
    ],
    "nested_column_names": [
        "referring_npi",
        "provider_last_name",
        "provider_first_name",
        "provider_middle_initial",
        "provider_credentials",
        "provider_gender",
        "provider_entity_code",
        "provider_street_1",
        "provider_street_2",
        "provider_city",
        "provider_state",
        "provider_zip",
        "provider_country",
        "provider_type",
        "provider_type_flag",
        "number_of_suppliers",
        "number_of_supplier_hcpcs",
        "number_of_supplier_beneficiaries",
        "number_of_supplier_claims",
        "number_of_supplier_services",
        "supplier_submitted_charges",
        "supplier_medicare_allowed_amount",
        "supplier_medicare_payment_amount",
        "supplier_medicare_standard_payment_amount",
        "durable_medical_equipment_suppression_indicator",
        "dme_suppliers",
        "dme_hcpcs",
        "dme_beneficiaries",
        "dme_claims",
        "dme_services",
        "dme_submitted_charges",
        "dme_medicare_allowed_amount",
        "dme_medicare_payment_amount",
        "dme_medicare_standard_payment_amount",
        "prosthetic_and_orthotic_suppression_indicator",
        "po_suppliers",
        "po_hcpcs",
        "po_beneficiaries",
        "po_claims",
        "po_services",
        "po_submitted_charges",
        "po_medicare_allowed_amount",
        "po_medicare_payment_amount",
        "po_medicare_standard_payment_amount",
        "drug_and_nutritional_suppression_indicator",
        "number_of_drug_and_nutritional_products_suppliers",
        "number_of_drug_and_nutritional_products_hcpcs",
        "number_of_drug_and_nutritional_products_beneficiaries",
        "number_of_drug_and_nutritional_products_claims",
        "number_of_drug_and_nutritional_products_services",
        "drug_and_nutritional_products_submitted_charges",
        "drug_and_nutritional_products_medicare_allowed_amount",
        "drug_and_nutritional_products_medicare_payment_amount",
        "drug_and_nutritional_products_medicare_standard_payment_amount"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "STRING",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "INT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64",
        "FLOAT64"
    ],
    "description": [
        "NPI for the referring provider on the DMEPOS claim.",
        "When the referring provider is registered in NPPES as an individual (entity type code=’I’), this is the referring provider’s last name. When the referring provider is registered as an organization (entity type code = ‘O’), this is the organization name.",
        "When the referring provider is registered in NPPES as an individual (entity type code=’I’), this is the referring provider’s first name. When the referring provider is registered as an organization (entity type code = ‘O’), this will be blank.",
        "When the referring provider is registered in NPPES as an individual (entity type code=’I’), this is the referring provider’s middle initial. When the referring provider is registered as an organization (entity type code = ‘O’), this will be blank.",
        "When the referring provider is registered in NPPES as an individual (entity type code=’I’), these are the referring provider’s credentials. When the referring provider is registered as an organization (entity type code = ‘O’), this will be blank.",
        "When the referring provider is registered in NPPES as an individual (entity type code=’I’), this is the referring provider’s gender. When the referring provider is registered as an organization (entity type code = ‘O’), this will be blank.",
        "Type of entity reported in NPPES. An entity code of ‘I’ identifies referring providers registered as individuals and an entity type code of ‘O’ identifies referring providers registered as organizations.",
        "The first line of the referring provider’s street address, as reported in NPPES.",
        "The second line of the referring provider’s street address, as reported in NPPES.",
        "The city where the referring provider is located, as reported in NPPES",
        "The state where the referring provider is located, as reported in NPPES. The fifty U.S. states and the District of Columbia are reported by the state postal abbreviation. The following values are used for other areas: 'XX' = 'Unknown' 'AA' = 'Armed Forces Central/South America' 'AE' = 'Armed Forces Europe' 'AP' = 'Armed Forces Pacific' 'AS' = 'American Samoa' 'GU' = 'Guam' 'MP' = 'North Mariana Islands' 'PR' = 'Puerto Rico' 'VI' = 'Virgin Islands' 'ZZ' = 'Foreign Country'",
        "The referring provider’s zip code, as reported in NPPES.",
        "The country where the referring provider is located, as reported in NPPES. The country code will be ‘US’ for any state or U.S. possession. For foreign countries (i.e., state values of ‘ZZ’), the provider country values include the following: AE=United Arab Emirates IT=Italy AG=Antigua JP=Japan AR=Argentina KR=Korea AU=Australia KW=Kuwait BO=Bolivia KY=Cayman Islands BR=Brazil LB=Lebanon CA=Canada MX=Mexico CH=Switzerland NL=Netherlands CN=China NO=Norway CO=Colombia NZ=New Zealand DE= Germany PA=Panama ES= Spain PK=Pakistan FR=France RW=Rwanda GB=Great Britain SA=Saudi Arabia HU= Hungary SY=Syria IL= Israel TH=Thailand IN=India TR=Turkey IS= Iceland VE=Venezuela",
        "Derived from the Medicare provider/supplier specialty code reported on all of the NPI's Part B non-institutional claims (DMEPOS and non-DMEPOS). For referring providers that have more than one Medicare specialty code reported on their claims, the Medicare specialty code associated with the largest number of services was used.",
        "A flag variable that indicates the source of the Referring Provider Type: \"S\" = Medicare Specialty Code description \"T\" = Taxonomy Code Classification description",
        "Number of suppliers rendering DMEPOS products/services ordered by the referring provider.",
        "Total number of unique DMEPOS product/service HCPCS codes billed by suppliers and ordered by the referring provider.",
        "Number of beneficiaries associated with the supplier DMEPOS products/services ordered by the referring provider. Beneficiary counts fewer than 11 have been suppressed to protect the privacy of Medicare beneficiaries.",
        "Number of DMEPOS claims submitted by the supplier, reflecting products/services ordered by the referring provider. Aggregated records based on number_of_supplier_claims fewer than 11 are not included in the data file.",
        "Number of DMEPOS products/services rendered by the supplier; note that the metrics used to count the number provided can vary from service to service.",
        "Average of the charges that suppliers submit for DMEPOS products/services. Total submitted charges can be calculated by multiplying the avg_supplier_submitted_charge by the number_of_supplier_services.",
        "Average Medicare allowed amounts for the DMEPOS product/service rendered by suppliers. Medicare allowed amounts includes the amount Medicare pays, the deductible and coinsurance amounts that the beneficiary is responsible for paying, and any amounts that a third party is responsible for paying. Total Medicare allowed amounts can be calculated by multiplying the avg_supplier_medicare_allow_amt by the number_of_supplier_services.",
        "Average amount that Medicare paid suppliers after deductible and coinsurance amounts have been deducted for the line item DMEPOS product/service. Total Medicare payment amounts can be calculated by multiplying the avg_supplier_medicare_pmt_amt by the number_of_supplier_services.",
        "Average amount that Medicare paid after beneficiary deductible and coinsurance amounts have been deducted for the line item DMEPOS product/service and after standardization of the Medicare payment has been applied. Standardization removes geographic differences in payment rates for individual product/services and makes Medicare payments across geographic areas comparable.",
        "A flag indicating the reason the utilization, charge and payment subtotal information for Durable Medical Equipment is suppressed. “*” = Primary suppressed due to Number of Durable Medical Equipment Claims between 1 and 10. “#” = Counter suppressed because the claim count from at least one of the corresponding claim count categories (Number of Prosthetic and Orthotic Claims or Number of Drug and Nutritional Products Claims) is between 1 and 10. Counter suppression prevents the disclosure of a primary suppressed value when all categories sum to the total value.",
        "Number of suppliers rendering durable medical equipment products/services. A blank indicates the value is suppressed.",
        "Total number of unique durable medical equipment HCPCS codes billed by suppliers and ordered by the referring provider. A blank indicates the value is suppressed.",
        "Total number of unique beneficiaries associated with durable medical equipment claims submitted by suppliers and ordered by the referring provider. Beneficiary counts fewer than 11 have been suppressed to protect the privacy of Medicare beneficiaries. A blank indicates the value is suppressed.",
        "Total number of durable medical equipment claims submitted by suppliers, reflecting services ordered by the referring provider. A blank indicates the value is suppressed.",
        "Total durable medical equipment products/services rendered by suppliers and ordered by the referring provider. A blank indicates the value is suppressed.",
        "The total charges that suppliers submitted for all durable medical equipment products/services ordered by the referring provider. A blank indicates the value is suppressed.",
        "The Medicare allowed amount for all durable medical equipment products/services ordered by the referring provider. This figure is the sum of the amount Medicare pays, the deductible and coinsurance amounts that the beneficiary is responsible for paying, and any amounts that a third party is responsible for paying. A blank indicates the value is suppressed.",
        "Amount that Medicare paid after deductible and coinsurance amounts have been deducted for all supplier's durable medical equipment line item products/services ordered by the referring provider. A blank indicates the value is suppressed.",
        "Amount that Medicare paid after beneficiary deductible and coinsurance amounts have been deducted for all supplier’s durable medical equipment line item products/services and after standardization of the Medicare payment has been applied. Standardization removes geographic differences in payment rates for individual product/services and makes Medicare payments across geographic areas comparable. A blank indicates the value is suppressed.",
        "A flag indicating the reason the utilization, charge and payment subtotal information for Prosthetics and Orthotics is suppressed.  “*” = Primary suppressed due to Number of Prosthetic and Orthotic Claims between 1 and 10. “#” = Counter suppressed because the claim count from at least one of the corresponding claim count categories (Number of Durable Medical Equipment Claims or Number of Drug and Nutritional Products Claims) is between 1 and 10. Counter suppression prevents the disclosure of a primary suppressed value when all categories sum to the total value.",
        "Number of suppliers rendering prosthetic and orthotic products/services. A blank indicates the value is suppressed.",
        "Total number of unique prosthetic and orthotic HCPCS codes billed by suppliers and ordered by the referring provider. A blank indicates the value is suppressed.",
        "Total number of unique beneficiaries associated with prosthetic and orthotic claims submitted by suppliers and ordered by the referring provider. Beneficiary counts fewer than 11 have been suppressed to protect the privacy of Medicare beneficiaries. A blank indicates the value is suppressed.",
        "Total number of prosthetic and orthotic claims submitted by suppliers, reflecting products/services ordered by the referring provider. A blank indicates the value is suppressed.",
        "Total prosthetic and orthotic products/services rendered by suppliers and ordered by the referring provider. A blank indicates the value is suppressed..",
        "The total charges that suppliers submitted for all prosthetic and orthotic products/services ordered by the referring provider. A blank indicates the value is suppressed.",
        "The Medicare allowed amount for all prosthetic and orthotic products/services ordered by the referring provider. This figure is the sum of the amount Medicare pays, the deductible and coinsurance amounts that the beneficiary is responsible for paying, and any amounts that a third party is responsible for paying. A blank indicates the value is suppressed.",
        "Amount that Medicare paid after deductible and coinsurance amounts have been deducted for all supplier prosthetic and orthotic line item products/services ordered by the referring provider. A blank indicates the value is suppressed.",
        "Amount that Medicare paid after beneficiary deductible and coinsurance amounts have been deducted for all supplier’s prosthetic and orthotic line item products/services and after standardization of the Medicare payment has been applied. Standardization removes geographic differences in payment rates for individual product/services and makes Medicare payments across geographic areas comparable. A blank indicates the value is suppressed.",
        "A flag indicating the reason the utilization, charge and payment subtotal information for Drug and Nutritional products is suppressed. “*” = Primary suppressed due to Number of Drug and Nutritional Products Claims between 1 and 10. “#” = Counter suppressed because the claim count from at least one of the corresponding claim count categories (Number of Durable Medical Equipment Claims or Number of Orthotic and Prosthetic Claims) is between 1 and 10. Counter suppression prevents the disclosure of a primary suppressed value when all categories sum to the total value.",
        "Number of suppliers rendering drug and nutritional products/services. A blank indicates the value is suppressed.",
        "Total number of unique drug and nutritional product HCPCS codes billed by suppliers and ordered by the referring provider. A blank indicates the value is suppressed.",
        "Total number of unique beneficiaries associated with drug and nutritional product claims submitted by suppliers and ordered by the referring provider. Beneficiary counts fewer than 11 have been suppressed to protect the privacy of Medicare beneficiaries. A blank indicates the value is suppressed.",
        "Total number of drug and nutritional product claims submitted by suppliers, reflecting services ordered by the referring provider. A blank indicates the value is suppressed.",
        "Total drug and nutritional products/services rendered by suppliers and ordered by the referring provider. A blank indicates the value is suppressed.",
        "The total charges that suppliers submitted for drug and nutritional products/services ordered by the referring provider. A blank indicates the value is suppressed.",
        "The Medicare allowed amount for drug and nutritional products/services ordered by the referring provider. This figure is the sum of the amount Medicare pays, the deductible and coinsurance amounts that the beneficiary is responsible for paying, and any amounts that a third party is responsible for paying. A blank indicates the value is suppressed.",
        "Amount that Medicare paid suppliers after deductible and coinsurance amounts have been deducted for drug and nutritional line item products/services ordered by the referring provider. A blank indicates the value is suppressed.",
        "Amount that Medicare paid after beneficiary deductible and coinsurance amounts have been deducted for all supplier’s drug and nutritional line item products/services and after standardization of the Medicare payment has been applied."
    ],
    "sample_rows": [
        {
            "referring_npi": "1659567360",
            "provider_last_name": "BARNETT",
            "provider_first_name": "CATHERINE",
            "provider_middle_initial": "A",
            "provider_credentials": "NP-C",
            "provider_gender": "F",
            "provider_entity_code": "I",
            "provider_street_1": "120 E BEAUREGARD AVE",
            "provider_street_2": null,
            "provider_city": "SAN ANGELO",
            "provider_state": "TX",
            "provider_zip": "769035919",
            "provider_country": "US",
            "provider_type": "Certified Clinical Nurse Specialist",
            "provider_type_flag": "S",
            "number_of_suppliers": 27,
            "number_of_supplier_hcpcs": 46,
            "number_of_supplier_beneficiaries": 38,
            "number_of_supplier_claims": 155,
            "number_of_supplier_services": 6203,
            "supplier_submitted_charges": 38144.76,
            "supplier_medicare_allowed_amount": 18747.85,
            "supplier_medicare_payment_amount": 14168.85,
            "supplier_medicare_standard_payment_amount": 16585.37,
            "durable_medical_equipment_suppression_indicator": null,
            "dme_suppliers": 20,
            "dme_hcpcs": 32,
            "dme_beneficiaries": 34,
            "dme_claims": 139,
            "dme_services": 5776,
            "dme_submitted_charges": 31803.2,
            "dme_medicare_allowed_amount": 14002.87,
            "dme_medicare_payment_amount": 10562.97,
            "dme_medicare_standard_payment_amount": 12782.53,
            "prosthetic_and_orthotic_suppression_indicator": null,
            "po_suppliers": 8,
            "po_hcpcs": 13,
            "po_beneficiaries": null,
            "po_claims": 16,
            "po_services": 407,
            "po_submitted_charges": 5314.56,
            "po_medicare_allowed_amount": 4084.98,
            "po_medicare_payment_amount": 3155.96,
            "po_medicare_standard_payment_amount": 3352.92,
            "drug_and_nutritional_suppression_indicator": null,
            "number_of_drug_and_nutritional_products_suppliers": 5,
            "number_of_drug_and_nutritional_products_hcpcs": 1,
            "number_of_drug_and_nutritional_products_beneficiaries": null,
            "number_of_drug_and_nutritional_products_claims": 20,
            "number_of_drug_and_nutritional_products_services": 20,
            "drug_and_nutritional_products_submitted_charges": 1027.0,
            "drug_and_nutritional_products_medicare_allowed_amount": 660.0,
            "drug_and_nutritional_products_medicare_payment_amount": 449.92,
            "drug_and_nutritional_products_medicare_standard_payment_amount": 449.92
        },
        {
            "referring_npi": "1487782025",
            "provider_last_name": "RUGHWANI",
            "provider_first_name": "NISHA",
            "provider_middle_initial": "A",
            "provider_credentials": "M.D,",
            "provider_gender": "F",
            "provider_entity_code": "I",
            "provider_street_1": "1440 MADISON AVE",
            "provider_street_2": null,
            "provider_city": "NEW YORK",
            "provider_state": "NY",
            "provider_zip": "100296508",
            "provider_country": "US",
            "provider_type": "Geriatric Medicine",
            "provider_type_flag": "S",
            "number_of_suppliers": 25,
            "number_of_supplier_hcpcs": 46,
            "number_of_supplier_beneficiaries": 35,
            "number_of_supplier_claims": 136,
            "number_of_supplier_services": 1846,
            "supplier_submitted_charges": 19956.51,
            "supplier_medicare_allowed_amount": 11307.3,
            "supplier_medicare_payment_amount": 8598.77,
            "supplier_medicare_standard_payment_amount": 11451.75,
            "durable_medical_equipment_suppression_indicator": null,
            "dme_suppliers": 22,
            "dme_hcpcs": 40,
            "dme_beneficiaries": 33,
            "dme_claims": 122,
            "dme_services": 830,
            "dme_submitted_charges": 15920.82,
            "dme_medicare_allowed_amount": 7756.17,
            "dme_medicare_payment_amount": 5814.66,
            "dme_medicare_standard_payment_amount": 8423.15,
            "prosthetic_and_orthotic_suppression_indicator": null,
            "po_suppliers": 5,
            "po_hcpcs": 5,
            "po_beneficiaries": null,
            "po_claims": 14,
            "po_services": 1004,
            "po_submitted_charges": 3639.69,
            "po_medicare_allowed_amount": 3155.13,
            "po_medicare_payment_amount": 2473.67,
            "po_medicare_standard_payment_amount": 2718.16,
            "drug_and_nutritional_suppression_indicator": null,
            "number_of_drug_and_nutritional_products_suppliers": 5,
            "number_of_drug_and_nutritional_products_hcpcs": 1,
            "number_of_drug_and_nutritional_products_beneficiaries": null,
            "number_of_drug_and_nutritional_products_claims": 12,
            "number_of_drug_and_nutritional_products_services": 12,
            "drug_and_nutritional_products_submitted_charges": 396.0,
            "drug_and_nutritional_products_medicare_allowed_amount": 396.0,
            "drug_and_nutritional_products_medicare_payment_amount": 310.44,
            "drug_and_nutritional_products_medicare_standard_payment_amount": 310.44
        },
        {
            "referring_npi": "1649460726",
            "provider_last_name": "CHRISTIE",
            "provider_first_name": "ALLISON",
            "provider_middle_initial": "J",
            "provider_credentials": "M.D., M.P.H.",
            "provider_gender": "F",
            "provider_entity_code": "I",
            "provider_street_1": "607 WASHINGTON HWY",
            "provider_street_2": null,
            "provider_city": "MORRISVILLE",
            "provider_state": "VT",
            "provider_zip": "056618652",
            "provider_country": "US",
            "provider_type": "Pediatric Medicine",
            "provider_type_flag": "S",
            "number_of_suppliers": 30,
            "number_of_supplier_hcpcs": 45,
            "number_of_supplier_beneficiaries": 62,
            "number_of_supplier_claims": 264,
            "number_of_supplier_services": 5851,
            "supplier_submitted_charges": 73326.29,
            "supplier_medicare_allowed_amount": 28051.18,
            "supplier_medicare_payment_amount": 20773.03,
            "supplier_medicare_standard_payment_amount": 23686.55,
            "durable_medical_equipment_suppression_indicator": null,
            "dme_suppliers": 22,
            "dme_hcpcs": 24,
            "dme_beneficiaries": 53,
            "dme_claims": 233,
            "dme_services": 2842,
            "dme_submitted_charges": 57706.56,
            "dme_medicare_allowed_amount": 17490.35,
            "dme_medicare_payment_amount": 12832.79,
            "dme_medicare_standard_payment_amount": 15486.65,
            "prosthetic_and_orthotic_suppression_indicator": null,
            "po_suppliers": 10,
            "po_hcpcs": 20,
            "po_beneficiaries": 13,
            "po_claims": 31,
            "po_services": 2985,
            "po_submitted_charges": 14782.73,
            "po_medicare_allowed_amount": 9768.83,
            "po_medicare_payment_amount": 7345.23,
            "po_medicare_standard_payment_amount": 7604.89,
            "drug_and_nutritional_suppression_indicator": null,
            "number_of_drug_and_nutritional_products_suppliers": 5,
            "number_of_drug_and_nutritional_products_hcpcs": 1,
            "number_of_drug_and_nutritional_products_beneficiaries": null,
            "number_of_drug_and_nutritional_products_claims": 24,
            "number_of_drug_and_nutritional_products_services": 24,
            "drug_and_nutritional_products_submitted_charges": 837.0,
            "drug_and_nutritional_products_medicare_allowed_amount": 792.0,
            "drug_and_nutritional_products_medicare_payment_amount": 595.01,
            "drug_and_nutritional_products_medicare_standard_payment_amount": 595.01
        },
        {
            "referring_npi": "1851614838",
            "provider_last_name": "SIDES",
            "provider_first_name": "CONNIE",
            "provider_middle_initial": "J",
            "provider_credentials": "AHCNS",
            "provider_gender": "F",
            "provider_entity_code": "I",
            "provider_street_1": "1 HOSPITAL DR",
            "provider_street_2": null,
            "provider_city": "COLUMBIA",
            "provider_state": "MO",
            "provider_zip": "652120001",
            "provider_country": "US",
            "provider_type": "Certified Clinical Nurse Specialist",
            "provider_type_flag": "S",
            "number_of_suppliers": 5,
            "number_of_supplier_hcpcs": 23,
            "number_of_supplier_beneficiaries": 14,
            "number_of_supplier_claims": 62,
            "number_of_supplier_services": 12157,
            "supplier_submitted_charges": 31574.71,
            "supplier_medicare_allowed_amount": 12982.54,
            "supplier_medicare_payment_amount": 10178.33,
            "supplier_medicare_standard_payment_amount": 10279.58,
            "durable_medical_equipment_suppression_indicator": null,
            "dme_suppliers": 2,
            "dme_hcpcs": 9,
            "dme_beneficiaries": null,
            "dme_claims": 38,
            "dme_services": 294,
            "dme_submitted_charges": 5140.42,
            "dme_medicare_allowed_amount": 2479.11,
            "dme_medicare_payment_amount": 1943.59,
            "dme_medicare_standard_payment_amount": 2031.86,
            "prosthetic_and_orthotic_suppression_indicator": null,
            "po_suppliers": 4,
            "po_hcpcs": 11,
            "po_beneficiaries": null,
            "po_claims": 13,
            "po_services": 596,
            "po_submitted_charges": 2992.59,
            "po_medicare_allowed_amount": 2439.16,
            "po_medicare_payment_amount": 1912.33,
            "po_medicare_standard_payment_amount": 1925.31,
            "drug_and_nutritional_suppression_indicator": null,
            "number_of_drug_and_nutritional_products_suppliers": 1,
            "number_of_drug_and_nutritional_products_hcpcs": 3,
            "number_of_drug_and_nutritional_products_beneficiaries": null,
            "number_of_drug_and_nutritional_products_claims": 16,
            "number_of_drug_and_nutritional_products_services": 11267,
            "drug_and_nutritional_products_submitted_charges": 23441.7,
            "drug_and_nutritional_products_medicare_allowed_amount": 8064.27,
            "drug_and_nutritional_products_medicare_payment_amount": 6322.41,
            "drug_and_nutritional_products_medicare_standard_payment_amount": 6322.41
        },
        {
            "referring_npi": "1114151461",
            "provider_last_name": "BOLAND",
            "provider_first_name": "JUDITH",
            "provider_middle_initial": "R",
            "provider_credentials": "RN, MSN, ACNS-BC",
            "provider_gender": "F",
            "provider_entity_code": "I",
            "provider_street_1": "2305 SOUTH 65 HIGHWAY",
            "provider_street_2": null,
            "provider_city": "MARSHALL",
            "provider_state": "MO",
            "provider_zip": "653403702",
            "provider_country": "US",
            "provider_type": "Certified Clinical Nurse Specialist",
            "provider_type_flag": "S",
            "number_of_suppliers": 7,
            "number_of_supplier_hcpcs": 33,
            "number_of_supplier_beneficiaries": 15,
            "number_of_supplier_claims": 127,
            "number_of_supplier_services": 5845,
            "supplier_submitted_charges": 16962.9,
            "supplier_medicare_allowed_amount": 13271.24,
            "supplier_medicare_payment_amount": 10031.89,
            "supplier_medicare_standard_payment_amount": 10068.21,
            "durable_medical_equipment_suppression_indicator": null,
            "dme_suppliers": 7,
            "dme_hcpcs": 25,
            "dme_beneficiaries": 15,
            "dme_claims": 116,
            "dme_services": 1537,
            "dme_submitted_charges": 12332.61,
            "dme_medicare_allowed_amount": 8926.33,
            "dme_medicare_payment_amount": 6808.68,
            "dme_medicare_standard_payment_amount": 6843.72,
            "prosthetic_and_orthotic_suppression_indicator": null,
            "po_suppliers": 1,
            "po_hcpcs": 3,
            "po_beneficiaries": null,
            "po_claims": 12,
            "po_services": 103,
            "po_submitted_charges": 289.76,
            "po_medicare_allowed_amount": 266.45,
            "po_medicare_payment_amount": 192.3,
            "po_medicare_standard_payment_amount": 193.58,
            "drug_and_nutritional_suppression_indicator": null,
            "number_of_drug_and_nutritional_products_suppliers": 2,
            "number_of_drug_and_nutritional_products_hcpcs": 5,
            "number_of_drug_and_nutritional_products_beneficiaries": null,
            "number_of_drug_and_nutritional_products_claims": 16,
            "number_of_drug_and_nutritional_products_services": 4205,
            "drug_and_nutritional_products_submitted_charges": 4340.53,
            "drug_and_nutritional_products_medicare_allowed_amount": 4078.46,
            "drug_and_nutritional_products_medicare_payment_amount": 3030.91,
            "drug_and_nutritional_products_medicare_standard_payment_amount": 3030.91
        }
    ]
}