{
    "table_name": "productreview",
    "table_fullname": "spider2-public-data.AdventureWorks.productreview",
    "column_names": [
        "comments",
        "modifieddate",
        "rating",
        "modifeddate",
        "emailaddress",
        "productreviewid",
        "reviewername",
        "reviewdate",
        "productid"
    ],
    "column_types": [
        "STRING",
        "TIMESTAMP",
        "INT64",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "TIMESTAMP",
        "INT64"
    ],
    "nested_column_names": [
        "comments",
        "modifieddate",
        "rating",
        "modifeddate",
        "emailaddress",
        "productreviewid",
        "reviewername",
        "reviewdate",
        "productid"
    ],
    "nested_column_types": [
        "STRING",
        "TIMESTAMP",
        "INT64",
        "STRING",
        "STRING",
        "INT64",
        "STRING",
        "TIMESTAMP",
        "INT64"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "comments": "I can't believe I'm singing the praises of a pair of socks, but I just came back from a grueling\n3-day ride and these socks really helped make the trip a blast. They're lightweight yet really cushioned my feet all day. \nThe reinforced toe is nearly bullet-proof and I didn't experience any problems with rubbing or blisters like I have with\nother brands. I know it sounds silly, but it's always the little stuff (like comfortable feet) that makes or breaks a long trip.\nI won't go on another trip without them!",
            "modifieddate": "2013-09-18 00:00:00+00:00",
            "rating": 5,
            "modifeddate": null,
            "emailaddress": "john@fourthcoffee.com",
            "productreviewid": 1,
            "reviewername": "John Smith",
            "reviewdate": "2013-09-18 00:00:00+00:00",
            "productid": 709
        },
        {
            "comments": "A little on the heavy side, but overall the entry/exit is easy in all conditions. I've used these pedals for \nmore than 3 years and I've never had a problem. Cleanup is easy. Mud and sand don't get trapped. I would like \nthem even better if there was a weight reduction. Maybe in the next design. Still, I would recommend them to a friend.",
            "modifieddate": "2013-11-13 00:00:00+00:00",
            "rating": 4,
            "modifeddate": null,
            "emailaddress": "david@graphicdesigninstitute.com",
            "productreviewid": 2,
            "reviewername": "David",
            "reviewdate": "2013-11-13 00:00:00+00:00",
            "productid": 937
        },
        {
            "comments": "Maybe it's just because I'm new to mountain biking, but I had a terrible time getting use\nto these pedals. In my first outing, I wiped out trying to release my foot. Any suggestions on\nways I can adjust the pedals, or is it just a learning curve thing?",
            "modifieddate": "2013-11-15 00:00:00+00:00",
            "rating": 2,
            "modifeddate": null,
            "emailaddress": "jill@margiestravel.com",
            "productreviewid": 3,
            "reviewername": "Jill",
            "reviewdate": "2013-11-15 00:00:00+00:00",
            "productid": 937
        },
        {
            "comments": "The Road-550-W from Adventure Works Cycles is everything it's advertised to be. Finally, a quality bike that\nis actually built for a woman and provides control and comfort in one neat package. The top tube is shorter, the suspension is weight-tuned and there's a much shorter reach to the brake\nlevers. All this adds up to a great mountain bike that is sure to accommodate any woman's anatomy. In addition to getting the size right, the saddle is incredibly comfortable. \nAttention to detail is apparent in every aspect from the frame finish to the careful design of each component. Each component is a solid performer without any fluff. \nThe designers clearly did their homework and thought about size, weight, and funtionality throughout. And at less than 19 pounds, the bike is manageable for even the most petite cyclist.\n\nWe had 5 riders take the bike out for a spin and really put it to the test. The results were consistent and very positive. Our testers loved the manuverability \nand control they had with the redesigned frame on the 550-W. A definite improvement over the 2012 design. Four out of five testers listed quick handling\nand responsivness were the key elements they noticed. Technical climbing and on the flats, the bike just cruises through the rough. Tight corners and obstacles were handled effortlessly. The fifth tester was more impressed with the smooth ride. The heavy-duty shocks absorbed even the worst bumps and provided a soft ride on all but the \nnastiest trails and biggest drops. The shifting was rated superb and typical of what we've come to expect from Adventure Works Cycles. On descents, the bike handled flawlessly and tracked very well. The bike is well balanced front-to-rear and frame flex was minimal. In particular, the testers\nnoted that the brake system had a unique combination of power and modulation.  While some brake setups can be overly touchy, these brakes had a good\namount of power, but also a good feel that allows you to apply as little or as much braking power as is needed. Second is their short break-in period. We found that they tend to break-in well before\nthe end of the first ride; while others take two to three rides (or more) to come to full power. \n\nOn the negative side, the pedals were not quite up to our tester's standards. \nJust for fun, we experimented with routine maintenance tasks. Overall we found most operations to be straight forward and easy to complete. The only exception was replacing the front wheel. The maintenance manual that comes\nwith the bike say to install the front wheel with the axle quick release or bolt, then compress the fork a few times before fastening and tightening the two quick-release mechanisms on the bottom of the dropouts. This is to seat the axle in the dropouts, and if you do not\ndo this, the axle will become seated after you tightened the two bottom quick releases, which will then become loose. It's better to test the tightness carefully or you may notice that the two bottom quick releases have come loose enough to fall completely open. And that's something you don't want to experience\nwhile out on the road! \n\nThe Road-550-W frame is available in a variety of sizes and colors and has the same durable, high-quality aluminum that AWC is known for. At a MSRP of just under $1125.00, it's comparable in price to its closest competitors and\nwe think that after a test drive you'l find the quality and performance above and beyond . You'll have a grin on your face and be itching to get out on the road for more. While designed for serious road racing, the Road-550-W would be an excellent choice for just about any terrain and \nany level of experience. It's a huge step in the right direction for female cyclists and well worth your consideration and hard-earned money.",
            "modifieddate": "2013-11-15 00:00:00+00:00",
            "rating": 5,
            "modifeddate": null,
            "emailaddress": "laura@treyresearch.net",
            "productreviewid": 4,
            "reviewername": "Laura Norman",
            "reviewdate": "2013-11-15 00:00:00+00:00",
            "productid": 798
        }
    ]
}