{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_160",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_160",
    "column_names": [
        "grouping",
        "classification",
        "specialization",
        "notes",
        "definition",
        "code"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "101Y00000X",
            "grouping": "",
            "classification": "Counselor",
            "specialization": "",
            "definition": "A provider who is trained and educated in the performance of behavior health services through interpersonal communications and analysis. Training and education at the specialty level usually requires a master’s degree and clinical experience and supervision for licensure or certification.",
            "notes": "Sources: Abridged from definitions provided by the National Board of Certified Counselors and the American Association of Pastoral Counselors."
        },
        {
            "code": "102L00000X",
            "grouping": "",
            "classification": "Psychoanalyst",
            "specialization": "",
            "definition": "Psychoanalysis is a comprehensive, theoretical framework which, when applied to a treatment process, consists of an intensive verbal, therapeutic relationship between an analyst and an analysand which aims for symptom relief, emotional growth, and personal integration. The psychoanalytic treatment process includes, but is not limited to, the recognition of unconscious processes and conflicts; the significance of developmental influences; and the impact of resistances, defenses, transference and countertransference phenomena. Treatment is enhanced by an understanding developed in the analyst’s training and personal analysis of unconscious manifestations, such as dreams, slips of the tongue, fantasies and day dreams. Psychoanalytic technique varies in relation to theoretical orientation.",
            "notes": "Source:  Registry of Psychoanalysts published by the National Association for the Advancement of Psychoanalysis [1/1/2007: new; 7/1/2007: definition changed, source changed]"
        },
        {
            "code": "103K00000X",
            "grouping": "",
            "classification": "Behavioral Analyst",
            "specialization": "",
            "definition": "A behavior analyst is qualified by at least a master’s degree and Behavior Analyst Certification Board certification and/or a state-issued credential (such as a license) to practice behavior analysis independently. Behavior analysts provide the required supervision to assistant behavior analysts and behavior technicians. A behavior analyst delivers services consistent with the dimensions of applied behavior analysis. Common services may include, but are not limited to, conducting behavioral assessments, analyzing data, writing and revising behavior-analytic treatment plans, training others to implement components of treatment plans, and overseeing implementation of treatment plans.",
            "notes": "Source: Association of Professional Behavior Analysts, www.apbahome.net and Behavior Analyst Certification Board (http://www.bacb.com) [7/1/2008: new, 1/1/2016: modified definition]"
        },
        {
            "code": "103T00000X",
            "grouping": "",
            "classification": "Psychologist",
            "specialization": "",
            "definition": "A psychologist is an individual who is licensed to practice psychology which is defined as the observation, description, evaluation, interpretation, and modification of human behavior by the application of psychological principles, methods, and procedures, for the purpose of preventing or eliminating symptomatic, maladaptive, or undesired behavior and of enhancing interpersonal relationships, work and life adjustment, personal effectiveness, behavioral health, and mental health.  The practice of psychology includes, but is not limited to, psychological testing and the evaluation or assessment of personal characteristics, such as intelligence, personality, abilities, interests, aptitudes, and neuropsychological functioning; counseling, psychoanalysis, psychotherapy, hypnosis, biofeedback, and behavior analysis and therapy; diagnosis and treatment of mental and emotional disorder or disability, alcoholism and substance abuse, disorders of habit or conduct, as well as of the psychological aspects of physical illness, accident, injury, or disability; and psycheducational evaluation, therapy, remediation, and consultation.  Psychological services may be rendered to individuals, families, groups and the public.",
            "notes": "Source:  American Psychological Association [1/1/2007: modified definition]"
        },
        {
            "code": "103TH0004X",
            "grouping": "",
            "classification": "Psychologist",
            "specialization": "Health",
            "definition": "The distinct focus of the clinical health psychologist is on physical health problems. A clinical health psychologist has special expertise or training in clinical health psychology <strong><i>and</strong> applies scientific knowledge of the interrelationships among behavioral, emotional, cognitive, social and biological components in health and disease to the promotion and maintenance of health; the prevention, treatment and rehabilitation of illness and disability; and the improvement of the health care system. Clinical health psychologists are dedicated to the development of knowledge regarding the interface between behavior and health, and to the delivery of high quality services based on that knowledge to individuals, families, and health care.",
            "notes": "Source: American Psychological Association Commission for the Recognition of Specialties and Proficiencies in Professional Psychology, 2008.  [1/1/2007: new, 7/1/2008: definiton added, source added]"
        }
    ]
}