{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_170",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_170",
    "column_names": [
        "notes",
        "specialization",
        "grouping",
        "code",
        "definition",
        "classification"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "193400000X",
            "grouping": "Group",
            "classification": "Single Specialty",
            "specialization": "",
            "definition": "A business group of one or more individual practitioners, all of who practice with the same area of specialization.",
            "notes": "[7/1/2003: new]"
        },
        {
            "code": "251B00000X",
            "grouping": "Agencies",
            "classification": "Case Management",
            "specialization": "",
            "definition": "An organization that is responsible for providing case management services.  The agency provides services which assist an individual in gaining access to needed medical, social, educational, and/or other services.  Case management services may be used to locate, coordinate, and monitor necessary appropriate services.  It may be used to encourage the use of cost-effective medical care by referrals to appropriate providers and to discourage over utilization of costly services.  Case management may also serve to provide necessary coordination of non-medical services such as vocational rehabilitation, education, employment, when the services provided enable the individual to function at the highest level.",
            "notes": "Source:  CMS State Medicaid Manual Section 4442.3 [7/1/2006: definition modified]"
        },
        {
            "code": "251X00000X",
            "grouping": "Agencies",
            "classification": "Supports Brokerage",
            "specialization": "",
            "definition": "A provider of service/function that assists participating individuals to make informed decisions about what will work best for them is consistent with their needs and reflects their individual circumstances. Serving as the agent of the individual, the service is available to assist in identifying immediate and long-term needs, developing options to meet those needs and accessing identified supports and services and may include assistance with recruiting, screening, hiring, and training in-home support providers. A family or person-centered planning approach is used. Supports Brokerage offers practical skills training to enable families and individuals to remain independent. Examples of skills training include providing information on recruiting and hiring personal care workers, managing personal care workers and providing information on effective communication and problem solving. The service/function provides sufficient information to assure that individuals understand the responsibilities involved with self-direction and assist in the development of an effective back-up and emergency plan. Plans may elect to fulfill the requirement of this service/function using a self-directed case manager or creating a distinct service. The Supports Brokerage documents the need for assistive services, planning for and documenting the use of excess funds and locating and maintaining services.",
            "notes": "Source:  CMS Independence Plus Waiver template. [7/1/2006: new]"
        },
        {
            "code": "281P00000X",
            "grouping": "Hospitals",
            "classification": "Chronic Disease Hospital",
            "specialization": "",
            "definition": "(1) A hospital including a physical plant and personnel that provides multidisciplinary diagnosis and treatment for diseases that have one or more of the following characteristics: is permanent; leaves residual disability; is caused by nonreversible pathological alteration; requires special training of the patient for rehabilitation; and/or may be expected to require a long period of supervision or care. In addition, patients require the safety, security, and shelter of these specialized inpatient or partial hospitalization settings. (2) A hospital that provides medical and skilled nursing services to patients with long-term illnesses who are not in an acute phase but who require an intensity of services not available in nursing homes.",
            "notes": "Source: (1) Expanded from Rhea, Ott, and Shafritz, The Facts On File Dictionary of Health Care Management, New York: Facts On File Publications, 1988."
        },
        {
            "code": "282J00000X",
            "grouping": "Hospitals",
            "classification": "Religious Nonmedical Health Care Institution",
            "specialization": "",
            "definition": "Furnishes only nonmedical nursing items and services to patients who choose to rely solely upon a religious method of healing, and for whom the acceptance of medical services would be inconsistent with their religious beliefs.  Furnishes nonmedical items and services exclusively through nonmedical nursing personnel who are experienced in caring for the physical needs of nonmedical patients.  For example, caring for the physical needs such as assistance with activities of daily living; assistance in moving, positioning, and ambulation; nutritional needs; and comfort and support measures.  Furnishes nonmedical items and services to inpatients on a 24-hour basis.  Does not furnish, on the basis of religious beliefs, through its personnel or otherwise, medical items and services (including any medical screening, examination, diagnosis, prognosis, treatment, or the administration of drugs) for its patients.",
            "notes": "Source:  Centers for Medicare & Medicaid Services, http://www.cms.hhs.gov/CertificationandComplianc/19_RNHCIs.asp#TopOfPage [7/1/2006: new]"
        }
    ]
}