{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_121",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_121",
    "column_names": [
        "notes",
        "classification",
        "specialization",
        "code",
        "definition",
        "grouping"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "193200000X",
            "grouping": "Group",
            "classification": "Multi-Specialty",
            "specialization": "",
            "definition": "A business group of one or more individual practitioners, who practice with different areas of specialization.",
            "notes": "[7/1/2003: new]"
        },
        {
            "code": "193400000X",
            "grouping": "Group",
            "classification": "Single Specialty",
            "specialization": "",
            "definition": "A business group of one or more individual practitioners, all of who practice with the same area of specialization.",
            "notes": "[7/1/2003: new]"
        },
        {
            "code": "251E00000X",
            "grouping": "Agencies",
            "classification": "Home Health",
            "specialization": "",
            "definition": "A public agency or private organization, or a subdivision of such an agency or organization, that is primarily engaged in providing skilled nursing services and other therapeutic services, such as physical therapy, speech-language pathology services, or occupational therapy, medical social services, and home health aide services. It has policies established by a professional group associated with the agency or organization (including at least one physician and one registered nurse) to govern the services and provides for supervision of such services by a physician or a registered nurse; maintains clinical records on all patients; is licensed in accordance with State or local law or is approved by the State or local licensing agency as meeting the licensing standards, where applicable; and meets other conditions found by the Secretary of Health and Human Services to be necessary for health and safety.",
            "notes": "Source:  CFR42 Chapter IV Part 484,  http://www.access.gpo.gov/nara/cfr/waisidx_99/42cfr484_99.html [7/1/2007: definition added, source added]"
        },
        {
            "code": "251S00000X",
            "grouping": "Agencies",
            "classification": "Community/Behavioral Health",
            "specialization": "",
            "definition": "A private or public agency usually under local government jurisdiction, responsible for assuring the delivery of community based mental health, mental retardation, substance abuse and/or behavioral health services to individuals with those disabilities. Services may range from companion care, respite, transportation, community integration, crisis intervention and stabilization, supported employment, day support, prevocational services, residential support, therapeutic and supportive consultation, environmental modifications, intensive in-home therapy and day treatment, in addition to traditional mental health and behavioral treatment.",
            "notes": "Source:  National Medicaid EDI HIPAA NPI Sub Work Group [1/1/2007: modified definition]"
        },
        {
            "code": "251X00000X",
            "grouping": "Agencies",
            "classification": "Supports Brokerage",
            "specialization": "",
            "definition": "A provider of service/function that assists participating individuals to make informed decisions about what will work best for them is consistent with their needs and reflects their individual circumstances. Serving as the agent of the individual, the service is available to assist in identifying immediate and long-term needs, developing options to meet those needs and accessing identified supports and services and may include assistance with recruiting, screening, hiring, and training in-home support providers. A family or person-centered planning approach is used. Supports Brokerage offers practical skills training to enable families and individuals to remain independent. Examples of skills training include providing information on recruiting and hiring personal care workers, managing personal care workers and providing information on effective communication and problem solving. The service/function provides sufficient information to assure that individuals understand the responsibilities involved with self-direction and assist in the development of an effective back-up and emergency plan. Plans may elect to fulfill the requirement of this service/function using a self-directed case manager or creating a distinct service. The Supports Brokerage documents the need for assistive services, planning for and documenting the use of excess funds and locating and maintaining services.",
            "notes": "Source:  CMS Independence Plus Waiver template. [7/1/2006: new]"
        }
    ]
}