{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_141",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_141",
    "column_names": [
        "notes",
        "classification",
        "code",
        "definition",
        "specialization",
        "grouping"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "251300000X",
            "grouping": "Agencies",
            "classification": "Local Education Agency (LEA)",
            "specialization": "",
            "definition": "The term local education agency means a public board of education or other public authority legally constituted within a State to either provide administrative control or direction of, or perform a service function for public schools serving individuals ages 0 – 21 in a state, city, county, township, school district, or other political subdivision including a combination of school districts or counties recognized in a State as an administrative agency for its public schools.  An LEA may provide, or employ professional who provide, services to children included in the Individuals with Disabilities Education Act (IDEA), such services may include, but are not limited to, such medical services as physical, occupational, and speech therapy.",
            "notes": "Source: Portions of IDEA Regulations Part B (34 CFR Part 300.18, Assistance to States for the Education of Children with Disabilities)  [1/1/2006: new]"
        },
        {
            "code": "251B00000X",
            "grouping": "Agencies",
            "classification": "Case Management",
            "specialization": "",
            "definition": "An organization that is responsible for providing case management services.  The agency provides services which assist an individual in gaining access to needed medical, social, educational, and/or other services.  Case management services may be used to locate, coordinate, and monitor necessary appropriate services.  It may be used to encourage the use of cost-effective medical care by referrals to appropriate providers and to discourage over utilization of costly services.  Case management may also serve to provide necessary coordination of non-medical services such as vocational rehabilitation, education, employment, when the services provided enable the individual to function at the highest level.",
            "notes": "Source:  CMS State Medicaid Manual Section 4442.3 [7/1/2006: definition modified]"
        },
        {
            "code": "251T00000X",
            "grouping": "Agencies",
            "classification": "PACE Provider Organization",
            "specialization": "",
            "definition": "A PACE provider organization is a not-for-profit private or public entity that is primarily engaged in providing PACE services(unique capitated managed care benefits for the frail elderly which include comprehensive medical and social services).  The following characteristics also apply to a PACE organization.  It must:  have a governing board that includes community representation; be able to provide complete PACE services regardless of frequency or duration of services; have a physical site to provide adult day services; have a defined service area; have safeguards against conflict of interest; have demonstrated fiscal soundness and have a formal Participant Bill of Rights.",
            "notes": "Source:  Centers for Medicare and Medicaid, PACE Fact Sheet http://www.cms.hhs.gov/PACE/Downloads/PACEFactSheet.pdf [7/1/2006: new]"
        },
        {
            "code": "253Z00000X",
            "grouping": "Agencies",
            "classification": "In Home Supportive Care",
            "specialization": "",
            "definition": "An In Home Supportive Care Agency provides services in the patient’s home with the goal of enabling the patient to remain at home.  The services provided may include personal care services such as hands-on assistance with activities of daily living (ADLs), e.g., eating, bathing, dressing, and bladder and bowel requirements; homemaker services and instrumental activities of daily living (IADLs), e.g., taking medications, shopping for groceries, laundry, housekeeping, and companionship; and/or supervision or cuing so that a person can perform tasks themselves.",
            "notes": "Source: National Uniform Claim Committee, 2008 [7/1/2008: new]"
        },
        {
            "code": "281P00000X",
            "grouping": "Hospitals",
            "classification": "Chronic Disease Hospital",
            "specialization": "",
            "definition": "(1) A hospital including a physical plant and personnel that provides multidisciplinary diagnosis and treatment for diseases that have one or more of the following characteristics: is permanent; leaves residual disability; is caused by nonreversible pathological alteration; requires special training of the patient for rehabilitation; and/or may be expected to require a long period of supervision or care. In addition, patients require the safety, security, and shelter of these specialized inpatient or partial hospitalization settings. (2) A hospital that provides medical and skilled nursing services to patients with long-term illnesses who are not in an acute phase but who require an intensity of services not available in nursing homes.",
            "notes": "Source: (1) Expanded from Rhea, Ott, and Shafritz, The Facts On File Dictionary of Health Care Management, New York: Facts On File Publications, 1988."
        }
    ]
}