{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_140",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_140",
    "column_names": [
        "classification",
        "specialization",
        "code",
        "notes",
        "grouping",
        "definition"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "193200000X",
            "grouping": "Group",
            "classification": "Multi-Specialty",
            "specialization": "",
            "definition": "A business group of one or more individual practitioners, who practice with different areas of specialization.",
            "notes": "[7/1/2003: new]"
        },
        {
            "code": "251B00000X",
            "grouping": "Agencies",
            "classification": "Case Management",
            "specialization": "",
            "definition": "An organization that is responsible for providing case management services.  The agency provides services which assist an individual in gaining access to needed medical, social, educational, and/or other services.  Case management services may be used to locate, coordinate, and monitor necessary appropriate services.  It may be used to encourage the use of cost-effective medical care by referrals to appropriate providers and to discourage over utilization of costly services.  Case management may also serve to provide necessary coordination of non-medical services such as vocational rehabilitation, education, employment, when the services provided enable the individual to function at the highest level.",
            "notes": "Source:  CMS State Medicaid Manual Section 4442.3 [7/1/2006: definition modified]"
        },
        {
            "code": "251X00000X",
            "grouping": "Agencies",
            "classification": "Supports Brokerage",
            "specialization": "",
            "definition": "A provider of service/function that assists participating individuals to make informed decisions about what will work best for them is consistent with their needs and reflects their individual circumstances. Serving as the agent of the individual, the service is available to assist in identifying immediate and long-term needs, developing options to meet those needs and accessing identified supports and services and may include assistance with recruiting, screening, hiring, and training in-home support providers. A family or person-centered planning approach is used. Supports Brokerage offers practical skills training to enable families and individuals to remain independent. Examples of skills training include providing information on recruiting and hiring personal care workers, managing personal care workers and providing information on effective communication and problem solving. The service/function provides sufficient information to assure that individuals understand the responsibilities involved with self-direction and assist in the development of an effective back-up and emergency plan. Plans may elect to fulfill the requirement of this service/function using a self-directed case manager or creating a distinct service. The Supports Brokerage documents the need for assistive services, planning for and documenting the use of excess funds and locating and maintaining services.",
            "notes": "Source:  CMS Independence Plus Waiver template. [7/1/2006: new]"
        },
        {
            "code": "253J00000X",
            "grouping": "Agencies",
            "classification": "Foster Care Agency",
            "specialization": "",
            "definition": "A Foster Care Agency is an agency that provides foster care as defined in the Code of Federal Regulations (CFR) as \"24-hour substitute care for children outside their own homes.\" Foster care settings include, but are not limited to, nonrelative foster family homes, relative foster homes (whether payments are being made or not), group homes, emergency shelters, residential facilities, and pre-adoptive homes.",
            "notes": "Source: Code Of Federal Regulations, Title 45, Volume 4, Part 1355, Section 57 [1/1/2008: new]"
        },
        {
            "code": "253Z00000X",
            "grouping": "Agencies",
            "classification": "In Home Supportive Care",
            "specialization": "",
            "definition": "An In Home Supportive Care Agency provides services in the patient’s home with the goal of enabling the patient to remain at home.  The services provided may include personal care services such as hands-on assistance with activities of daily living (ADLs), e.g., eating, bathing, dressing, and bladder and bowel requirements; homemaker services and instrumental activities of daily living (IADLs), e.g., taking medications, shopping for groceries, laundry, housekeeping, and companionship; and/or supervision or cuing so that a person can perform tasks themselves.",
            "notes": "Source: National Uniform Claim Committee, 2008 [7/1/2008: new]"
        }
    ]
}