{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_131",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_131",
    "column_names": [
        "classification",
        "grouping",
        "code",
        "notes",
        "specialization",
        "definition"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "193200000X",
            "grouping": "Group",
            "classification": "Multi-Specialty",
            "specialization": "",
            "definition": "A business group of one or more individual practitioners, who practice with different areas of specialization.",
            "notes": "[7/1/2003: new]"
        },
        {
            "code": "251E00000X",
            "grouping": "Agencies",
            "classification": "Home Health",
            "specialization": "",
            "definition": "A public agency or private organization, or a subdivision of such an agency or organization, that is primarily engaged in providing skilled nursing services and other therapeutic services, such as physical therapy, speech-language pathology services, or occupational therapy, medical social services, and home health aide services. It has policies established by a professional group associated with the agency or organization (including at least one physician and one registered nurse) to govern the services and provides for supervision of such services by a physician or a registered nurse; maintains clinical records on all patients; is licensed in accordance with State or local law or is approved by the State or local licensing agency as meeting the licensing standards, where applicable; and meets other conditions found by the Secretary of Health and Human Services to be necessary for health and safety.",
            "notes": "Source:  CFR42 Chapter IV Part 484,  http://www.access.gpo.gov/nara/cfr/waisidx_99/42cfr484_99.html [7/1/2007: definition added, source added]"
        },
        {
            "code": "251J00000X",
            "grouping": "Agencies",
            "classification": "Nursing Care",
            "specialization": "",
            "definition": "A Nursing Care Agency is an entity that provides skilled nursing care through the services of a Registered Nurse (RN) or a Licensed Practical Nurse (LPN), by employees, contracted individuals, or via a registry, in a variety of settings. The agency may engage in providing private duty nursing and/or staffing services.",
            "notes": "Source: National Uniform Claim Committee, 2008 [7/1/2008: modified definition]"
        },
        {
            "code": "251T00000X",
            "grouping": "Agencies",
            "classification": "PACE Provider Organization",
            "specialization": "",
            "definition": "A PACE provider organization is a not-for-profit private or public entity that is primarily engaged in providing PACE services(unique capitated managed care benefits for the frail elderly which include comprehensive medical and social services).  The following characteristics also apply to a PACE organization.  It must:  have a governing board that includes community representation; be able to provide complete PACE services regardless of frequency or duration of services; have a physical site to provide adult day services; have a defined service area; have safeguards against conflict of interest; have demonstrated fiscal soundness and have a formal Participant Bill of Rights.",
            "notes": "Source:  Centers for Medicare and Medicaid, PACE Fact Sheet http://www.cms.hhs.gov/PACE/Downloads/PACEFactSheet.pdf [7/1/2006: new]"
        },
        {
            "code": "253J00000X",
            "grouping": "Agencies",
            "classification": "Foster Care Agency",
            "specialization": "",
            "definition": "A Foster Care Agency is an agency that provides foster care as defined in the Code of Federal Regulations (CFR) as \"24-hour substitute care for children outside their own homes.\" Foster care settings include, but are not limited to, nonrelative foster family homes, relative foster homes (whether payments are being made or not), group homes, emergency shelters, residential facilities, and pre-adoptive homes.",
            "notes": "Source: Code Of Federal Regulations, Title 45, Volume 4, Part 1355, Section 57 [1/1/2008: new]"
        }
    ]
}