{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_161",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_161",
    "column_names": [
        "classification",
        "grouping",
        "notes",
        "code",
        "specialization",
        "definition"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "103TH0100X",
            "grouping": "",
            "classification": "Psychologist",
            "specialization": "Health Service",
            "definition": "A psychologist, certified/licensed at the independent practice level in his/her state, who is duly trained and experienced in the delivery of direct, preventative, assessment, and therapeutic intervention services to individuals whose growth, adjustment, or functioning is actually impaired or is demonstrably at high risk of impairment (1974).",
            "notes": "Source:  National Register of Health Service Providers in Psychology website http://www.nationalregister.org/about_NR.html [7/1/2006: modified title, added definition]"
        },
        {
            "code": "103TP0016X",
            "grouping": "",
            "classification": "Psychologist",
            "specialization": "Prescribing (Medical)",
            "definition": "Those licensed psychologists who have completed specialized, post-doctoral training in psychopharmacology, passed a national proficiency examination in psychopharmacology, and who are authorized by state statute to prescribe medications, in accordance with their state law and state licensing authority, for the evaluation, diagnosis, management and treatment of mental, nervous, emotional, behavioral, and related disorders.",
            "notes": "Source:  Louisiana Academy of Medical Psychologists Note:  Some states issue licenses under Medical Psychologist. [1/1/2007: new]"
        },
        {
            "code": "104100000X",
            "grouping": "",
            "classification": "Social Worker",
            "specialization": "",
            "definition": "A social worker is a person who is qualified by a Social Work degree, and licensed, certified or registered by the state as a social worker to practice within the scope of that license.  A social worker provides assistance and counseling to clients and their families who are dealing with social, emotional and environmental problems. Social work services may be rendered to individuals, families, groups, and the public.",
            "notes": "Source: National Association of Social Workers, 2009 [7/1/2009: definition modified]"
        },
        {
            "code": "106S00000X",
            "grouping": "",
            "classification": "Behavior Technician",
            "specialization": "",
            "definition": "The behavior technician is a paraprofessional who practices under the close, ongoing supervision of a behavior analyst or assistant behavior analyst certified by the Behavior Analyst Certification Board and/or credentialed by a state (such as through licensure). The behavior technician is primarily responsible for the implementation of components of behavior-analytic treatment plans developed by the supervisor. That may include collecting data on treatment targets and conducting certain types of behavioral assessments (e.g., stimulus preference assessments). The behavior technician does not design treatment or assessment plans or procedures but provides services as assigned by the supervisor responsible for his or her work.",
            "notes": "Association of Professional Behavior Analysts, www.apbahome.net and Behavior Analyst Certification Board (http://www.bacb.com) [7/1/2016: new]"
        },
        {
            "code": "111NI0900X",
            "grouping": "",
            "classification": "Chiropractor",
            "specialization": "Internist",
            "definition": "The chiropractic internist may serve as a primary care physician or may see patients referred from other providers for evaluation and co-management. Evaluation is focused on the early detection of functional, nutritional, and pathological disorders. A chiropractic internist utilizes the diagnostic instruments necessary for proper examination. In cases where laboratory examination is necessary, a chiropractic internist utilizes a recognized reference laboratory facility. A chiropractic internist may manage his or her own cases or may refer to another specialist when prudent to do so. The chiropractic internist utilizes documented natural therapies, therapeutic lifestyle changes, patient education and other resources to promote patient health and avoidance of disease.",
            "notes": "Source: American Chiropractic Association, 2008 [7/1/2009: definition added]"
        }
    ]
}