{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_100",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_100",
    "column_names": [
        "definition",
        "notes",
        "grouping",
        "classification",
        "specialization",
        "code"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "251E00000X",
            "grouping": "Agencies",
            "classification": "Home Health",
            "specialization": "",
            "definition": "A public agency or private organization, or a subdivision of such an agency or organization, that is primarily engaged in providing skilled nursing services and other therapeutic services, such as physical therapy, speech-language pathology services, or occupational therapy, medical social services, and home health aide services. It has policies established by a professional group associated with the agency or organization (including at least one physician and one registered nurse) to govern the services and provides for supervision of such services by a physician or a registered nurse; maintains clinical records on all patients; is licensed in accordance with State or local law or is approved by the State or local licensing agency as meeting the licensing standards, where applicable; and meets other conditions found by the Secretary of Health and Human Services to be necessary for health and safety.",
            "notes": "Source:  CFR42 Chapter IV Part 484,  http://www.access.gpo.gov/nara/cfr/waisidx_99/42cfr484_99.html [7/1/2007: definition added, source added]"
        },
        {
            "code": "251J00000X",
            "grouping": "Agencies",
            "classification": "Nursing Care",
            "specialization": "",
            "definition": "A Nursing Care Agency is an entity that provides skilled nursing care through the services of a Registered Nurse (RN) or a Licensed Practical Nurse (LPN), by employees, contracted individuals, or via a registry, in a variety of settings. The agency may engage in providing private duty nursing and/or staffing services.",
            "notes": "Source: National Uniform Claim Committee, 2008 [7/1/2008: modified definition]"
        },
        {
            "code": "251S00000X",
            "grouping": "Agencies",
            "classification": "Community/Behavioral Health",
            "specialization": "",
            "definition": "A private or public agency usually under local government jurisdiction, responsible for assuring the delivery of community based mental health, mental retardation, substance abuse and/or behavioral health services to individuals with those disabilities. Services may range from companion care, respite, transportation, community integration, crisis intervention and stabilization, supported employment, day support, prevocational services, residential support, therapeutic and supportive consultation, environmental modifications, intensive in-home therapy and day treatment, in addition to traditional mental health and behavioral treatment.",
            "notes": "Source:  National Medicaid EDI HIPAA NPI Sub Work Group [1/1/2007: modified definition]"
        },
        {
            "code": "252Y00000X",
            "grouping": "Agencies",
            "classification": "Early Intervention Provider Agency",
            "specialization": "",
            "definition": "Early intervention services are an effective way to address the needs of infants and toddlers who have developmental delays or disabilities. The services are made available through a federal law known as the Individuals with Disabilities Education Act (IDEA). IDEA provides states and territories with specific requirements for providing early intervention services to infants and toddlers with special needs. In turn, each state and territory develops its own policies for carrying out IDEA and its requirements. Broadly speaking, early intervention services are special services for eligible infants and toddlers and their families. These services are designed to identify and meet children’s needs in five developmental areas. These areas are: physical development, cognitive development, communication, social or emotional development, and adaptive development.",
            "notes": "Source: National Dissemination Center for Children with Disabilities [7/1/2007: new]    http://www.nichcy.org/pubs/parent/pa2txt.htm"
        },
        {
            "code": "253J00000X",
            "grouping": "Agencies",
            "classification": "Foster Care Agency",
            "specialization": "",
            "definition": "A Foster Care Agency is an agency that provides foster care as defined in the Code of Federal Regulations (CFR) as \"24-hour substitute care for children outside their own homes.\" Foster care settings include, but are not limited to, nonrelative foster family homes, relative foster homes (whether payments are being made or not), group homes, emergency shelters, residential facilities, and pre-adoptive homes.",
            "notes": "Source: Code Of Federal Regulations, Title 45, Volume 4, Part 1355, Section 57 [1/1/2008: new]"
        }
    ]
}