{
    "table_name": "NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_101",
    "table_fullname": "NPPES.NPPES.HEALTHCARE_PROVIDER_TAXONOMY_CODE_SET_101",
    "column_names": [
        "code",
        "classification",
        "notes",
        "definition",
        "specialization",
        "grouping"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "code": "193200000X",
            "grouping": "Group",
            "classification": "Multi-Specialty",
            "specialization": "",
            "definition": "A business group of one or more individual practitioners, who practice with different areas of specialization.",
            "notes": "[7/1/2003: new]"
        },
        {
            "code": "251T00000X",
            "grouping": "Agencies",
            "classification": "PACE Provider Organization",
            "specialization": "",
            "definition": "A PACE provider organization is a not-for-profit private or public entity that is primarily engaged in providing PACE services(unique capitated managed care benefits for the frail elderly which include comprehensive medical and social services).  The following characteristics also apply to a PACE organization.  It must:  have a governing board that includes community representation; be able to provide complete PACE services regardless of frequency or duration of services; have a physical site to provide adult day services; have a defined service area; have safeguards against conflict of interest; have demonstrated fiscal soundness and have a formal Participant Bill of Rights.",
            "notes": "Source:  Centers for Medicare and Medicaid, PACE Fact Sheet http://www.cms.hhs.gov/PACE/Downloads/PACEFactSheet.pdf [7/1/2006: new]"
        },
        {
            "code": "251X00000X",
            "grouping": "Agencies",
            "classification": "Supports Brokerage",
            "specialization": "",
            "definition": "A provider of service/function that assists participating individuals to make informed decisions about what will work best for them is consistent with their needs and reflects their individual circumstances. Serving as the agent of the individual, the service is available to assist in identifying immediate and long-term needs, developing options to meet those needs and accessing identified supports and services and may include assistance with recruiting, screening, hiring, and training in-home support providers. A family or person-centered planning approach is used. Supports Brokerage offers practical skills training to enable families and individuals to remain independent. Examples of skills training include providing information on recruiting and hiring personal care workers, managing personal care workers and providing information on effective communication and problem solving. The service/function provides sufficient information to assure that individuals understand the responsibilities involved with self-direction and assist in the development of an effective back-up and emergency plan. Plans may elect to fulfill the requirement of this service/function using a self-directed case manager or creating a distinct service. The Supports Brokerage documents the need for assistive services, planning for and documenting the use of excess funds and locating and maintaining services.",
            "notes": "Source:  CMS Independence Plus Waiver template. [7/1/2006: new]"
        },
        {
            "code": "252Y00000X",
            "grouping": "Agencies",
            "classification": "Early Intervention Provider Agency",
            "specialization": "",
            "definition": "Early intervention services are an effective way to address the needs of infants and toddlers who have developmental delays or disabilities. The services are made available through a federal law known as the Individuals with Disabilities Education Act (IDEA). IDEA provides states and territories with specific requirements for providing early intervention services to infants and toddlers with special needs. In turn, each state and territory develops its own policies for carrying out IDEA and its requirements. Broadly speaking, early intervention services are special services for eligible infants and toddlers and their families. These services are designed to identify and meet children’s needs in five developmental areas. These areas are: physical development, cognitive development, communication, social or emotional development, and adaptive development.",
            "notes": "Source: National Dissemination Center for Children with Disabilities [7/1/2007: new]    http://www.nichcy.org/pubs/parent/pa2txt.htm"
        },
        {
            "code": "253J00000X",
            "grouping": "Agencies",
            "classification": "Foster Care Agency",
            "specialization": "",
            "definition": "A Foster Care Agency is an agency that provides foster care as defined in the Code of Federal Regulations (CFR) as \"24-hour substitute care for children outside their own homes.\" Foster care settings include, but are not limited to, nonrelative foster family homes, relative foster homes (whether payments are being made or not), group homes, emergency shelters, residential facilities, and pre-adoptive homes.",
            "notes": "Source: Code Of Federal Regulations, Title 45, Volume 4, Part 1355, Section 57 [1/1/2008: new]"
        }
    ]
}