{
    "table_name": "full_201510",
    "table_fullname": "fh-bigquery.hackernews.full_201510",
    "column_names": [
        "by",
        "score",
        "time",
        "title",
        "type",
        "url",
        "text",
        "parent",
        "deleted",
        "dead",
        "descendants",
        "id",
        "ranking"
    ],
    "column_types": [
        "STRING",
        "INT64",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "BOOL",
        "BOOL",
        "INT64",
        "INT64",
        "INT64"
    ],
    "nested_column_names": [
        "by",
        "score",
        "time",
        "title",
        "type",
        "url",
        "text",
        "parent",
        "deleted",
        "dead",
        "descendants",
        "id",
        "ranking"
    ],
    "nested_column_types": [
        "STRING",
        "INT64",
        "INT64",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "INT64",
        "BOOL",
        "BOOL",
        "INT64",
        "INT64",
        "INT64"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "by": "balls187",
            "score": null,
            "time": 1415294411,
            "title": null,
            "type": "comment",
            "url": null,
            "text": "Not an accountant, but I believe Amazon&#x27;s &quot;weak&quot; profits are due to they reinvesting their profits back into the business, rather than accumulating cash.",
            "parent": 8568116,
            "deleted": null,
            "dead": null,
            "descendants": null,
            "id": 8568149,
            "ranking": null
        },
        {
            "by": "sreyaNotfilc",
            "score": null,
            "time": 1415366045,
            "title": null,
            "type": "comment",
            "url": null,
            "text": "&quot;I hate watching this at lunch time during work hours&quot;\nThis is a complement on how great I think the series is.<p>I absolutely love this series of videos. Its supremely comprehensive and makes me just want to quit my job, drive home, and build an amazing company.<p>Unfortunately bills gets in the way so I have to work these 8 hours. That said, every time I do watch these videos I&#x27;m coding and planning on my off hours. Startup school in NYC was an amazing experience as well.",
            "parent": 8570375,
            "deleted": null,
            "dead": null,
            "descendants": null,
            "id": 8572334,
            "ranking": null
        },
        {
            "by": "dvfjsdhgfv",
            "score": null,
            "time": 1415378369,
            "title": null,
            "type": "comment",
            "url": null,
            "text": "It alludes to a famous message of Linus Torvalds.",
            "parent": 8573176,
            "deleted": null,
            "dead": null,
            "descendants": null,
            "id": 8573328,
            "ranking": null
        },
        {
            "by": "hkmurakami",
            "score": null,
            "time": 1415408949,
            "title": null,
            "type": "comment",
            "url": null,
            "text": "&gt;Ask rich friends<p>Agreed. This is the only thing I could come up with that would reasonably ensure that I would be talking to someone decent.<p>Offtopic, but it is my belief that one of the strong factors in the perpetuation of wealth and associated wealth disparities in society is exactly this kind of information and knowledge asymmetry in the population, from access to the best advice (networks or simply the funds to gain access) to the osmosis-like uptake of information throughout one&#x27;s childhood when raised in an affluent family&#x2F;neighborhood&#x2F;environment.<p>&gt;the financial advisor is simply a coin-operated sales guy<p>Agreed. this is absolutely the mindset I tell all my friends to adopt, and to not be mislead by the title of &quot;advisor&quot;, since they are anything but.<p>&gt;Odds are after you get past the glossy color printed custom, just-for-you, spiral bound investment plan, you will see a custom portfolio that will be assembled with MPT.<p>Partially agreed.<p>Most of the time, I agree that what will be pitched is a cookie cutter MPT set of assets&#x2F;funds that, while often of somewhat marginally unideal quality, will generally get the job done. <i>However, I </i>have* seen and heard of absolutely horrible plans being thrown at naive new wealth people, and while &quot;odds are&quot; (as you say) this won&#x27;t happen to you, it&#x27;s still a non-neglible probability that you get wrapped up with some truly sleazy operations.<p>That being said, your average American PWM firm&#x2F;team&#x2F;branch isn&#x27;t likely to totally come after you like this. I think this is more likely to happen in Asia or Asian firms in the west.",
            "parent": 8575514,
            "deleted": null,
            "dead": null,
            "descendants": null,
            "id": 8575590,
            "ranking": null
        },
        {
            "by": "exDM69",
            "score": null,
            "time": 1406376823,
            "title": null,
            "type": "comment",
            "url": null,
            "text": "I&#x27;m not sure which C extensions do you mean, but Clang supports most of the same GNU extensions that GCC does. Indeed, it&#x27;s one of the goals of Clang to be compatible with GCC whenever possible. However, there might be some things that are not (yet?) supported.<p>And the kernel can be compiled using LLVM and Clang, but not quite in all configurations. But compiling mainline kernel for x86 using LLVM was achieved some years ago.",
            "parent": 8089384,
            "deleted": null,
            "dead": null,
            "descendants": null,
            "id": 8089533,
            "ranking": null
        }
    ]
}