{
    "table_name": "docs_29",
    "table_fullname": "bigquery-public-data.ebi_chembl.docs_29",
    "column_names": [
        "doc_id",
        "journal",
        "year",
        "volume",
        "issue",
        "first_page",
        "last_page",
        "pubmed_id",
        "doi",
        "chembl_id",
        "title",
        "doc_type",
        "authors",
        "abstract",
        "patent_id",
        "ridx",
        "src_id"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "doc_id",
        "journal",
        "year",
        "volume",
        "issue",
        "first_page",
        "last_page",
        "pubmed_id",
        "doi",
        "chembl_id",
        "title",
        "doc_type",
        "authors",
        "abstract",
        "patent_id",
        "ridx",
        "src_id"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "116888",
            "journal": "PNAS",
            "year": "2015",
            "volume": null,
            "issue": "34",
            "first_page": "10768",
            "last_page": "10773",
            "pubmed_id": "26261308",
            "doi": "10.1073/pnas.1501956112",
            "chembl_id": "CHEMBL4649984",
            "title": "CBP30, a selective CBP/p300 bromodomain inhibitor, suppresses human Th17 responses.",
            "doc_type": "PUBLICATION",
            "authors": "Hammitzsch A,Tallant C,Fedorov O,O'Mahony A,Brennan PE,Hay DA,Martinez FO,Al-Mossawi MH,de Wit J,Vecellio M,Wells C,Wordsworth P,Muller S,Knapp S,Bowness P.",
            "abstract": "Th17 responses are critical to a variety of human autoimmune diseases, and therapeutic targeting with monoclonal antibodies against IL-17 and IL-23 has shown considerable promise. Here, we report data to support selective bromodomain blockade of the transcriptional coactivators CBP (CREB binding protein) and p300 as an alternative approach to inhibit human Th17 responses. We show that CBP30 has marked molecular specificity for the bromodomains of CBP and p300, compared with 43 other bromodomains. In unbiased cellular testing on a diverse panel of cultured primary human cells, CBP30 reduced immune cell production of IL-17A and other proinflammatory cytokines. CBP30 also inhibited IL-17A secretion by Th17 cells from healthy donors and patients with ankylosing spondylitis and psoriatic arthritis. Transcriptional profiling of human T cells after CBP30 treatment showed a much more restricted effect on gene expression than that observed with the pan-BET (bromo and extraterminal domain protein family) bromodomain inhibitor JQ1. This selective targeting of the CBP/p300 bromodomain by CBP30 will potentially lead to fewer side effects than with the broadly acting epigenetic inhibitors currently in clinical trials.",
            "patent_id": null,
            "ridx": "SGC-CBP30_26261308",
            "src_id": "55"
        },
        {
            "doc_id": "116897",
            "journal": "Nature",
            "year": "2010",
            "volume": null,
            "issue": "7327",
            "first_page": "1067",
            "last_page": "1073",
            "pubmed_id": "20871596",
            "doi": "10.1038/nature09504",
            "chembl_id": "CHEMBL4649993",
            "title": "Selective inhibition of BET bromodomains",
            "doc_type": "PUBLICATION",
            "authors": "Filippakopoulos P, Qi J, Picaud S, Shen Y, Smith WB, Fedorov O, Morse EM, Keates T, Hickman TT, Felletar I, Philpott M, Munro S, McKeown MR, Wang Y, Christie AL, West N, Cameron MJ, Schwartz B, Heightman TD, La Thangue N, French CA, Wiest O, Kung AL, Knapp S, Bradner JE.",
            "abstract": "Epigenetic proteins are intently pursued targets in ligand discovery. So far, successful efforts have been limited to chromatin modifying enzymes, or so-called epigenetic 'writers' and 'erasers'. Potent inhibitors of histone binding modules have not yet been described. Here we report a cell-permeable small molecule (JQ1) that binds competitively to acetyl-lysine recognition motifs, or bromodomains. High potency and specificity towards a subset of human bromodomains is explained by co-crystal structures with bromodomain and extra-terminal (BET) family member BRD4, revealing excellent shape complementarity with the acetyl-lysine binding cavity. Recurrent translocation of BRD4 is observed in a genetically-defined, incurable subtype of human squamous carcinoma. Competitive binding by JQ1 displaces the BRD4 fusion oncoprotein from chromatin, prompting squamous differentiation and specific antiproliferative effects in BRD4-dependent cell lines and patient-derived xenograft models. These data establish proof-of-concept for targeting protein-protein interactions of epigenetic 'readers', and provide a versatile chemical scaffold for the development of chemical probes more broadly throughout the bromodomain family.",
            "patent_id": null,
            "ridx": "JQ1_20871596",
            "src_id": "55"
        },
        {
            "doc_id": "116900",
            "journal": "Nature",
            "year": "2010",
            "volume": null,
            "issue": "7327",
            "first_page": "1067",
            "last_page": "1073",
            "pubmed_id": "20871596",
            "doi": "10.1038/nature09504",
            "chembl_id": "CHEMBL4649996",
            "title": "Selective inhibition of BET bromodomains",
            "doc_type": "PUBLICATION",
            "authors": "Filippakopoulos P, Qi J, Picaud S, Shen Y, Smith WB, Fedorov O, Morse EM, Keates T, Hickman TT, Felletar I, Philpott M, Munro S, McKeown MR, Wang Y, Christie AL, West N, Cameron MJ, Schwartz B, Heightman TD, La Thangue N, French CA, Wiest O, Kung AL, Knapp S, Bradner JE.",
            "abstract": null,
            "patent_id": null,
            "ridx": "(+)-JQ1_20871596",
            "src_id": "55"
        },
        {
            "doc_id": "69727",
            "journal": "Chem Cent J",
            "year": "2012",
            "volume": "6",
            "issue": "28",
            "first_page": null,
            "last_page": null,
            "pubmed_id": "22483270",
            "doi": "10.1186/1752-153x-6-28",
            "chembl_id": "CHEMBL3046882",
            "title": "Synthesis and antibacterial activity against ralstonia solanacearum for novel hydrazone derivatives containing a pyridine moiety.",
            "doc_type": "PUBLICATION",
            "authors": "Wu J, Kang S, Song B, Hu D, He M, Jin L, Yang S.",
            "abstract": "BACKGROUND: Ralstonia solanacearum, one of the most important bacterial diseases on plants, is a devastating, soil-borne plant pathogen with a global distribution and an unusually wide host range. In order to discover new bioactive molecules and pesticides acting on tobacco bacterial wilt, we sought to combine the active structure of hydrazone and pyridine together to design and synthesize a series of novel hydrazone derivatives containing a pyridine moiety. RESULTS: A series of hydrazone derivatives containing a pyridine moiety were synthesized. Their structures were characterized by 1 H-NMR, 13 C-NMR, IR, and elemental analysis. The preliminary biological activity tests showed that compound 3e and 3g exhibited more than 80% activity against Ralstonia solanacearum at 500 mg/L, especially compound 3g displayed relatively good activity to reach 57.0% at 200 mg/L. CONCLUSION: A practical synthetic route to hydrazone derivatives containing a pyridine moiety by the reaction of intermediates 2 with different aldehydes in ethanol at room temperature using 2-chloronicotinic acid and 2-amino-5-chloro-3-methylbenzoic acid as start materials is presented. This study suggests that the hydrazone derivatives containing a substituted pyridine ring could inhibit the growth of Ralstonia solanacearum.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "59326",
            "journal": "Drug Discovery Today",
            "year": "2011",
            "volume": "16",
            "issue": "15-16",
            "first_page": "697",
            "last_page": "703",
            "pubmed_id": "21624500",
            "doi": "10.1016/j.drudis.2011.05.007",
            "chembl_id": "CHEMBL1909281",
            "title": "FDA-approved drug labeling for the study of drug-induced liver injury.",
            "doc_type": "PUBLICATION",
            "authors": "Chen M, Vijay V, Shi Q, Liu Z, Fang H, Tong W.",
            "abstract": "Drug-induced liver injury (DILI) is a leading cause of drugs failing during clinical trials and being withdrawn from the market. Comparative analysis of drugs based on their DILI potential is an effective approach to discover key DILI mechanisms and risk factors. However, assessing the DILI potential of a drug is a challenge with no existing consensus methods. We proposed a systematic classification scheme using FDA-approved drug labeling to assess the DILI potential of drugs, which yielded a benchmark dataset with 287 drugs representing a wide range of therapeutic categories and daily dosage amounts. The method is transparent and reproducible with a potential to serve as a common practice to study the DILI of marketed drugs for supporting drug discovery and biomarker development.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        }
    ]
}