{
    "table_name": "docs_28",
    "table_fullname": "bigquery-public-data.ebi_chembl.docs_28",
    "column_names": [
        "doc_id",
        "journal",
        "year",
        "volume",
        "issue",
        "first_page",
        "last_page",
        "pubmed_id",
        "doi",
        "chembl_id",
        "title",
        "doc_type",
        "authors",
        "abstract",
        "patent_id",
        "ridx",
        "src_id"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "doc_id",
        "journal",
        "year",
        "volume",
        "issue",
        "first_page",
        "last_page",
        "pubmed_id",
        "doi",
        "chembl_id",
        "title",
        "doc_type",
        "authors",
        "abstract",
        "patent_id",
        "ridx",
        "src_id"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "doc_id": "69727",
            "journal": "Chem Cent J",
            "year": "2012",
            "volume": "6",
            "issue": "28",
            "first_page": null,
            "last_page": null,
            "pubmed_id": "22483270",
            "doi": "10.1186/1752-153x-6-28",
            "chembl_id": "CHEMBL3046882",
            "title": "Synthesis and antibacterial activity against ralstonia solanacearum for novel hydrazone derivatives containing a pyridine moiety.",
            "doc_type": "PUBLICATION",
            "authors": "Wu J, Kang S, Song B, Hu D, He M, Jin L, Yang S.",
            "abstract": "BACKGROUND: Ralstonia solanacearum, one of the most important bacterial diseases on plants, is a devastating, soil-borne plant pathogen with a global distribution and an unusually wide host range. In order to discover new bioactive molecules and pesticides acting on tobacco bacterial wilt, we sought to combine the active structure of hydrazone and pyridine together to design and synthesize a series of novel hydrazone derivatives containing a pyridine moiety. RESULTS: A series of hydrazone derivatives containing a pyridine moiety were synthesized. Their structures were characterized by 1 H-NMR, 13 C-NMR, IR, and elemental analysis. The preliminary biological activity tests showed that compound 3e and 3g exhibited more than 80% activity against Ralstonia solanacearum at 500 mg/L, especially compound 3g displayed relatively good activity to reach 57.0% at 200 mg/L. CONCLUSION: A practical synthetic route to hydrazone derivatives containing a pyridine moiety by the reaction of intermediates 2 with different aldehydes in ethanol at room temperature using 2-chloronicotinic acid and 2-amino-5-chloro-3-methylbenzoic acid as start materials is presented. This study suggests that the hydrazone derivatives containing a substituted pyridine ring could inhibit the growth of Ralstonia solanacearum.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "59326",
            "journal": "Drug Discovery Today",
            "year": "2011",
            "volume": "16",
            "issue": "15-16",
            "first_page": "697",
            "last_page": "703",
            "pubmed_id": "21624500",
            "doi": "10.1016/j.drudis.2011.05.007",
            "chembl_id": "CHEMBL1909281",
            "title": "FDA-approved drug labeling for the study of drug-induced liver injury.",
            "doc_type": "PUBLICATION",
            "authors": "Chen M, Vijay V, Shi Q, Liu Z, Fang H, Tong W.",
            "abstract": "Drug-induced liver injury (DILI) is a leading cause of drugs failing during clinical trials and being withdrawn from the market. Comparative analysis of drugs based on their DILI potential is an effective approach to discover key DILI mechanisms and risk factors. However, assessing the DILI potential of a drug is a challenge with no existing consensus methods. We proposed a systematic classification scheme using FDA-approved drug labeling to assess the DILI potential of drugs, which yielded a benchmark dataset with 287 drugs representing a wide range of therapeutic categories and daily dosage amounts. The method is transparent and reproducible with a potential to serve as a common practice to study the DILI of marketed drugs for supporting drug discovery and biomarker development.",
            "patent_id": null,
            "ridx": "CLD0",
            "src_id": "1"
        },
        {
            "doc_id": "110494",
            "journal": "Bioorg Med Chem",
            "year": "2018",
            "volume": "26",
            "issue": "23-24",
            "first_page": "6000",
            "last_page": "6014",
            "pubmed_id": "30448189",
            "doi": "10.1016/j.bmc.2018.10.037",
            "chembl_id": "CHEMBL4308871",
            "title": "Design, synthesis and in vitro evaluation of stilbene derivatives as novel LSD1 inhibitors for AML therapy.",
            "doc_type": "PUBLICATION",
            "authors": "Duan Y, Qin W, Suo F, Zhai X, Guan Y, Wang X, Zheng Y, Liu H.",
            "abstract": "LSD1 is implicated in a number of malignancies and has emerged as an exciting target. As part of our sustained efforts to develop novel reversible LSD1 inhibitors for epigenetic therapy of cancers, in this study, we reported a series of stilbene derivatives and evaluated their LSD1 inhibitory activities, obtaining several compounds as potent LSD1 inhibitors with IC<sub>50</sub> values in submicromolar range. Enzyme kinetics studies and SPR assay suggested that compound 8c, the most active LSD1 inhibitor (IC<sub>50</sub> = 283 nM), potently inhibited LSD1 in a reversible and FAD competitive manner. Consistent with the kinetics data, molecular docking showed that compound 8c can be well docked into the FAD binding site of LSD1. Flow cytometry analysis showed that compound 8c was capable of up-regulating the expression of the surrogate cellular biomarker CD86 in THP-1 human leukemia cells, suggesting the ability to block LSD1 activity in cells. Compound 8c showed good inhibition against THP-1 and MOLM-13 cells with IC<sub>50</sub> values of 5.76 and 8.34 μM, respectively. Moreover, compound 8c significantly inhibited colony formation of THP-1 cells dose dependently.",
            "patent_id": null,
            "ridx": "30448189",
            "src_id": "1"
        },
        {
            "doc_id": "110495",
            "journal": "Bioorg Med Chem",
            "year": "2018",
            "volume": "26",
            "issue": "23-24",
            "first_page": "6067",
            "last_page": "6075",
            "pubmed_id": "30448190",
            "doi": "10.1016/j.bmc.2018.11.012",
            "chembl_id": "CHEMBL4308872",
            "title": "Dose dependent actions of LCL521 on acid ceramidase and key sphingolipid metabolites.",
            "doc_type": "PUBLICATION",
            "authors": "Bai A, Bielawska A, Rahmaniyan M, Kraveka JM, Bielawski J, Hannun YA.",
            "abstract": "The function of acid ceramidase (ACDase), whose congenital deficiency leads to Farber disease, has been recognized to be vital to tumor cell biology, and inhibition of its activity may be beneficial in cancer therapy. Therefore, manipulation of the activity of this enzyme may have significant effect, especially on cancer cells. LCL521, Di-DMG-B13, is a lysosomotropic inhibitor of ACDase. Here we define complexities in the actions of LCL521 on ACDase. Systematic studies in MCF7 cells showed dose and time divergent action of LCL521 on ACDase protein expression and sphingolipid levels. Low dose of LCL521 (1 µM) effectively inhibited ACDase in cells, but the effects were transient. A higher dose of LCL521 (10 µM) caused a profound decrease of sphingosine and increase of ceramide, but additionally affected the processing and regeneration of the ACDase protein, with biphasic and reversible effects on the expression of ACDase, which paralleled the long term changes of cellular sphingosine and ceramide. Finally, the higher concentrations of LCL521 also inhibited Dihydroceramide desaturase (DES-1). In summary, LCL521 exhibits significant effects on ACDase in a dose and time dependent manner, but dose range and treatment time need to be paid attention to specify its future exploration on ACDase targeted cancer treatment.",
            "patent_id": null,
            "ridx": "30448190",
            "src_id": "1"
        },
        {
            "doc_id": "110499",
            "journal": "Bioorg Med Chem",
            "year": "2018",
            "volume": "26",
            "issue": "23-24",
            "first_page": "6050",
            "last_page": "6055",
            "pubmed_id": "30448257",
            "doi": "10.1016/j.bmc.2018.11.007",
            "chembl_id": "CHEMBL4308876",
            "title": "Isolation and structure determination of a new lasso peptide specialicin based on genome mining.",
            "doc_type": "PUBLICATION",
            "authors": "Kaweewan I, Hemmi H, Komaki H, Harada S, Kodani S.",
            "abstract": "Based on genome mining, a new lasso peptide specialicin was isolated from the extract of Streptomyces specialis. The structure of specialicin was established by ESI-MS and NMR analyses to be a lasso peptide with the length of 21 amino acids, containing an isopeptide bond and two disulfide bonds in the molecule. The stereochemistries of the constituent amino acids except for Trp were determined to be L and the stereochemistry of Trp at C-terminus was determined to be D. Three dimensional structure of specialicin was determined based on NOE experimental data, which indicated that specialicin possessed the similar conformational structure with siamycin I. Specialicin showed the antibacterial activity against Micrococcus luteus and the moderate anti-HIV activity against HIV-1 NL4-3. The biosynthetic gene cluster of specialicin was proposed from the genome sequence data of S. specialis.",
            "patent_id": null,
            "ridx": "30448257",
            "src_id": "1"
        }
    ]
}