{"instance_id": "bq011", "db": "ga4", "question": "How many pseudo users were active in the last 7 days but inactive in the last 2 days as of January 7, 2021?"}
{"instance_id": "bq010", "db": "ga360", "question": "Find the top-selling product among customers who bought 'Youtube Men’s Vintage Henley' in July 2017, excluding itself."}
{"instance_id": "bq001", "db": "ga360", "question": "I wonder how many days between the first transaction and the first visit both in Feburary 2017 for each transacting visitor, along with the device used in the transaction."}
{"instance_id": "bq008", "db": "ga360", "question": "What's the most common next page for visitors who were part of \"Data Share\" campaign and after they accessed the page starting with '/home' in January 2017. And what's the maximum duration time (in seconds) when they visit the corresponding home page?"}
{"instance_id": "bq268", "db": "ga360", "question": "Identify the longest number of days between the first visit and the last recorded event (either the last visit or the first transaction) for a user where the last recorded event was associated with a mobile device."}
{"instance_id": "bq270", "db": "ga360", "question": "What were the monthly add-to-cart and purchase conversion rates, calculated as a percentage of pageviews on product details, from January to March 2017?"}
{"instance_id": "bq275", "db": "ga360", "question": "Can you provide a list of visitor IDs for those who made their first transaction on a mobile device on a different day than their first visit?"}
{"instance_id": "bq374", "db": "ga360", "question": "Calculates the percentage of new users who, between August 1, 2016, and April 30, 2017, both stayed on the site for more than 5 minutes during their initial visit and made a purchase on a subsequent visit at any later time, relative to the total number of new users in the same period."}
{"instance_id": "bq091", "db": "patents", "question": "In which year did the assignee with the most applications in the patent category 'A61' file the most?"}
{"instance_id": "bq099", "db": "patents", "question": "For patent class A01B3, I want to analyze the information of the top 3 assignees based on the total number of applications. Please provide the following five pieces of information: the name of this assignee,  total number of applications, the year with the most applications, the number of applications in that year, and the country code with the most applications during that year."}
{"instance_id": "bq033", "db": "patents", "question": "How many U.S. publications related to IoT (where the abstract includes the phrase 'internet of things') were filed each month from 2008 to 2022, including months with no filings?"}
{"instance_id": "bq209", "db": "patents", "question": "Can you find how many utility patents granted in 2010 have exactly one forward citation within the ten years following their application date?"}
{"instance_id": "bq210", "db": "patents", "question": "How many US B2 patents granted between 2008 and 2018 contain claims that do not include the word 'claim'?"}
{"instance_id": "bq213", "db": "patents", "question": "What is the most common 4-digit IPC code among US B2 utility patents granted from June to August in 2022?"}
{"instance_id": "bq216", "db": "patents_google", "question": "Identify the top five patents filed in the same year as `US-9741766-B2` that are most similar to it based on technological similarities. Please provide the publication numbers."}
{"instance_id": "bq127", "db": "patents_google", "question": "For each publication family whose earliest publication was first published in January 2015, please provide the earliest publication date, the distinct publication numbers, their country codes, the distinct CPC and IPC codes, distinct families (namely, the ids) that cite and are cited by this publication family. Please present all lists as comma-separated values, sorted by the first letter of the code for clarity."}
{"instance_id": "bq222", "db": "patents", "question": "Find the CPC technology areas in Germany with the highest exponential moving average of patent filings each year (smoothing factor 0.1) for patents granted in December 2016. Show me the full title, CPC group and the best year for each CPC group at level 4."}
{"instance_id": "bq221", "db": "patents", "question": "Identify the CPC technology areas with the highest exponential moving average of patent filings each year (smoothing factor 0.2), and provide the full title and the best year for each CPC group at level 5."}
{"instance_id": "bq223", "db": "patents", "question": "Which assignees, excluding DENSO CORP itself, have cited patents assigned to DENSO CORP, and what are the titles of the primary CPC subclasses associated with these citations? Provide the name of each citing assignee, the full title of the CPC subclass, and the count of citations grouped by the assignee and the CPC subclass title. Please focus specifically on the main categories of the CPC codes,"}
{"instance_id": "bq420", "db": "patents_uspto", "question": "Can you identify the top 5 patents that were initially rejected under section 101 with no allowed claims, based on the length of their granted claims? The patents should have been granted in the US between 2010 and 2023. Additionally, ensure to select the first office action date for each application. Please include their first publication numbers, along with their first publication dates, length of the filed claims and grant dates."}
{"instance_id": "bq128", "db": "patentsview", "question": "Tell me the patent title and abstract, as well as the publication date, the backward citation and forward citation count within 5 years for those published in January 2014. The detailed requirements are provided in `forward_backward_citation.md`."}
{"instance_id": "bq246", "db": "patentsview", "question": "Can you figure out the number of forward citations within 1 years from the application date for the patent that has the most backward citations within 1 years from application among all U.S. patents?"}
{"instance_id": "bq052", "db": "patentsview", "question": "I wonder which patents within CPC subsection 'C05' or group 'A01G' in the USA have at least one forward or backward citations within one month of their application dates. Give me the ids, titles, application date, forward/backward citation counts and summary texts."}
{"instance_id": "bq100", "db": "github_repos", "question": "Find out the most frequently used package in all Go source files."}
{"instance_id": "bq182", "db": "github_repos_date", "question": "Which primary programming languages, determined by the highest number of bytes in each repository, have the sum of over 100 pull requests on January 18, 2023 in all its repositories?"}
{"instance_id": "bq224", "db": "github_repos_date", "question": "Which repository with an approved license in `licenses.md` had the highest combined total of forks, issues, and watches in April 2022?"}
{"instance_id": "bq233", "db": "github_repos", "question": "Can you find the imported Python modules and R libraries from the GitHub sample files and list them along with their occurrence counts? Please sort the results by language and then by the number of occurrences in descending order."}
{"instance_id": "bq248", "db": "github_repos", "question": "What is the proportion of files whose paths include 'readme.md' that contain the phrase 'Copyright (c)', among all repositories that do not use any programming language with 'python' in its name"}
{"instance_id": "bq193", "db": "github_repos", "question": "Help me retrieve the top 5 most frequently occurring non-empty, non-commented lines of text in `readme.md` files from GitHub repositories that primarily use Python for development."}
{"instance_id": "bq295", "db": "github_repos", "question": "Among the repositories from the GitHub Archive which include a Python file with less than 15,000 bytes in size and a keyword 'def' in the content, find the top 3 that have the highest number of watch events in 2017?"}
{"instance_id": "bq255", "db": "github_repos", "question": "How many commit messages are there in repositories that use the 'Shell' programming language and 'apache-2.0' license, where the length of the commit message is more than 5 characters but less than 10,000 characters, and the messages do not start with the word 'merge', 'update' or 'test'?"}
{"instance_id": "bq194", "db": "github_repos", "question": "What is the second most frequently used module (imported library) across Python, R, and IPython script (.ipynb) files in the GitHub sample dataset?"}
{"instance_id": "bq377", "db": "github_repos", "question": "Extract and count the frequency of all package names listed in the require section of JSON-formatted content"}
{"instance_id": "bq359", "db": "github_repos", "question": "List the repository names and commit counts for the top two GitHub repositories with JavaScript as the primary language and the highest number of commits."}
{"instance_id": "bq252", "db": "github_repos", "question": "Could you please find the name of the repository that contains the most copied non-binary Swift file in the dataset, ensuring each file is uniquely identified by its ID?"}
{"instance_id": "bq235", "db": "cms_data", "question": "Can you tell me which healthcare provider incurs the highest combined average costs for both outpatient and inpatient services in 2014?"}
{"instance_id": "bq172", "db": "cms_data", "question": "For the drug with the highest total number of prescriptions in New York State during 2014, could you list the top five states with the highest total claim counts for this drug? Please also include their total claim counts and total drug costs. "}
{"instance_id": "bq354", "db": "cms_data", "question": "Could you provide the percentage of participants for standard acne, atopic dermatitis, psoriasis, and vitiligo defined by the International Classification of Diseases 10-CM(ICD-10-CM), including their subcategories? The ICD-10 codes are: Acne (L70), Atopic dermatitis (L20), Psoriasis (L40), and Vitiligo (L80). "}
{"instance_id": "bq355", "db": "cms_data", "question": "Please tell me the percentage of participants not using quinapril and related medications(Quinapril RxCUI: 35208)."}
{"instance_id": "bq032", "db": "noaa_data", "question": "Can you provide the latitude of the final coordinates for the hurricane that traveled the second longest distance in the North Atlantic during 2020?"}
{"instance_id": "bq119", "db": "noaa_data", "question": "Please show information of the hurricane with the third longest total travel distance in the North Atlantic during 2020, including its travel coordinates, the cumulative travel distance at each point, and the maximum sustained wind speed at those times."}
{"instance_id": "bq419", "db": "noaa_data", "question": "Which 5 states had the most storm events from 1980 to 1995, considering only the top 1000 states with the highest event counts each year? Please use state abbreviations."}
{"instance_id": "bq236", "db": "noaa_data_plus", "question": "What are the top 5 zip codes of the areas in the United States that have experienced the most hail storm events in the past 10 years?"}
{"instance_id": "bq358", "db": "noaa_data", "question": "Can you tell me which bike trip in New York City on July 15, 2015, started and ended in ZIP Code areas with the highest average temperature for that day, as recorded by the Central Park weather station '94728'? If there's more than one trip that meets these criteria, I'd like to know about the one that starts in the smallest ZIP Code and ends in the largest ZIP Code."}
{"instance_id": "bq031", "db": "noaa_data", "question": "Show me the daily weather data (temperature, precipitation, and wind speed) in Rochester for the first season of year 2019, converted to Celsius, centimeters, and meters per second, respectively. Also, include the moving averages (window size = 8) and the differences between the moving averages for up to 8 days prior (all values rounded to one decimal place, sorted by date in ascending order, and records starting from 2019-01-09)."}
{"instance_id": "bq392", "db": "noaa_gsod", "question": "What are the top 3 dates in October 2009 with the highest average temperature for station number 723758, in the format YYYY-MM-DD?"}
{"instance_id": "bq050", "db": "new_york_citibike_1", "question": "Help me look at the total number of bike trips, average trip duration (in minutes), average daily temperature, wind speed, and precipitation when trip starts (rounded to 1 decimal), as well as the month with the most trips (e.g., `4`), categorized by different starting and ending neighborhoods in New York City for the year 2014."}
{"instance_id": "bq291", "db": "noaa_global_forecast_system", "question": "Can you provide a daily weather summary for July 2019 within a 5 km radius of latitude 26.75 and longitude 51.5? I need the maximum, minimum, and average temperatures; total precipitation; average cloud cover between 10 AM and 5 PM; total snowfall (when average temperature is below 32°F); and total rainfall (when average temperature is 32°F or above) for each forecast date. The data should correspond to forecasts created in July 2019 for the following day."}
{"instance_id": "bq208", "db": "new_york_noaa", "question": "Can you provide weather stations within a 20-mile radius of Chappaqua, New York (Latitude: 41.197, Longitude: -73.764), and tell me the number of valid temperature observations they have recorded from 2011 to 2020?"}
{"instance_id": "bq017", "db": "geo_openstreetmap", "question": "What are the five longest types of highways within the multipolygon boundary of Denmark (as defined by Wikidata ID 'Q35') by total length?"}
{"instance_id": "bq349", "db": "geo_openstreetmap", "question": "Which OpenStreetMap ID from the planet features corresponds to the administrative boundary, represented as multipolygons, whose total number of 'amenity'-tagged Points of Interest (POIs) is closest to the median count among all such boundaries?"}
{"instance_id": "bq429", "db": "census_bureau_acs_2", "question": "What are the top 5 states with the highest average median income difference from 2015 to 2018? also provide the average number of vulnerable employees across various industries for these states, using data from the ACS 5-Year Estimates for 2017."}
{"instance_id": "bq253", "db": "geo_openstreetmap", "question": "Find the name of the OpenStreetMap relation that encompasses the most features within the same geographic area as the multipolygon tagged with Wikidata item 'Q1095'. The relation should have a specified name without a 'wikidata' tag, and at least one of its included features must have a 'wikidata' tag. Return the name of this relation"}
{"instance_id": "bq254", "db": "geo_openstreetmap", "question": "Can you find the names of the multipolygons with valid ids that rank in the top two in terms of the number of points within their boundaries, among those multipolygons that do not have a Wikidata tag but are located within the same geographic area as the multipolygon associated with Wikidata item Q191?"}
{"instance_id": "bq056", "db": "geo_openstreetmap_boundaries", "question": "How many different pairs of roads classified as motorway, trunk, primary, secondary, or residential in California overlap each other without sharing nodes and do not have a bridge tag, where these roads are tagged with 'highway'"}
{"instance_id": "bq289", "db": "geo_openstreetmap_census_places", "question": "Can you find the shortest distance between any two amenities (either a library, place of worship, or community center) located within Philadelphia?"}
{"instance_id": "bq250", "db": "geo_openstreetmap_worldpop", "question": "What is the total population living on the geography grid which is the farthest from any hospital in Singapore, based on the most recent population data before 2023? Note that geographic grids and distances are calculated based on geospatial data and GIS related functions."}
{"instance_id": "bq083", "db": "crypto", "question": "What is the daily change in the total market value (formatted as a string in USD currency format) of the USDC token (with a target address of \"0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48\") in 2023 , considering both Mint (the input starts with 0x42966c68) and Burn (the input starts with 0x40c10f19) transactions?"}
{"instance_id": "bq341", "db": "crypto", "question": "Which Ethereum address has the top 3 smallest positive balance from transactions involving the token at address \"0xa92a861fc11b99b24296af880011b47f9cafb5ab\"?"}
{"instance_id": "bq444", "db": "crypto", "question": "Can you pull the blockchain timestamp, block number, and transaction hash for the first five mint and burn events from Ethereum logs for the address '0x8ad599c3a0ff1de082011efddc58f1908eb6e6d8'? Please include mint events identified by the topic '0x7a53080ba414158be7ec69b987b5fb7d07dee101fe85488f0853ae16239d0bde' and burn events by '0x0c396cd989a39f4459b5fa1aed6a9a8dcdbc45908acfd67e028cd568da98982c', and order them by block timestamp from the oldest to the newest."}
{"instance_id": "bq334", "db": "crypto", "question": "In my Bitcoin database, there are discrepancies in transaction records. Can you determine the annual differences in average output values calculated from separate input and output records versus a consolidated transactions table, focusing only on the years common to both calculation methods?"}
{"instance_id": "bq057", "db": "crypto", "question": "Which month (e.g., 3) in 2021 witnessed the highest percent of Bitcoin volume that took place in CoinJoin transactions? Also give me the percentage of CoinJoins transactions, the average input and output UTXOs ratio, and the proportion of CoinJoin transaction volume for that month (all 1 decimal)."}
{"instance_id": "bq068", "db": "crypto", "question": "What are the maximum and minimum balances across all addresses for different address types on Bitcoin Cash during March 2014?"}
{"instance_id": "bq093", "db": "crypto", "question": "Tell me the maximum and minimum net changes in balances for Ethereum Classic addresses on October 14, 2016, considering debits, credits, and gas fees, while excluding internal calls like 'delegatecall', 'callcode', and 'staticcall'."}
{"instance_id": "bq065", "db": "crypto", "question": "Provide the most recent 10 results of symbols and their corresponding rates, adjusted for the multiplier, from oracle requests with the script ID 3."}
{"instance_id": "bq037", "db": "human_genome_variants", "question": "About the refined human genetic variations collected in phase 3 on 2015-02-20, I want to know the minimum and maximum start positions as well as the proportions of these two respectively for reference bases 'AT' and 'TA'."}
{"instance_id": "bq012", "db": "ethereum_blockchain", "question": "What is the average balance of the top 10 addresses with the most balance on the Ethereum blockchain, considering both incoming and outgoing transactions with valid addresses, but only those recorded as used on receipt, as well as transaction fees? Only keep successful transactions with no call type or where the call type is 'call'. The average balance, expressed in quadrillions (10^15), is rounded to two decimal places."}
{"instance_id": "bq187", "db": "ethereum_blockchain", "question": "What is the total circulating supply balances of the 'BNB' token for all addresses (excluding the zero address), based on the amount they have received (converted by dividing by 10^18) minus the amount they have sent?"}
{"instance_id": "bq034", "db": "ghcn_d", "question": "I want to know the IDs, names of weather stations within a 50 km straight-line distance from the center of Chicago (41.8319°N, 87.6847°W)"}
{"instance_id": "bq383", "db": "ghcn_d", "question": "Could you provide the highest recorded precipitation, minimum temperature, and maximum temperature from the last 15 days of each year from 2013 to 2016 at weather station USW00094846? Ensure each value represents the peak measurement for that period, with precipitation in millimeters and temperatures in degrees Celsius, including only valid and high-quality data."}
{"instance_id": "bq185", "db": "new_york_plus", "question": "What is the average valid trip duration (in minutes) for yellow taxi rides in Brooklyn with more than 3 passengers and a trip distance of at least 10 miles between February 1 and February 7, 2016?"}
{"instance_id": "bq040", "db": "new_york_plus", "question": "For NYC yellow taxi trips between January 1-7, 2016, excluding pickups from 'EWR' and 'Staten Island', calculate the proportion of trips by tip category for each pickup borough. Show the borough, tip category, and proportion, ensuring trips where the dropoff occurs after the pickup, the passenger count is greater than 0, and trip distance, tip, tolls, MTA tax, fare, and total amount are non-negative."}
{"instance_id": "bq203", "db": "new_york_plus", "question": "What percentage of subway stations in each New York borough have at least one ADA-compliant entrance?"}
{"instance_id": "bq035", "db": "san_francisco", "question": "What is the total distance traveled by each bike in the San Francisco Bikeshare program? Use data from bikeshare trips and stations to calculate this."}
{"instance_id": "bq081", "db": "san_francisco_plus", "question": "Find the latest ride data for each region between 2014 and 2017. I want to know the name of each region, the trip ID of this ride, the ride duration, the start time, the starting station, and the gender of the rider."}
{"instance_id": "bq294", "db": "san_francisco_plus", "question": "Can you provide the details of the top 5 longest bike share trips that started during the second half of 2017, including the trip ID, duration in seconds, start date, start station name, route (start station to end station), bike number, subscriber type, member's birth year, current age, age classification, gender, and the region name of the start station? Please exclude trips where the start station name, member's birth year, or member's gender is not specified."}
{"instance_id": "bq339", "db": "san_francisco_plus", "question": "Which month in 2017 had the largest absolute difference between cumulative bike usage minutes for customers and subscribers?"}
{"instance_id": "bq376", "db": "san_francisco_plus", "question": "For each neighborhood in San Francisco, list the number of bike share stations and the total number of crime incidents."}
{"instance_id": "bq260", "db": "thelook_ecommerce", "question": "Find the total number of youngest and oldest users separately for each gender in the e-commerce platform created from January 1, 2019, to April 30, 2022."}
{"instance_id": "bq263", "db": "thelook_ecommerce", "question": "Produce a 2023 monthly report for the 'Sleep & Lounge' category detailing total sales, costs, completed order counts, profits, and profit margins, ensuring accurate cost alignment with sales data."}
{"instance_id": "bq264", "db": "thelook_ecommerce", "question": "Identify the difference in the number of the oldest and youngest users registered between January 1, 2019, and April 30, 2022, from our e-commerce platform data."}
{"instance_id": "bq265", "db": "thelook_ecommerce", "question": "Can you provide me with the emails of the top 10 users who have the highest average order value, considering only those users who registered in 2019 and made purchases within the same year?"}
{"instance_id": "bq271", "db": "thelook_ecommerce", "question": "Could you generate a report that, for each month in 2021, provides the number of orders, number of unique purchasers, and profit (calculated as total product retail price minus total cost) grouped by country, product department, and product category?"}
{"instance_id": "bq273", "db": "thelook_ecommerce", "question": "Can you list the top 5 months from August 2022 to November 2023 where the profit from Facebook-sourced completed orders showed the largest month-over-month increase? Calculate profit as sales minus costs."}
{"instance_id": "bq025", "db": "census_bureau_international", "question": "Provide a list of the top 10 countries for the year 2020, ordered by the highest percentage of their population under 20 years old. For each country, include the total population under 20 years old, the total midyear population, and the percentage of the population that is under 20 years old."}
{"instance_id": "bq115", "db": "census_bureau_international", "question": "Which country has the highest percentage of population under the age of 25 in 2017?"}
{"instance_id": "bq085", "db": "covid19_jhu_world_bank", "question": "Could you provide the total number of confirmed COVID-19 cases and the number of cases per 100,000 people, based on the 2020 population, on April 20, 2020, for the US, France, China, Italy, Spain, Germany, and Iran?"}
{"instance_id": "bq130", "db": "covid19_nyt", "question": "Analyze daily new COVID-19 case counts from March to May 2020, identifying the top five states by daily increases. Please compile a ranking based on how often each state appears in these daily top fives. Then, examine the state that ranks fourth overall and identify its top five counties based on their frequency of appearing in the daily top five new case counts."}
{"instance_id": "bq060", "db": "census_bureau_international", "question": "Which top 3 countries had the highest net migration in 2017 among those with an area greater than 500 square kilometers? And what are their migration rates?"}
{"instance_id": "bq338", "db": "census_bureau_acs_1", "question": "Can you find the census tracts in the 36047 area that made both the top 20 lists for biggest population and median income increases from 2011 to 2018, and had over 1000 residents each year?"}
{"instance_id": "bq061", "db": "census_bureau_acs_1", "question": "Which census tract has witnessed the largest increase in median income between 2015 and 2018 in California? Tell me the tract code."}
{"instance_id": "bq198", "db": "ncaa_basketball", "question": "What are the top 5 most successful college basketball teams over the seasons from 1900 to 2000, based on the number of times they had the maximum wins in a season?"}
{"instance_id": "bq112", "db": "bls", "question": "Did the increase on average annual wages for all industries in Allegheny County, Pittsburgh keep pace with inflation of all consumer items between 1998 and 2017? Tell me their growth rates respectively (2 decimals)."}
{"instance_id": "bq226", "db": "goog_blockchain", "question": "Can you find me the complete url of the most frequently used sender's address on the Cronos blockchain since January 1, 2023, where transactions were made to non-null addresses and in blocks larger than 4096 bytes?"}
{"instance_id": "bq028", "db": "deps_dev_v1", "question": "Considering only the latest release versions of NPM package, which packages are the top 8 most popular based on the Github star number, as well as their versions?"}
{"instance_id": "bq022", "db": "chicago", "question": "Given the taxi trip data in Chicago, partition the trips that last no more than 1 hour into 6 quantiles based on trip duration. Please provide the minimum/maximum trip duration (rounded-off to integer minutes), total trips, and average fare for each quantile."}
{"instance_id": "bq362", "db": "chicago", "question": "Which three companies had the largest increase in trip numbers between two consecutive months in 2018?"}
{"instance_id": "bq363", "db": "chicago", "question": "For taxi trips with a duration rounded to the nearest minute, and between 1 and 50 minutes, if the trip durations are divided into 10 quantiles, what are the total number of trips and the average fare for each quantile?"}
{"instance_id": "bq076", "db": "chicago", "question": "Which month generally has the greatest number of motor vehicle thefts in 2016?"}
{"instance_id": "bq077", "db": "chicago", "question": "For each year from 2010 to 2016, what is the highest number of motor thefts in one month?"}
{"instance_id": "bq350", "db": "open_targets_platform_1", "question": "For the detailed molecule data, Please display the drug id, drug type and withdrawal status for approved drugs with a black box warning and known drug type among 'Keytruda', 'Vioxx', 'Premarin', and 'Humira'"}
{"instance_id": "bq379", "db": "open_targets_platform_1", "question": "Which target approved symbol has the overall association score closest to the mean score for psoriasis?"}
{"instance_id": "bq078", "db": "open_targets_platform_2", "question": "Retrieve the approved symbol of target genes with the highest overall score that are associated with the disease 'EFO_0000676' from the data source 'IMPC'."}
{"instance_id": "bq109", "db": "open_targets_genetics_1", "question": "Find the average, variance, max-min difference, and the QTL source(right study) of the maximum log2(h4/h3) for data where right gene id is \"ENSG00000169174\", h4 > 0.8, h3 < 0.02, reported trait includes \"lesterol levels\", right biological feature is \"IPSC\", and the variant is '1_55029009_C_T'."}
{"instance_id": "bq442", "db": "CYMBAL_INVESTMENTS", "question": "Please collect the information of the top 6 trade report with the highest closing prices. Refer to the document for all the information I want."}
{"instance_id": "bq079", "db": "usfs_fia", "question": "Given the latest evaluations of timberland and forestland plots, which state within each category has the highest total acreage? Please provide the state code, the evaluation group, the state name, and the total acres for the top state in each category."}
{"instance_id": "bq024", "db": "usfs_fia", "question": "For the year 2012, which top 10 evaluation groups have the largest subplot acres when considering only the condition with the largest subplot acres within each group? Please include the evaluation group, evaluation type, condition status code, evaluation description, state code, macroplot acres, and subplot acres."}
{"instance_id": "bq276", "db": "noaa_ports", "question": "Can you provide me with the details of all ports affected by tropical storms in region number 6585, including the port name, storm names, and average storm categories? Please consider only named storms in the North Atlantic basin with wind speeds of at least 35 knots and at least minimal tropical storm strength on the SSHS scale. Additionally, ensure that each port is located within a U.S. state boundary."}
{"instance_id": "bq278", "db": "sunroof_solar", "question": "Can you provide a detailed comparison of the solar potential for each state, distinguishing between postal code and census tract levels? Include the number of buildings available for solar installations, the percentage covered by Project Sunroof, the percentage suitable for solar, total potential panel count, total kilowatt capacity, energy generation potential, carbon dioxide offset, and the gap in potential installations."}
{"instance_id": "bq102", "db": "gnomAD", "question": "Identify which start positions are associated with missense variants in the BRCA1 gene on chromosome 17, where the reference base is 'C' and the alternate base is 'T'. Using data from the gnomAD v2.1.1 version."}
{"instance_id": "bq445", "db": "gnomAD", "question": "Find the start and end positions of the BRCA1 gene, and retrieve the first missense variants based on their protein positions within this region. The variants must have a consequence type of \"missense_variant\". Using data from the gnomAD v2.1.1 version."}
{"instance_id": "bq104", "db": "google_trends", "question": "Identify which DMA had the highest search scores for the terms that were top rising one year ago"}
{"instance_id": "bq108", "db": "nhtsa_traffic_fatalities", "question": "Calculate the percentage of traffic accidents in 2015 from January to August that involved multiple people and had multiple instances of severe injuries (injury severity 4)."}
{"instance_id": "bq396", "db": "nhtsa_traffic_fatalities", "question": "Which top 3 states had the largest differences in the number of traffic accidents between rainy and clear weather during weekends in 2016? Please also provide the respective differences for each state."}
{"instance_id": "bq441", "db": "nhtsa_traffic_fatalities", "question": "Please help me compile the critical details on traffic accidents in 2015, as listed in the info document."}
{"instance_id": "bq395", "db": "sdoh", "question": "Which 5 states' percentage change in unsheltered homeless individuals from 2015 to 2018 were top 5 closest to the national average? Please provide the state abbreviation."}
{"instance_id": "bq066", "db": "sdoh", "question": "Could you assess the relationship between the poverty rates from the previous year's census data and the percentage of births without maternal morbidity for the years 2016 to 2018? Use only data for births where no maternal morbidity was reported and for each year, use the 5-year census data from the year before to compute the Pearson correlation coefficient"}
{"instance_id": "bq114", "db": "openaq", "question": "What are the top three cities where the difference between the PM2.5 measurements in 1990 from the EPA and in 2020 from OpenAQ is the greatest, given that the locations are matched with latitude and longitude rounded to two decimal places?"}
{"instance_id": "bq015", "db": "stackoverflow_plus", "question": "Rank the top 10 most discussed tags on Stack Overflow questions that were mentioned on Hacker News since 2014."}
{"instance_id": "bq041", "db": "stackoverflow", "question": "What are the monthly statistics for new StackOverflow users created in 2021, including the percentage of new users who asked questions and the percentage of those who asked questions and then answered questions within their first 30 days?"}
{"instance_id": "bq121", "db": "stackoverflow", "question": "How do the average reputation and number of badges vary among Stack Overflow users based on the number of complete years they have been members, considering only those who joined on or before October 1, 2021?"}
{"instance_id": "bq280", "db": "stackoverflow", "question": "Please provide the display name of the user who has answered the most questions on Stack Overflow, considering only users with a reputation greater than 10."}
{"instance_id": "bq300", "db": "stackoverflow", "question": "What is the highest number of answers received for a single Python 2 specific question on Stack Overflow, excluding any discussions that involve Python 3?"}
{"instance_id": "bq301", "db": "stackoverflow", "question": "Retrieve details of accepted answers related to JavaScript security topics such as XSS, cross-site scripting, exploits, and cybersecurity, for questions posted in January 2016 on Stack Overflow. For each accepted answer, include the answer's ID, the answerer's reputation, score, and comment count, along with the associated question's tags, score, answer count, the asker's reputation, view count, and comment count."}
{"instance_id": "bq303", "db": "stackoverflow", "question": "What are the user IDs and tags for comments, answers, and questions posted by users with IDs between 16712208 and 18712208 on Stack Overflow during July to December 2019?"}
{"instance_id": "bq310", "db": "stackoverflow", "question": "What is the title of the most viewed \"how\" question related to Android development on StackOverflow, across specified tags such as 'android-layout', 'android-activity', 'android-intent', and others"}
{"instance_id": "bq308", "db": "stackoverflow", "question": "Show the number of Stack Overflow questions asked each day of the week in 2021, and find out how many and what percentage of those were answered within one hour."}
{"instance_id": "bq309", "db": "stackoverflow", "question": "Show the top 10 longest Stack Overflow questions where the question has an accepted answer or an answer with a score-to-view ratio above 0.01, including the user's reputation, net votes, and badge count."}
{"instance_id": "bq391", "db": "fhir_synthea", "question": "Could you find out which health conditions have the most types of medications per case, for living patients whose last names start with 'A' and have only one unique condition? I'd like to see the top eight conditions and their codes, ranked by the highest number of different meds prescribed to any single patient."}
{"instance_id": "bq126", "db": "the_met", "question": "What are the titles, artist names, mediums, and original image URLs of objects with 'Photograph' in their names from the 'Photographs' department, created not by an unknown artist, with an object end date of 1839 or earlier?"}
{"instance_id": "bq414", "db": "the_met", "question": "Retrieve the object id, title, and the formatted metadata date (as a string in 'YYYY-MM-DD' format) for objects in the \"The Libraries\" department where the cropConfidence is greater than 0.5, the object's title contains the word \"book\"."}
{"instance_id": "bq200", "db": "baseball", "question": "Show the full name of the fastest pitcher on each team with their maximum valid pitch speed, using both regular and post-season data"}
{"instance_id": "bq458", "db": "word_vectors_us", "question": "Please help me calculate normalized document vectors for each article by tokenizing the body text into words, obtaining word vectors, and weighting these vectors by the 0.4th root of word frequency. Then, aggregate these vectors to form an article vector, and normalize them to unit length. Finally, retrieve the ID, date, title, and the computed article vector for each entry."}
{"instance_id": "bq345", "db": "idc", "question": "How large are the DICOM image files with SEG or RTSTRUCT modalities and the SOP Class UID \"1.2.840.10008.5.1.4.1.1.66.4\", when grouped by collection, study, and series IDs, if they have no references to other series, images, or sources? Can you also provide a viewer URL formatted as \"https://viewer.imaging.datacommons.cancer.gov/viewer/\" followed by the study ID, and list these sizes in kilobytes, sorted from largest to smallest?"}
{"instance_id": "bq346", "db": "idc", "question": "Which five segmentation categories appear most frequently in publicly accessible DICOM SEG data, where the modality is \"SEG\" and the SOPClassUID is \"1.2.840.10008.5.1.4.1.1.66.4\"?"}
{"instance_id": "bq347", "db": "idc", "question": "Which modality has the highest count of SOP instances, including MR series with SeriesInstanceUID = \"1.3.6.1.4.1.14519.5.2.1.3671.4754.105976129314091491952445656147\" and all associated segmentation data, along with the total count of instances?"}
{"instance_id": "bq390", "db": "idc", "question": "Please provide the study instance UIDs for studies that include both T2-weighted axial magnetic resonance imaging and anatomical structure segmentations of the peripheral zone, in prostate repeatability collection."}
{"instance_id": "bq421", "db": "idc", "question": "Can you list all unique pairs of embedding medium and staining substance code meanings, along with the number of occurrences for each pair, based on distinct embedding medium and staining substance codes from the 'SM' modality in the DICOM dataset's un-nested specimen preparation sequences, ensuring that the codes are from the SCT coding scheme?"}
{"instance_id": "bq422", "db": "idc", "question": "What are the average series sizes in MiB for the top 3 patients with the highest slice interval difference tolerance and the top 3 patients with the highest maximum exposure difference, considering only CT images from the 'nlst' collection?"}
{"instance_id": "bq219", "db": "iowa_liquor_sales", "question": "Which two liquor categories, each contributing an average of at least 1% to monthly sales volume over 24 months, have the lowest Pearson correlation coefficient in their sales percentages?"}
{"instance_id": "bq286", "db": "usa_names", "question": "Can you tell me the name of the most popular female baby in Wyoming for the year 2021, based on the proportion of female babies given that name compared to the total number of female babies given the same name across all states?"}
{"instance_id": "bq043", "db": "TCGA", "question": "What are the RNA expression levels of the genes MDM2, TP53, CDKN1A, and CCNE1, along with associated clinical information, in bladder cancer patients with CDKN2A mutations in the 'TCGA-BLCA' project?  Use clinical data from the Genomic Data Commons Release 39, data about somatic mutations derived from the hg19 human genome reference in Feb 2017."}
{"instance_id": "bq176", "db": "TCGA_mitelman", "question": "Identify the case barcodes from the TCGA-LAML study with the highest weighted average copy number in cytoband 15q11 on chromosome 15, using segment data and cytoband overlaps from TCGA's genomic and Mitelman databases."}
{"instance_id": "bq150", "db": "TCGA_hg19_data_v0", "question": "Assess whether different genetic variants affect the log10-transformed TP53 expression levels in TCGA-BRCA samples using sequencing and mutation data. Provide the total number of samples, the number of mutation types, the mean square between groups, the mean square within groups, and the F-statistic."}
{"instance_id": "bq155", "db": "TCGA_hg38_data_v0", "question": "Help me calculate the t-statistic based on the Pearson correlation coefficient between all possible pairs of gene `SNORA31` in the RNAseq data (Log10 transformation) and unique identifiers in the microRNA data available in TCGA. The cohort for this analysis consists of BRCA patients that are 80 years old or younger at the time of diagnosis and Stage I,II,IIA as pathological state. And only consider samples of size more than 25 and with absolute Pearson correlation at least 0.3, and less than 1.0."}
{"instance_id": "bq153", "db": "pancancer_atlas_1", "question": "Calculate the average log10(normalized_count + 1) expression level of the IGF2 gene for each histology type among LGG patients. Include only patients with valid IGF2 expression data and histology types not enclosed in square brackets. Match gene expression and clinical data using ParticipantBarcode."}
{"instance_id": "bq158", "db": "pancancer_atlas_1", "question": "Which top five histological types of breast cancer (BRCA) in the PanCancer Atlas exhibit the highest percentage of CDH1 gene mutations?"}
{"instance_id": "bq159", "db": "pancancer_atlas_1", "question": "Calculate the chi-square value to assess the association between histological types and the presence of CDH1 gene mutations in BRCA patients using data from the PanCancer Atlas. Focus on patients with known histological types and consider only reliable mutation entries.  Exclude any histological types or mutation statuses with marginal totals less than or equal to 10. Match clinical and mutation data using ParticipantBarcode"}
{"instance_id": "bq161", "db": "pancancer_atlas_2", "question": "Calculate the net difference between the number of pancreatic adenocarcinoma (PAAD) patients in TCGA's dataset who are confirmed to have mutations in both KRAS and TP53 genes, and those without mutations in either gene. Utilize patient clinical and follow-up data alongside genomic mutation details from TCGA’s cancer genomics database, focusing specifically on PAAD studies where the mutations have passed quality filters."}
{"instance_id": "bq166", "db": "TCGA_mitelman", "question": "Analyze the largest copy number of chromosomal aberrations including amplifications, gains, homozygous deletions, heterozygous deletions, and normal copy states across cytogenetic bands in TCGA-KIRC kidney cancer samples. Use segment allelic data to identify the maximum copy number aberrations within each chromosomal segment, and report their frequencies, sorted by chromosome and cytoband."}
{"instance_id": "bq451", "db": "_1000_genomes", "question": "Extract genotype data for single nucleotide polymorphisms (SNPs) from chromosome X , ensuring that the start positions are not between 59999 and 2699519 nor between 154931042 and 155260559.   Output the sample ID, counts of homozygous reference alleles, homozygous alternate alleles, heterozygous alternate alleles, the total number of callable sites, the total number of SNVs,  the percentage of heterozygous alternate alleles among all SNVs, and the percentage of homozygous alternate alleles among all SNVs."}
{"instance_id": "bq452", "db": "_1000_genomes", "question": "Identify variants on chromosome 12, calculate their chi-squared scores using allele counts in cases and controls, and return the start, end, chi-squared score (after Yates's correction for continuity) of top variants where the chi-squared score is no less than 29.71679, ensuring that each group has expected counts of at least 5 for the chi-squared calculation."}
{"instance_id": "bq279", "db": "austin", "question": "Can you provide the number of distinct active and closed bike share stations for each year 2013 and 2014?"}
{"instance_id": "bq281", "db": "austin", "question": "What is the highest number of electric bike rides lasting more than 10 minutes taken by subscribers with 'Student Membership' in a single day, excluding rides starting or ending at 'Mobile Station' or 'Repair Shop'?"}
{"instance_id": "bq282", "db": "austin", "question": "Can you tell me the numeric value of the active council district in Austin which has the highest number of bike trips that start and end within the same district, but not at the same station?"}
{"instance_id": "bq284", "db": "bbc", "question": "Can you provide a breakdown of the total number of articles into different categories and the percentage of those articles that mention \"education\" within each category from the BBC News?"}
{"instance_id": "bq425", "db": "ebi_chembl", "question": "List all distinct molecules associated with the company 'SanofiAventis,' along with their trade name and approval date, retaining the most recent approval date for each molecule, using data from ChEMBL Release 23."}
{"instance_id": "bq430", "db": "ebi_chembl", "question": "Find pairs of different molecules tested in the same assay and standard type, where both have 10–15 heavy atoms, fewer than 5 activities in that assay, fewer than 2 duplicate activities, non-null standard values, and pChEMBL values over 10. For each pair, report the maximum heavy atom count, the latest publication date (calculated based on the document's rank within the same journal and year, and map it to a synthetic month and day), the highest document ID, classify the change in standard values as 'increase', 'decrease', or 'no-change' based on their values and relations, and generate UUIDs from their activity IDs and canonical SMILES."}
{"instance_id": "bq432", "db": "fda", "question": "Could you provide me with the cleansed data of food events in January 2015 as listed in the cleansing documentation?"}
{"instance_id": "bq285", "db": "fda", "question": "Could you provide me with the zip code of the location that has the highest number of bank institutions in Florida?"}
{"instance_id": "bq412", "db": "google_ads", "question": "Please provide the page URLs, first shown time, last shown time, removal reason, violation category, and lower and upper bound shown times for the most recent five closed ads in the Croatia region which had shown higher than 10,000 and lower than 25,000, and used at least one audience criterion such as demographics, geographic location, contextual signals, customer lists, or interest topics. The region code of Croatia is HR."}
{"instance_id": "bq070", "db": "idc", "question": "Could you construct a structured clean dataset from `dicom_all` for me? It should retrieve digital slide microscopy (SM) images from the TCGA-LUAD and TCGA-LUSC datasets and meet the requirements in `dicom_dataset_selection.md`. The target labels are tissue type and cancer subtype."}
{"instance_id": "bq320", "db": "idc", "question": "What is the total count of StudyInstanceUIDs that have a segmented property type of '15825003' and belong to the 'Community' or 'nsclc_radiomics' collections?"}
{"instance_id": "bq321", "db": "idc", "question": "How many unique StudyInstanceUIDs are there from the DWI, T2 Weighted Axial, Apparent Diffusion Coefficient series, and T2 Weighted Axial Segmentations in the 'qin_prostate_repeatability' collection?"}
{"instance_id": "bq455", "db": "idc", "question": "Find the top 5 CT scan series ID, including their series number, patient ID, and series size (in MiB), where the series are not classified as 'LOCALIZER' or have the specific JPEG compressed transfer syntaxes '1.2.840.10008.1.2.4.70' or '1.2.840.10008.1.2.4.51'. The series must have consistent slice intervals, exposure levels, image orientation, pixel spacing, image positions, and pixel dimensions. Additionally, the z-axis of the image orientation must align with the expected plane (dot product between 0.99 and 1.01)."}
{"instance_id": "bq398", "db": "world_bank", "question": "What are the top three debt indicators for Russia based on the highest debt values?"}
{"instance_id": "bq399", "db": "world_bank", "question": "Which high-income country had the highest average crude birth rate respectively in each region, and what are their corresponding average birth rate, during the 1980s?"}
{"instance_id": "bq457", "db": "libraries_io", "question": "Get details of repositories that use specific feature toggle libraries. For each repository, include the full name with owner, hosting platform type, size in bytes, primary programming language, fork source name (if any), last update timestamp, the artifact and library names of the feature toggle used, and the library's programming languages. Include repositories that depend on the specified feature toggle libraries, defined by their artifact names, library names, platforms, and languages."}
{"instance_id": "bq229", "db": "open_images", "question": "Can you provide a count of how many image URLs are categorized as ‘cat’ (with label '/m/01yrx' and full confidence) and how many contain no such cat labels(categorized as ‘other’) at all? "}
{"instance_id": "bq424", "db": "world_bank", "question": "List the top 10 countries with respect to the total amount of long-term external debt in descending order, excluding those without a specified region."}
{"instance_id": "bq328", "db": "world_bank", "question": "Which region has the highest median GDP (constant 2015 US$) value?"}
{"instance_id": "bq397", "db": "ecommerce", "question": "Identify the country with the highest total transactions within each channel grouping, provided that the channel includes transactions from more than one country. What is the transaction total for that country?"}
{"instance_id": "bq167", "db": "meta_kaggle", "question": "Please find the giver-and-recipient pair with the most Kaggle forum upvotes. Display their usernames and the respective number of upvotes they gave to each other."}
{"instance_id": "bq072", "db": "death", "question": "Please tell me the total and Black deaths due to vehicle-related incidents and firearms separately, for each age from 12 to 18."}
{"instance_id": "ga001", "db": "ga4", "question": "I want to know the preferences of customers who purchased the Google Navy Speckled Tee in December 2020. What other product was purchased with the highest total quantity alongside this item?"}
{"instance_id": "ga002", "db": "ga4", "question": "Tell me the most purchased other products and their quantities by customers who bought the Google Red Speckled Tee each month for the three months starting from November 2020."}
{"instance_id": "ga003", "db": "firebase", "question": "I'm trying to evaluate which board types were most effective on September 15, 2018. Can you find out the average scores for each board type from the quick play mode completions on that day?"}
{"instance_id": "ga004", "db": "ga4", "question": "Can you figure out the average difference in pageviews between users who bought something and those who didn’t in December 2020? Just label anyone who was involved in purchase events as a purchaser."}
{"instance_id": "ga008", "db": "ga4", "question": "Can you give me the average page views per buyer and total page views among those buyers for each day in November 2020?"}
{"instance_id": "ga017", "db": "ga4", "question": "How many distinct users viewed the most frequently visited page during January 2021?"}
{"instance_id": "ga018", "db": "ga4", "question": "I'd like to analyze the appeal of our products to users. Can you calculate the percentage of times users go from browsing the product list pages to clicking into the product detail pages during a single session on January 2nd, 2021?"}
{"instance_id": "ga010", "db": "ga4", "question": "Can you give me an overview of our website traffic for December 2020? I'm particularly interested in the channel with the fourth highest number of sessions."}
{"instance_id": "ga012", "db": "ga4", "question": "Find the transaction IDs, total item quantities, and purchase revenues for the item category with the highest tax rate on November 30, 2020."}
{"instance_id": "ga019", "db": "firebase", "question": "Could you determine what percentage of users either did not uninstall our app within seven days or never uninstalled it after installing during August and September 2018?"}
{"instance_id": "ga028", "db": "firebase", "question": "Please perform a 7-day retention analysis for users who first used the app during the week starting on July 2, 2018. Provide the total number of these new users and the number of retained users for each week from Week 0 (the initial week) through Week 4."}
{"instance_id": "ga020", "db": "firebase", "question": "Which quickplay event type had the lowest user retention rate during the second week after their initial engagement, for users who first engaged between August 1 and August 15, 2018?"}
{"instance_id": "ga021", "db": "firebase", "question": "What is the retention rate for users two weeks after their initial quickplay event within the period from July 2, 2018, to July 16, 2018, calculated separately for each quickplay event type?"}
{"instance_id": "ga022", "db": "firebase", "question": "Could you please help me get the weekly customer retention rate in September 2018 for new customers who first used our app within the first week starting from September 1st, 2018 (timezone in Shanghai)? The retention rates should cover the following 3-week period after the initial use and display them in column format."}
{"instance_id": "local002", "db": "E_commerce", "question": "Can you calculate the 5-day symmetric moving average of predicted toy sales for December 5 to 8, 2018, using daily sales data from January 1, 2017, to August 29, 2018, with a simple linear regression model? Provide the total of the moving averages for those four days."}
{"instance_id": "local003", "db": "E_commerce", "question": "According to the RFM definition document, how much is the average sales per order for each customer within distinct RFM segments, considering only 'delivered' orders? Please rank the customers into segments to analyze differences in average sales across these segments"}
{"instance_id": "local004", "db": "E_commerce", "question": "Could you tell me the number of orders, average payment per order and customer lifespan in weeks of the 3 custumers with the highest average payment per order. Attention: I want the lifespan in float number if it's longer than one week, otherwise set it to be 1.0."}
{"instance_id": "local008", "db": "Baseball", "question": "I would like to know the given names of baseball players who have achieved the highest value of games played, runs, hits, and home runs, with their corresponding score values."}
{"instance_id": "local009", "db": "Airlines", "question": "What is the distance of the longest route where Abakan is either the departure or destination city (in kilometers)?"}
{"instance_id": "local010", "db": "Airlines", "question": "Distribute all the unique city pairs into the distance ranges 0, 1000, 2000, 3000, 4000, 5000, and 6000+, based on their average distance of all routes between them. Then how many pairs are there in the distance range with the fewest unique city paires?"}
{"instance_id": "local015", "db": "California_Traffic_Collision", "question": "Help me respectively caulculate the percentage of motorcycle accident fatalities involving riders who were wearing helmets and those who weren't?"}
{"instance_id": "local017", "db": "California_Traffic_Collision", "question": "In which year were the two most common causes of traffic accidents different from those in other years?"}
{"instance_id": "local019", "db": "WWE", "question": "For the NXT title that had the shortest match (excluding titles with \"title change\"), what were the names of the two wrestlers involved?"}
{"instance_id": "local026", "db": "IPL", "question": "Please help me find the top 3 bowlers who conceded the maximum runs in a single over, along with the corresponding matches."}
{"instance_id": "local022", "db": "IPL", "question": "Show me the names of strikers who scored no less than 100 runs in a match, but their team lost the game?"}
{"instance_id": "local028", "db": "Brazilian_E_Commerce", "question": "Could you generate a report that shows the number of delivered orders for each month in the years 2016, 2017, and 2018? Each column represents a year, and each row represents a month"}
{"instance_id": "local031", "db": "Brazilian_E_Commerce", "question": "What is the highest monthly delivered orders volume in the year with the lowest annual delivered orders volume among 2016, 2017, and 2018?"}
{"instance_id": "local030", "db": "Brazilian_E_Commerce", "question": "Can you find the average payments and order counts for the five cities with the lowest total payments from delivered orders?"}
{"instance_id": "local034", "db": "Brazilian_E_Commerce", "question": "Could you help me calculate the average of the total payment count for the most preferred payment method in each product category?"}
{"instance_id": "local035", "db": "Brazilian_E_Commerce", "question": "Please help me find two adjacent cities with the greatest distance between them."}
{"instance_id": "local038", "db": "Pagila", "question": "Could you help me find the actor who appeared most in English G or PG-rated children's movies no longer than 2 hours, released between 2000 and 2010？Give me a full name."}
{"instance_id": "local039", "db": "Pagila", "question": "Please help me find the film category with the highest total rental hours in cities where the city's name either starts with \"A\" or contains a hyphen. "}
{"instance_id": "local041", "db": "modern_data", "question": "What percentage of trees in the Bronx have a health status of Good?"}
{"instance_id": "local049", "db": "modern_data", "question": "Can you help me calculate the average number of new unicorn companies per year in the top industry from 2019 to 2021?"}
{"instance_id": "local054", "db": "chinook", "question": "Could you tell me the first names of customers who spent less than $1 on albums by the best-selling artist, along with the amounts they spent?"}
{"instance_id": "local056", "db": "SQLITE_SAKILA", "question": "Which customer has the highest average monthly change in payment amounts? Provide the customer's full name."}
{"instance_id": "local058", "db": "education_business", "question": "Can you provide a list of hardware product segments along with their unique product counts for 2020 in the output, ordered by the highest percentage increase in unique fact sales products from 2020 to 2021?"}
{"instance_id": "local059", "db": "education_business", "question": "For the calendar year 2021, what is the overall average quantity sold of the top three best-selling hardware products (by total quantity sold) in each division?"}
{"instance_id": "local063", "db": "complex_oracle", "question": "Which product has the smallest change in sales share for each product from the top 20% of products by total sales between Q4 in 2019 and 2020 in US without any promotion?"}
{"instance_id": "local067", "db": "complex_oracle", "question": "Can you provide the highest and lowest profits for Italian customers segmented into ten evenly divided tiers based on their December 2021 sales profits?"}
{"instance_id": "local071", "db": "city_legislation", "question": "Could you review our records in June 2022 and identify which countries have the longest streak of consecutive inserted city dates? Please list the 2-letter length country codes of these countries."}
{"instance_id": "local072", "db": "city_legislation", "question": "Identify the country with data inserted on nine different days in January 2022. Then, find the longest consecutive period with data insertions for this country during January 2022, and calculate the proportion of entries that are from its capital city within this longest consecutive insertion period."}
{"instance_id": "local073", "db": "modern_data", "question": "Let's generate a report for each pizza order that lists the pizza name followed by \": \", then all the ingredients in alphabetical order. If any ingredient is ordered more than once, indicate it with '2x' directly in front of the ingredient without a space."}
{"instance_id": "local065", "db": "modern_data", "question": "Calculate the total income from Meat Lovers pizzas priced at $12 and Vegetarian pizzas at $10. Include any extra toppings charged at $1 each. Ensure that canceled orders are filtered out. How much money has Pizza Runner earned in total?"}
{"instance_id": "local064", "db": "bank_sales_trading", "question": "What is the difference in average month-end balance between the month with the most and the month with the fewest customers having a positive balance in 2020?"}
{"instance_id": "local299", "db": "bank_sales_trading", "question": "Could you calculate each user’s average balance over the past 30 days, computed daily? Then, for each month (based on the 1st of each month), find the highest of these daily averages for each user. Add up these maximum values across all users for each month as the final result. Please use the first month as a baseline for previous balances and exclude it from the output."}
{"instance_id": "local300", "db": "bank_sales_trading", "question": "Could you calculate the highest daily balance each customer had within each month? Treat any negative daily balances as zero. Then, for each month, add up these maximum daily balances across all customers to get a monthly total."}
{"instance_id": "local075", "db": "bank_sales_trading", "question": "Can you provide a breakdown of how many times each product was viewed, how many times they were added to the shopping cart, and how many times they were left in the cart without being purchased? Also, give me the count of actual purchases for each product. Ensure that products with a page id in (1, 2, 12, 13) are filtered out."}
{"instance_id": "local081", "db": "northwind", "question": "How many customers were in each spending group in 1998, and what percentage of the total customer base does each group represent?"}
{"instance_id": "local099", "db": "DB_IMDB", "question": "I need you to look into the actor collaborations and tell me how many actors have made more films with Yash Chopra than with any other director. This will help us understand his influence on the industry better."}
{"instance_id": "local131", "db": "EntertainmentAgency", "question": "Could you list each musical style with the number of times it appears as a 1st, 2nd, or 3rd preference in a single row per style?"}
{"instance_id": "local132", "db": "EntertainmentAgency", "question": "Show entertainer and customer pairs where both the first and second style preferences of customers match the first and second strengths of entertainers (or vice versa), displaying only the entertainer's stage name and the customer's last name."}
{"instance_id": "local141", "db": "AdventureWorks", "question": "How did each salesperson's annual total sales compare to their annual sales quota? Provide the difference between their total sales and the quota for each year, organized by salesperson and year."}
{"instance_id": "local152", "db": "imdb_movies", "question": "Can you provide the top 9 directors by movie count, including their ID, name, number of movies, average inter-movie duration (rounded to the nearest integer), average rating (rounded to 2 decimals), total votes, minimum and maximum ratings, and total movie duration? Sort the output first by movie count in descending order and then by total movie duration in descending order."}
{"instance_id": "local156", "db": "bank_sales_trading", "question": "Can you analyze the yearly average cost of Bitcoin purchases by region, excluding the first year's data? Rank the regions based on these averages each year and calculate the annual percentage change in cost."}
{"instance_id": "local157", "db": "bank_sales_trading", "question": "For our upcoming meeting, please provide the daily percentage change in trading volume for all tickers from August 1 to August 10, 2021. Use the Bitcoin transaction data to calculate."}
{"instance_id": "local168", "db": "city_legislation", "question": "What is the average salary for remote Data Analyst jobs requiring the top three most in-demand skills?"}
{"instance_id": "local194", "db": "SQLITE_SAKILA", "question": "Please provide a list of the top three revenue-generating films for each actor, along with the average revenue per actor in those films, calculated by dividing the total film revenue equally among the actors for each film."}
{"instance_id": "local195", "db": "SQLITE_SAKILA", "question": "Please find out how widespread the appeal of our top five actors is. What percentage of our customers have rented films featuring these actors?"}
{"instance_id": "local199", "db": "SQLITE_SAKILA", "question": "Can you identify the year and month with the highest rental orders created by the store's staff for each store? Please list the store ID, the year, the month, and the total rentals for those dates."}
{"instance_id": "local209", "db": "delivery_center", "question": "What is the ratio of completed orders to total orders for the store with the highest number of orders?"}
{"instance_id": "local210", "db": "delivery_center", "question": "Can you identify the hubs that saw more than a 20% increase in finished orders from February to March?"}
{"instance_id": "local218", "db": "EU_soccer", "question": "Can you calculate the median from the highest season goals of each team?"}
{"instance_id": "local244", "db": "music", "question": "Calculate the duration of each track, classify them as short, medium, or long, output the minimum and maximum time for each kind (in minutes) and the total revenue for each category, group by the category."}
{"instance_id": "local259", "db": "IPL", "question": "For each player, list their ID, name, most frequent role across all matches, batting hand, bowling skill, total runs scored, total matches played, total dismissals, batting average, highest score in a single match, number of matches where their score exceeded 30, 50, and 100, total balls faced in their career, strike rate, total wickets taken, economy rate, and their best performance in a single match (most wickets taken, in the format \"wickets taken-runs given\"). Ignore the extra runs data."}
{"instance_id": "local263", "db": "stacking", "question": "Which L1_model has the highest occurrence for each status ('strong,' where the maximum test score for non-'Stack' models is less than the 'Stack' score, and 'soft,' where it equals the 'Stack' score), and how many times does it occur?"}
{"instance_id": "local269", "db": "oracle_sql", "question": "What is the average total quantity across all final packaging combinations, considering all items contained within each combination?"}
{"instance_id": "local273", "db": "oracle_sql", "question": "What is the average pick percentage for each product (by name), considering the quantity picked from inventory locations that are ordered by the earliest purchase date and smallest quantity, while ensuring that the picked quantity matches the overlapping range between the order quantity and the available inventory?"}
{"instance_id": "local274", "db": "oracle_sql", "question": "Which products were picked for order 421, and what is the average number of units picked for each product, using FIFO (First-In, First-Out) method?"}
{"instance_id": "local283", "db": "EU_soccer", "question": "Analyze our match data to identify the name, leagues, and countries of the champion team for each season. Include the total points accumulated by each team."}
{"instance_id": "local285", "db": "bank_sales_trading", "question": "For veg whsle data, can you analyze our financial performance over the years 2020 to 2023? I need insights into the average wholesale price, maximum wholesale price, minimum wholesale price, wholesale price difference, total wholesale price, total selling price, average loss rate, total loss, and profit for each category within each year. Round all calculated values to two decimal places."}
{"instance_id": "local329", "db": "log", "question": "How many unique sessions visited the /regist/input page and then the /regist/confirm page, in that order?"}
{"instance_id": "local360", "db": "log", "question": "Identify the sessions with the fewest events lacking both '/detail' clicks and '/complete' conversions, considering only non-empty search types. If multiple sessions share the lowest count, include all of them. For each session, display the associated paths and search types."}
{"instance_id": "local336", "db": "f1", "question": "How many overtakes of each type occurred during the first five laps of the race?"}
{"instance_id": "local309", "db": "f1", "question": "For each year, which driver and which constructor scored the most points? I want the full name of each driver."}
{"instance_id": "local311", "db": "f1", "question": "Which constructors had the top 3 combined points from their best driver and team, and in which years did they achieve them?"}
{"instance_id": "local354", "db": "f1", "question": "Which Formula 1 drivers, during the 1950s, had seasons in which they did not change their constructors at the beginning and end of the year and participated in at least two different race rounds within those seasons?"}
{"instance_id": "local355", "db": "f1", "question": "Calculate the average first and last rounds of races missed by drivers each year. Only include drivers who missed fewer than three races annually and switched teams between their first and last missed races"}
{"instance_id": "sf001", "db": "GLOBAL_WEATHER__CLIMATE_DATA_FOR_BI", "question": "Assuming today is April 1, 2024, I would like to know the daily snowfall amounts greater than 6 inches for each U.S. postal code during the week ending after the first two full weeks of the previous year. Show the postal code, date, and snowfall amount."}
{"instance_id": "sf002", "db": "FINANCE__ECONOMICS", "question": "As of December 31, 2022, list the top 10 active large banks, each with assets over $10 billion, that have the highest percentage of uninsured assets based on quarterly estimates. Provide the names of these banks and their respective percentages of uninsured assets."}
{"instance_id": "sf044", "db": "FINANCE__ECONOMICS", "question": "What was the percentage change in post-market close prices for the Magnificent 7 tech companies from January 1 to June 30, 2024?"}
{"instance_id": "sf012", "db": "WEATHER__ENVIRONMENT", "question": "What were the total amounts of building and contents damage reported under the National Flood Insurance Program in the City of New York for each year from 2010 to 2019?"}
{"instance_id": "sf018", "db": "BRAZE_USER_EVENT_DEMO_DATASET", "question": "Examine user engagement with push notifications within a specified one-hour window on June 1, 2023."}
{"instance_id": "sf040", "db": "US_ADDRESSES__POI", "question": "Find the top 10 northernmost addresses in Florida's largest zip code area. What are their address numbers, street names, and types?"}
{"instance_id": "sf011", "db": "CENSUS_GALAXY__ZIP_CODE_TO_BLOCK_GROUP_SAMPLE", "question": "Determine the population distribution within each block group relative to its census tract in New York State using 2021 ACS data. Include block group ID, census value, state county tract ID, total tract population, and the population ratio of each block group."}
{"instance_id": "sf014", "db": "CENSUS_GALAXY__AIML_MODEL_DATA_ENRICHMENT_SAMPLE", "question": "What is the New York State ZIP code with the highest number of commuters traveling over one hour, according to 2021 ACS data? Include the zip code, the total commuters, state benchmark for this duration, and state population."}
