{"instance_id": "sf_bq052", "db": "PATENTSVIEW", "question": "I wonder which patents within CPC subsection 'C05' or group 'A01G' in the USA have at least one forward or backward citations within one month of their application dates. Give me the ids, titles, application date, forward/backward citation counts and summary texts.", "external_knowledge": null, "plan": "1. Identify Relevant Patents:\n   - Select patents in the USA that belong to specific CPC categories (either a particular subsection or group).\n\n2. Citation Filtering:\n   - Determine patents with at least one forward or backward citation within one month of their application dates. Count these citations separately for forward and backward directions.\n\n3. Data Aggregation:\n   - For each relevant patent, gather the patent ID, title, application date, forward and backward citation counts, and summary text.\n\n4. Combine and Order Results:\n   - Join the relevant patent data with citation counts and summary texts, and then order the results by the application date.", "special_function": ["conversion-functions/SAFE_CAST", "date-functions/DATE", "date-functions/DATE_ADD", "date-functions/DATE_SUB", "conditional-functions/IFNULL"]}
{"instance_id": "bq076", "db": "chicago", "question": "Which month generally has the greatest number of motor vehicle thefts in 2016?", "external_knowledge": null, "plan": "Which month generally has the greatest number of motor vehicle thefts?\nThe following query summarizes the number of MOTOR VEHICLE THEFT incidents for each year and month, and ranks the month’s total from 1 to 12. Then, the outer SELECT clause limits the final result set to the first overall ranking for each year. According to the data, in 3 of the past 10 years, December had the highest number of car thefts", "special_function": ["date-functions/DATE", "date-functions/EXTRACT", "datetime-functions/EXTRACT", "interval-functions/EXTRACT", "numbering-functions/RANK", "time-functions/EXTRACT", "timestamp-functions/EXTRACT"]}
{"instance_id": "local168", "db": "city_legislation", "question": "What is the average salary for remote Data Analyst jobs requiring the top three most in-demand skills?", "external_knowledge": null, "plan": "1. **Identify Top Skills by Demand:**\n   - Create a temporary dataset to count how many job postings require each skill.\n   - Filter the dataset to include only remote job postings for the specified job title that have a salary listed.\n   - Group the data by skill and count the number of job postings for each skill.\n   - Order the skills by the count in descending order and select the top three most in-demand skills.\n\n2. **Calculate Average Salary for Each Skill:**\n   - Create another temporary dataset to calculate the average salary for job postings that require each skill.\n   - Filter the dataset similarly to include only remote job postings for the specified job title with a listed salary.\n   - Group the data by skill and calculate the average salary for job postings that require each skill.\n\n3. **Combine Top Skills with Their Salaries:**\n   - Join the dataset of top three most in-demand skills with the dataset of average salaries by skill.\n   - Select the average salary values for these top skills.\n\n4. **Calculate Overall Average Salary:**\n   - Calculate the average of the average salaries obtained for the top three most in-demand skills.\n   - Return this value as the final result.", "special_function": null}
