{
    "table_name": "healthcare_provider_taxonomy_code_set_161",
    "table_fullname": "bigquery-public-data.nppes.healthcare_provider_taxonomy_code_set_161",
    "column_names": [
        "code",
        "grouping",
        "classification",
        "specialization",
        "definition",
        "notes"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "code",
        "grouping",
        "classification",
        "specialization",
        "definition",
        "notes"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        "",
        "",
        "",
        "",
        "",
        ""
    ],
    "sample_rows": [
        {
            "code": "101Y00000X",
            "grouping": "",
            "classification": "Counselor",
            "specialization": "",
            "definition": "A provider who is trained and educated in the performance of behavior health services through interpersonal communications and analysis. Training and education at the specialty level usually requires a master’s degree and clinical experience and supervision for licensure or certification.",
            "notes": "Sources: Abridged from definitions provided by the National Board of Certified Counselors and the American Association of Pastoral Counselors."
        },
        {
            "code": "102L00000X",
            "grouping": "",
            "classification": "Psychoanalyst",
            "specialization": "",
            "definition": "Psychoanalysis is a comprehensive, theoretical framework which, when applied to a treatment process, consists of an intensive verbal, therapeutic relationship between an analyst and an analysand which aims for symptom relief, emotional growth, and personal integration. The psychoanalytic treatment process includes, but is not limited to, the recognition of unconscious processes and conflicts; the significance of developmental influences; and the impact of resistances, defenses, transference and countertransference phenomena. Treatment is enhanced by an understanding developed in the analyst’s training and personal analysis of unconscious manifestations, such as dreams, slips of the tongue, fantasies and day dreams. Psychoanalytic technique varies in relation to theoretical orientation.",
            "notes": "Source:  Registry of Psychoanalysts published by the National Association for the Advancement of Psychoanalysis [1/1/2007: new; 7/1/2007: definition changed, source changed]"
        },
        {
            "code": "102X00000X",
            "grouping": "",
            "classification": "Poetry Therapist",
            "specialization": "",
            "definition": "A medical or mental health professional who has attained credentials after satisfactorily completing a poetry therapy training program approved by the National Federation for Biblio/Poetry Therapy (NFBPT). Training includes didactic work, peer group experience, and supervised practicum.  An NFBPT credentialed certified poetry therapist (CPT) or registered poetry therapist (PTR) integrates discussion of published literature and reflective or creative writing into the psychotherapeutic process to achieve goals of emotional well-being, symptom reduction, and improved interpersonal communication.  Certified poetry therapists and registered poetry therapists are licensed mental health professionals with advanced training in the theory and practice of poetry therapy. CPTs and PTRs are qualified to work independently with emotionally troubled populations in clinical, rehabilitative, community and educational institutions. They also work with emotionally healthy individuals adjusting to developmental issues, life crises, or disabilities. The PTR completes an advanced level of training and fieldwork, commensurate with the highest levels of clinical practice. The terms poetry therapy, applied poetry facilitation, journal therapy, bibliotherapy, biblio/poetry therapy, and poetry/journal therapy reflect the interactive use of literature and/or writing to promote personal growth and emotional healing. In addition to poetry, poetry therapy applies all forms or written and spoken language including story, myth, folk and fairy tale and other genres of poetic expression as well as journal, memoir, and narrative. The poetry therapy process integrates discussion of published literature and reflective or creative writing for expression and communication of thoughts and feelings to facilitate participants' emotional well-being. The field of poetry therapy encompasses all of these modalities, though only a duly trained and licensed clinical practitioner can be credentialed as CPT or PTR.",
            "notes": "Source: The National Federation for Biblio/Poetry Therapy [7/1/2007: new]"
        },
        {
            "code": "103G00000X",
            "grouping": "",
            "classification": "Clinical Neuropsychologist",
            "specialization": "",
            "definition": "An individual with a doctorate degree, licensure in clinical psychology and specialized training or board certification in neuropsychology who practices or adheres to the principles of neuropsychology; a specialty within the field of psychology focusing primarily on neurobehavioral functioning.",
            "notes": "Source: American Psychological Association, Washington, DC, 1997. [1/1/2007: title modified]"
        },
        {
            "code": "103K00000X",
            "grouping": "",
            "classification": "Behavioral Analyst",
            "specialization": "",
            "definition": "A behavior analyst is qualified by at least a master’s degree and Behavior Analyst Certification Board certification and/or a state-issued credential (such as a license) to practice behavior analysis independently. Behavior analysts provide the required supervision to assistant behavior analysts and behavior technicians. A behavior analyst delivers services consistent with the dimensions of applied behavior analysis. Common services may include, but are not limited to, conducting behavioral assessments, analyzing data, writing and revising behavior-analytic treatment plans, training others to implement components of treatment plans, and overseeing implementation of treatment plans.",
            "notes": "Source: Association of Professional Behavior Analysts, www.apbahome.net and Behavior Analyst Certification Board (http://www.bacb.com) [7/1/2008: new, 1/1/2016: modified definition]"
        }
    ]
}