{
    "table_name": "brf_sum_text",
    "table_fullname": "patents-public-data.patentsview.brf_sum_text",
    "column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "c793pgux92l5spwjidmbpyaj2",
            "patent_id": "8893141",
            "text": "BACKGROUND Computer applications are developed to operate on a particular computing platform. Traditionally, computing platforms are designed to control a single computer and, as a result, the applications designed for the computing platform also are designed to operate on a single computer. The Internet has introduced new ways in which computer programs are deployed to computers. While the method of deployment has changed, the end users still expect computer applications to operate the same regardless if they are deployed over the Internet or residing on the end user's computer. Embodiments of the present invention relate to systems, methods and computer storage media for operating a scalable computing platform. A service description describing a requested service is received. Upon receiving the service description, a determination of the required resources and the available resources is made. The resources required to sustain the deployment of the service are mapped to the available resources of the computing platform so the service may be deployed. An instance description is amended with each deployment of the service to allow for sustained deployment of the service. This Summary is provided to introduce a selection of concepts in a simplified form that are further described below in the Detailed Description. This Summary is not intended to identify key features or essential features of the claimed subject matter, nor is it intended to be used as an aid in determining the scope of the claimed subject matter."
        },
        {
            "uuid": "id7dq3pcc0ysxz50phxee60wf",
            "patent_id": "7605659",
            "text": "The present disclosure generally relates to electronic circuits. More particularly, the present disclosure relates to a technique for adjusting the gain associated with a programmable gain amplifier. BACKGROUND Many electronic systems employ programmable gain amplifiers as a basic analog building block. An example of a conventional programmable gain amplifier ( 800 ) is illustrated in FIG. 8 . Programmable gain amplifier 800 includes an operational amplifier (AMP), three resistors (R 81 -R 83 ), and two switches (S 81 -S 82 ). The operational amplifier includes a non-inverting input terminal (INP), an inverting input terminal (INM), and an output terminal (AOUT). Switch S 81 is connected between AOUT and node N 81 . Switch S 82 is connected between AOUT and node N 82 . Resistor R 81 is connected between node N 81 and INM. Resistor R 82 is connected between node N 82 and INM. Resistor R 83 is connected between INM and a circuit ground (GND). In operation, operational amplifier AMP is configured to receive an input signal (e.g., IN) at the non-inverting input (INP), and provide an output signal (e.g. OUT) at the output terminal (AOUT) that is related to the input signal according to a gain scaling factor (X). The gain scaling factor (X) is determined by the impedance in the feedback path between the output (OUT) and the inverting input (INM). Switches S 81 and S 82 are arranged to change the selection of the feedback components (resistors R 81 and R 82 ) to adjust the gain scaling factor (X). The selected feedback component is resistor R 81 when switch S 81 is closed, while the selected feedback component is resistor R 82 when switch S 82 is closed. The relationship between the input signal (IN) and the output signal (OUT) is determined by the feedback components and the switches as follows: OUT=IN * (1+X), where X is determined by the feedback components. In one example, X=R 81 /R 83 when switch S 1 is closed and switch S 2 is open. In another example, X=R 82 /R 83 when switch S 2 is closed and switch S 1 is open."
        },
        {
            "uuid": "acak016anjfvk7m18ccoiprem",
            "patent_id": "PP12790",
            "text": "LATIN NAME OF GENUS AND SPECIES OF PLANT CLAIMED Verbena hybrida. VARIETY DENOMINATION 'Balazplum'. BACKGROUND OF INVENTION The present invention comprises a new and distinct verbena plant, botanically known as Verbena hybrida, and hereinafter referred to by the cultivar name 'Balazplum'. The new cultivar was developed by the inventor through a controlled breeding program during 1998 at Arroyo Grande, Calif. The objective of the breeding program was the development of verbena cultivars with semi-trailing mounded habit, continuous flowering, excellent basal branching and small, dark green foliage. The female (seed) parent of 'Balazplum' was the proprietary verbena cultivar designated PAS36117 (not patented), which exhibits a semi-trailing habit, dark purple flowers and serrated, medium green foliage. The male (pollen) parent of 'Balazplum' was the commercially available verbena cultivar, 'Temari Patio Hot Pink' (not patented), which exhibits a vigorous, trailing habit, hot pink flowers and dark green foliage. Asexual reproduction of the new cultivar by terminal cuttings in Arroyo Grande, Calif. and West Chicago, Ill. has demonstrated that the characteristics of the new cultivar as herein described are firmly fixed and retained through successive generations of such asexual propagation. SUMMARY OF INVENTION It was found that the cultivar of the present invention: (a) exhibits purple flowers, (b) forms deeply cleft, dark green foliage (c) exhibits a good basal branching character and (d) exhibits a mounded and trailing growth habit. The new cultivar of the present invention can be compared to 'Temari Bright Pink'. In side by side comparison, plants of the new cultivar differ from plants of 'Temari Bright Pink' by the following characteristics: it is found that the new cultivar is taller, has larger more deeply cleft leaves and flowers and calyx of a different color as detailed in TABLE A. When the new cultivar of the present invention is compared to its seed parent, PAS36117, the new cultivar is distinguished from 'PAS36117' primarily in petal coloration and leaf margin. When the new cultivar of the present invention is compared to its pollen parent, 'Temari Patio Hot Pink', the new cultivar is distinguished from 'Temari Patio Hot Pink' primarily in petal coloration."
        },
        {
            "uuid": "flvbota59oraumnizeipxgz9f",
            "patent_id": "6463813",
            "text": "TECHNICAL FIELD This invention relates to sensing pressure in pipes, and more particularly to a non-intrusive displacement based pressure sensor for measuring pressures of a medium within pipes. BACKGROUND ART It is known in the oil and gas industry that the measurement of fluid pressure in a down-hole pipe is useful to exploration and production of oil and gas. However, typical pressure sensors require that a hole be drilled in the pipe to port the pressure to the sensor, or that the sensor or portion thereof be deployed in the pipe. Drilling holes in the pipes can be costly and add failure modes to the system. Accordingly, it would be desirable to measure pressure in a pipe in a non-invasive manner. SUMMARY OF THE INVENTION Objects of the present invention include provision of a non-intrusive pressure sensor for measuring unsteady pressure in pipes. According to the present invention, a pressure sensor for measuring unsteady pressure in at least one axial location along a pipe comprises a displacement based sensor disposed on a surface of the pipe. According still further to the present invention, the surface of the pipe provides a radial displacement response to the unsteady pressures within the pipe and the displacement-based sensors measure the magnitude of the response and provide a signal proportional to the unsteady pressure. According still further to the present invention, the displacement based sensor may measure the acceleration, velocity or displacement of the surface of the pipe in response to the unsteady pressure. According still further to the present invention, a signal processor provides a signal indicative of the unsteady pressure. The present invention provides a significant improvement over the prior art by providing a non-intrusive pressure sensor for the measurement of unsteady (ac or dynamic) pressure in a fluid within a pipe using displacement based sensors. Thus, the present invention enables real time pressure measurement for oil and gas exploration and production or for other applications where a fluid (liquid or gas) is flowing in a pipe or conduit. The foregoing and other objects, features and advantages of the present invention will become more apparent in light of the following detailed description of exemplary embodiments thereof."
        },
        {
            "uuid": "d8dei4v8d334ntqen07acvx7w",
            "patent_id": "9427325",
            "text": "The present disclosure generally relates to medical devices for the treatment of musculoskeletal disorders, and more particularly to a surgical system that includes an interbody implant and a method for treating a spine. BACKGROUND Spinal disorders such as degenerative disc disease, disc herniation, osteoporosis, spondylolisthesis, stenosis, scoliosis and other curvature abnormalities, kyphosis, tumor, and fracture may result from factors including trauma, disease and degenerative conditions caused by injury and aging. Spinal disorders typically result in symptoms including pain, nerve damage, and partial or complete loss of mobility. Non-surgical treatments, such as medication, rehabilitation and exercise can be effective, however, may fail to relieve the symptoms associated with these disorders. Surgical treatment of these spinal disorders includes fusion, fixation, corpectomy, discectomy, laminectomy and implantable prosthetics. In procedures, such as, for example, corpectomy and discectomy, fusion and fixation treatments may be performed that employ implants to restore the mechanical support function of vertebrae. This disclosure describes an improvement over these prior art technologies. In one embodiment, an interbody endcap is disclosed. The interbody endcap includes a wall having a first surface connected to an interbody implant and a second surface including an arcuate portion configured for engagement with a vertebral endplate surface. The second surface extends outwardly from the interbody implant to at least adjacent a perimeter of the vertebral endplate surface. In some embodiments, systems and methods are disclosed. In one embodiment, the interbody endcap includes a wall having a first surface including a first mating part disposed for engagement with a second mating part of an interbody implant such that the first surface is aligned with the interbody implant such that the wall is disposable in an interlocking configuration with the interbody implant. At least one of the mating parts includes a relatively movable member that is engageable with the other of the mating parts to dispose the wall and the interbody implant in the interlocking configuration. The wall further has a second surface configured for engagement with a vertebral endplate surface."
        }
    ]
}