{
    "table_name": "brf_sum_text_2021",
    "table_fullname": "patents-public-data.patentsview.brf_sum_text_2021",
    "column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "uuid",
        "patent_id",
        "text"
    ],
    "nested_column_types": [
        "STRING",
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null,
        null
    ],
    "sample_rows": [
        {
            "uuid": "001d1455-9949-11eb-9615-121df0c29c1e",
            "patent_id": "10881341",
            "text": "INCORPORATION BY REFERENCE\n\nPatents, applications and/or publications described herein, including the following patents, applications and/or publications are incorporated herein by reference for all purposes: U.S. Pat. Nos. 4,545,382; 4,711,245; 5,262,035; 5,262,305; 5,264,104; 5,320,715; 5,356,786; 5,509,410; 5,543,326; 5,593,852; 5,601,435; 5,628,890; 5,820,551; 5,822,715; 5,899,855; 5,918,603; 6,071,391; 6,103,033; 6,120,676; 6,121,009; 6,134,461; 6,143,164; 6,144,837; 6,161,095; 6,175,752; 6,270,455; 6,284,478; 6,299,757; 6,338,790; 6,377,894; 6,461,496; 6,503,381; 6,514,460; 6,514,718; 6,540,891; 6,560,471; 6,579,690; 6,591,125; 6,592,745; 6,600,997; 6,605,200; 6,605,201; 6,616,819; 6,618,934; 6,650,471; 6,654,625; 6,676,816; 6,730,200; 6,736,957; 6,746,582; 6,749,740; 6,764,581; 6,773,671; 6,881,551; 6,893,545; 6,932,892; 6,932,894; 6,942,518; 7,041,468; 7,167,818; and 7,299,082; 7,381,184; 7,740,581; 7,811,231 U.S. Published Application Nos. 2005/0182306, now U.S. Pat. No. 8,771,183; 2006/0091006; 2007/0056858, now U.S. Pat. No. 8,298,389; 2007/0068807, now U.S. Pat. No. 7,846,311; 2007/0095661; 2007/0108048, now U.S. Pat. No. 7,918,975; 2007/0149873, now U.S. Pat. No. 9,014,773; 2007/0149875, now U.S. Pat. No. 8,515,518; 2007/0199818, now U.S. Pat. No. 7,811,430; 2007/0227911, now U.S. Pat. No. 7,887,682; 2007/0233013; 2008/0058625, now U.S. Pat. No. 7,920,907; 2008/0064937; 2008/0066305, now U.S. Pat. No. 7,895,740; 2008/0071157; 2008/0071158; 2008/0081977, now U.S. Pat. No. 7,618,369; 2008/0102441, now U.S. Pat. No. 7,822,557; 2008/0148873, now U.S. Pat. No. 7,802,467; 2008/0161666; 2008/0179187, now U.S. Pat. No. 8,808,515; 2008/0267823; 2008/0319295, now U.S. Pat. No. 8,597,188; 2008/0319296, now U.S. Pat. No. 8,617,069; 2009/0018425, now U.S. Pat. No. 8,160,670; 2009/0247857, now U.S. Pat. No. 8,346,335; 2009/0257911, now U.S. Pat. No. 8,252,229, 2009/0281406; 2009/0294277; 2009/0054748, now U.S. Pat. No. 7,885,698; 2009/0054749; 2010/0030052; 2010/0065441, now U.S. Pat. No. 8,636,884; 2010/0081905, now U.S. Pat. No. 8,983,568; 2010/0081909, now U.S. Pat. No. 8,219,173; 2010/0213057; 2010/0325868, now U.S. Pat. No. 7,866,026; 2010/0326842; 2010/0326843, now U.S. Pat. No. 8,437,827; 2010/0331643; 2011/0046466; U.S. patent application Ser. No. 12/624,767, now U.S. Patent Publ. No. 2011/0124993; Ser. No. 12/625,185, now U.S. Pat. No. 8,354,013; Ser. No. 12/625,208, now U.S. Pat. No. 9,042,954; Ser. No. 12/625,524, now U.S. Pat. No. 8,390,455; Ser. No. 12/625,525, now U.S. Pat. No. 8,358,210; Ser. No. 12/625,528, now U.S. Pat. No. 8,115,635; Ser. No. 12/628,177, now U.S. Patent Publ. No. 2010/0076289; Ser. No. 12/628,198, now U.S. Patent Publ. No. 2010/0076291; Ser. No. 12/628,201, now U.S. Patent Publ. No. 2010/0076280; Ser. No. 12/628,203, now U.S. Patent Publ. No. 2010/0076292; Ser. No. 12/628,210, now U.S. Patent Publ. No. 2010/0076293; Ser. No. 12/698,124, now U.S. Patent Publ. No. 2010/0198034; Ser. No. 12/698,129, now U.S. Patent Publ. No. 2010/03243925; Ser. No. 12/699,653, now U.S. Patent Publ. No. 2010/0198142; Ser. No. 12/699,844, now U.S. Pat. No. 8,930,203; Ser. No. 12/714,439, now U.S. Patent Publ. No. 2010/0230285; Ser. Nos. 12/730,193; 12/794,721, now U.S. Pat. No. 8,595,607; Ser. No. 12/807,278, now U.S. Patent Publ. No. 2011/0213225; Ser. No. 12/842,013, now U.S. Patent Publ. No. 2011/0021889; Ser. No. 12/870,818, now U.S. Patent Publ. No. 2011/0073475; Ser. No. 12/871,901, now U.S. Pat. No. 8,514,086; Ser. No. 12/873,301, now U.S. Patent Publ. No. 2011/0054275; Ser. No. 12/873,302, now U.S. Patent Publ. No. 2011/0060196; Ser. No. 13/011,897, now U.S. Patent Publ. No. 2011/0184265; and U.S. Provisional Application Nos. 61/238,646; 61/246,825; 61/247,516; 61/249,535; 61/317,243; 61/325,155; 61/345,562; and 61/359,265.\n\nBACKGROUND OF THE INVENTION\n\nThe detection and/or monitoring of glucose levels or other analytes, such as lactate, oxygen, A1C, or the like, in certain individuals is vitally important to their health. For example, the monitoring of glucose is particularly important to individuals with diabetes. Diabetics generally monitor glucose levels to determine if their glucose levels are being maintained within a clinically safe range, and may also use this information to determine if and/or when insulin is needed to reduce glucose levels in their bodies or when additional glucose is needed to raise the level of glucose in their bodies.\n\nGrowing clinical data demonstrates a strong correlation between the frequency of glucose monitoring and glycemic control. Despite such correlation, many individuals diagnosed with a diabetic condition do not monitor their glucose levels as frequently as they should due to a combination of factors including convenience, testing discretion, pain associated with glucose testing, and cost.\n\nDevices have been developed for the automatic monitoring of analyte(s), such as glucose, in bodily fluid such as in the blood stream or in interstitial fluid (“ISF”), or other biological fluid. Some of these analyte measuring devices are configured so that at least a portion of the devices are positioned below a skin surface of a user, e.g., in a blood vessel or in the subcutaneous tissue of a user, so that the monitoring is accomplished in vivo.\n\nWith the continued development of analyte monitoring devices and systems, there is a need for such analyte monitoring devices, systems, and methods, as well as for processes for manufacturing analyte monitoring devices and systems that are cost effective, convenient, and with reduced pain, provide discreet monitoring to encourage frequent analyte monitoring to improve glycemic control.\n\nSUMMARY\n\nAn apparatus for inserting a medical device at least partially through the skin of a subject is provided, which includes a first subassembly and a second subassembly. The first subassembly includes a sheath defining a distal surface for placement on the skin of the subject, a handle movable between a proximal position and distal position, a device support for supporting the medical device and defining an aperture therethrough, the device support coupled to the handle, a sharp support for supporting a sharp extending through said aperture and coupled to the device support, and a first driver for biasing the sharp support towards the proximal position. The second subassembly includes a housing configured for removable attachment to the first subassembly, and a second driver for advancing the sharp support towards the distal position.\n\nIn some embodiments, the first subassembly and the second subassembly are modular components. In some embodiments, the first subassembly is capable of independent operation without the second subassembly. In some embodiments, the driver of the first subassembly is capable of operation by a user without the second subassembly. In some embodiments, the driver of the first subassembly is actuable by depressing an actuation switch or button. In some embodiments, the second subassembly is configured to actuate the actuation switch or button of the first subassembly.\n\nIn some embodiments, the second driver includes a rotatable cam or a torsion spring. In some embodiments, the second driver includes either an axial driver and a crank assembly or a compression spring. In some embodiments, the first driver includes a compression spring, or a torsion spring.\n\nIn some embodiments, the handle is at least partially disposed surrounding the sheath. In some embodiments, a retention member for retaining the device support in the distal position is provided. The device support may be coupled to the handle until the device support reaches a distal position.\n\nIn some embodiments, the first subassembly is configured for a single use. In some embodiments, the second subassembly is configured for multiple uses.\n\nEmbodiments of analyte sensors are provided which include a body having a proximal section and a distal section. The distal section may be longitudinally aligned with the proximal section. An intermediate section may be included between the proximal and distal sections, and in some embodiments the intermediate section is laterally displaced from at least the distal member.\n\nIn some embodiments, the proximal end is received within a needle seat to create an anchor region to allow the sensor body to slide into an opening defined in the insertion sharp but prevent the sensor body from inadvertently slipping out of the insertion needle. In some embodiments, a width of the distal section of the sensor body is sized to fit within the opening of the insertion sharp. In certain embodiments, the opening in the sharp has a diameter of about 20 gauge to about 26 gauge, e.g., 21 gauge to about 25 gauge, where in certain embodiments the sharp is 21 gauge or 23 gauge or 25 gauge. Such sharp may be used with a sensor having a width or diameter—at least the portion that is carried by the sharp—of about 0.20 mm to about 0.80 mm, e.g., about 0.25 mm to about 0.60 mm, where in some embodiments the width or diameter of least a portion of a sensor is 0.27 mm or 0.33 mm or 0.58 mm.\n\nIn some embodiments, the intermediate member includes a plane-altering portion. The plane-altering portion allows the proximal section of the sensor body to be in a plane different than the distal section of the sensor body. In some embodiments, the proximal section and the distal section are in planes substantially perpendicular to each other, e.g., the area may define an angle of about 120° to about 60°, e.g., about 90°.\n\nIn certain embodiments, apparatuses for inserting a medical device at least partially through the skin of a subject are provided which include a sheath defining a distal surface for placement on the skin of the subject; a handle movable between a proximal position and distal position; a device support for supporting the medical device and defining an aperture therethrough, the device support coupled to the handle; a sharp support for supporting a sharp extending through said aperture and coupled to the device support; and driver for biasing the sharp support towards the proximal position.\n\nIn some embodiments, the driver includes a compression spring. In some embodiments, the handle is at least partially disposed surrounding the sheath. In some embodiments, a stop portion for retaining the device support in the distal position is included. In some embodiments, the device support is coupled to the handle until the device support reaches a distal position. In some embodiments, the device support is uncoupled from the sharp support when the device support reaches the distal position.\n\nIn some embodiments, a second assembly interfaces with the insertion devices or first subassembly. The second assembly automates the insertion segment motion of the described inserter. The second assembly may include a housing configured for removable attachment to the first subassembly, a handle configured for longitudinal movement with respect to the housing, an actuator configured for longitudinal movement with respect to the housing, a release member either located on the actuator or handle which is actuated upon the handle reaching a predetermined position, a driver element coupled between the handle and the actuator, energized upon distal movement of the handle, which drives the actuator distally once the release member is actuated, and a second driver which is also energized upon distal movement of the handle, that applies a proximal force on the handle that returns the handle to a proximal position after pressure is relieved from the handle post insertion. The second driver, coupled through the handle, also provides a proximal force to return the actuator to its proximal position where the release member is reengaged.\n\nIn some embodiments, the first driver includes a compression spring, or a torsion spring. In some embodiments, the handle is at least partially disposed surrounding the sheath. In some embodiments, a retention member for retaining the device support in the distal position is provided. The device support may be coupled to the handle until the device support reaches a distal position.\n\nIn some embodiments, the first subassembly is configured for a single use. In some embodiments, the first subassembly is configured for multiple uses. In some embodiments, the second subassembly is configured for multiple uses.\n\nThese and other features, objects, and advantages of the disclosed subject matter will become apparent to those persons skilled in the art upon reading the detailed description as more fully described below.\n\n"
        },
        {
            "uuid": "0026f832-9949-11eb-9615-121df0c29c1e",
            "patent_id": "10881715",
            "text": "CROSS REFERENCE TO RELATED APPLICATIONS\n\nThis application is a National Stage of International Application No. PCT/KR2015/014422 filed Dec. 30, 2015, claiming priority based on Korean Patent Application No. 10-2014-0193800 filed Dec. 30, 2014, the contents of all of which are incorporated herein by reference in their entirety.\n\nTECHNICAL FIELD\n\nThe present invention relates to novel glucagon derivatives having improved physical properties due to the change in isoelectric point (pI), and a composition for preventing or treating hypoglycemia and obesity containing the same as an active ingredient.\n\nBACKGROUND ART\n\nRecent economic advances and lifestyle changes have been accompanied by great changes in dietary habits. Particularly, busy people of today are overweight and obese due to high-calorie diets and insufficient exercise. The World Health Organization (WHO) has reported that more than one billion adults are overweight worldwide, among them over three million are clinically diagnosed with severe obesity, and 25,000 people die of overweight- or obesity-related diseases every year (World Health Organization, Global Strategy on Diet, Physical Activity and Health, 2004).\n\nOverweight and obesity are responsible for increasing blood pressure and cholesterol levels and causing or worsening various diseases, such as cardiac diseases, diabetes, arthritis, etc. In addition, the problem of obesity is also becoming a major cause in the increased incidence of atherosclerosis, hypertension, hyperlipidemia, or heart diseases in children or teenagers as well as in adults. However, obesity is not easy to treat, because it is a complex disease associated with the mechanisms of appetite control and energy metabolism. Accordingly, the treatment of obesity requires not only the patient's own efforts, but also a method capable of treating abnormal mechanisms associated with appetite control and energy metabolism. Thus, efforts have been made to develop drugs for treating the abnormal mechanisms.\n\nAs a result of these efforts, drugs such as Rimonabant (Sanofi-Aventis), Sibutramin (Abbott), Contrave (Takeda), and Orlistat (Roche) have been developed, but they have the disadvantages of serious adverse effects or very weak anti-obesity effects. For example, according to reports, Rimonabant showed a side-effect of central nervous system disorder, Sibutramine and Contrave showed cardiovascular side-effects, and Orlistat showed only about 4 kg of weight loss when taken for 1 year. Accordingly, there have been no therapeutic agents for obesity which can be prescribed safely for obese patients.\n\nMany extensive studies have been made to develop novel therapeutic agents for obesity which can resolve the problems of the conventional anti-obesity drugs. Recently, glucagon derivatives have received much attention. Glucagon is produced by the pancreas when blood glucose levels drop as a result of other medications or diseases, or hormone or enzyme deficiencies. Glucagon stimulates glycogen breakdown in the liver, and facilitates glucose release to raise blood glucose levels to a normal range. In addition to the effect of increasing the blood glucose levels, glucagon suppresses appetite and activates hormone-sensitive lipase of adipocytes to facilitate lipolysis, thereby showing an anti-obesity effect. However, the use of glucagon as a therapeutic agent has been limited due to its low solubility and its property of being precipitated at a neutral pH.\n\nOne of the glucagon derivatives, glucagon like peptide-1 (GLP-1), is under development as a therapeutic agent for treating hyperglycemia in patients with diabetes. GLP-1 has the functions of stimulating insulin synthesis and secretion, inhibiting glucagon secretion, slowing gastric emptying, increasing glucose utilization, and inhibiting food intake.\n\nExendin-4, prepared from lizard venom and having an amino acid homology of about 50% with GLP-1, was also reported to activate the GLP-1 receptor, thereby reducing hyperglycemia in patients with diabetes. However, anti-obesity drugs containing GLP-1 are reported to show side-effects such as vomiting and nausea.\n\nAs an alternative to GLP-1, therefore, much attention has been focused on oxyntomodulin, which can bind to both receptors of the two peptides. GLP-1 and glucagon. Oxyntomodulin is a peptide prepared from a glucagon precursor, pre-glucagon, and has the functions of inhibiting food intake and enhancing satiety of GLP-1, and has lipolytic activity like glucagon, thus increasing its potency in anti-obesity therapy.\n\nHowever, oxyntomodulin or derivatives thereof have a serious drawback in that an excess amount of the drug should be administered daily for obesity treatment because they have low efficacy and a short in vivo half-life.\n\nAdditionally, when both activities of GLP-1 and glucagon are present in a single peptide, the activity ratio thereof becomes fixed, and thus it is difficult to use a dual agonist with various ratios. Accordingly, a combined therapy capable of using various activity ratios by adjusting the contents of GLP-1 and glucagon may be more effective.\n\nHowever, for the combined therapy, it is required to improve the physical characteristics of glucagon, which aggregates at a neutral pH and precipitates with time, thus showing poor solubility.\n\nUnder these circumstances, the present inventors have developed glucagon derivatives with partial modifications of the amino acid sequence of glucagon for the improvement of the therapeutic effects of glucagon on hypoglycemia and obesity by improving the physical properties of glucagon, and have discovered that these glucagon derivatives have improved solubility and higher stability at a neutral pH, thereby completing the present invention.\n\nDISCLOSURE\n\nTechnical Problem\n\nAn object of the present invention is to provide a novel glucagon derivative with improved physical properties.\n\nAnother object of the present invention is to provide a composition for preventing or treating hypoglycemia containing the glucagon derivative as an active ingredient.\n\nA further object of the present invention is to provide a composition for preventing or treating obesity containing the glucagon derivative as an active ingredient.\n\nTechnical Solution\n\nIn order to achieve the above objects, in an aspect, the present invention provides a novel glucagon derivative which includes the amino acid sequence of the following General Formula 1 and has an isoelectric point (pI), which is not the same as, i.e., different from, that of native glucagon:\n\n(General Formula 1)X1-X2-QGTF-X7-SDYS-X12-X13-X14-X15-X16-X17-X18-X19-X20-X21-F-X23-X24-W-L-X27-X28-T\n\nwherein, in General Formula 1,\n\nX1 is histidine, desamino-histidine, N-dimethyl-histidine, β-hydroxyimidazopropionic acid, 4-imidazoacetic acid, β-carboxyimidazopropionic acid, tryptophan, tyrosine, or deleted;\n\nX2 is α-methyl-glutamic acid, aininoisobutyric acid (Aib), D-alanine, glycine, Sar(N-methylglycine), serine, or D-serine;\n\nX7 is threonine or valine;\n\nX12 is lysine or cysteine;\n\nX13 is tyrosine or cysteine;\n\nX14 is leucine or cysteine;\n\nX15 is aspartic acid, glutamic acid, or cysteine;\n\nX16 is glutamic acid, aspartic acid, serine, α-methyl-glutamic acid, or cysteine;\n\nX17 is aspartic acid, glutamine, glutamic acid, lysine, arginine, serine, valine, or cysteine;\n\nX18 is aspartic acid, glutamine, glutamic acid, arginine, or cysteine;\n\nX19 is alanine or cysteine;\n\nX20 is lysine, glutamic acid, glutamine, aspartic acid, lysine, or cysteine;\n\nX21 is aspartic acid, glutamic acid, valine, or cysteine;\n\nX23 is valine or arginine;\n\nX24 is valine, leucine, glutamine, or arginine;\n\nX27 is isoleucine or methionine; and\n\nX28 is arginine or asparagine\n\n(with the proviso that when the amino acid sequence of General Formula 1 is identical to SEQ ID NO: 1, it is excluded).\n\nThe glucagon derivative according to the present invention includes a peptide, a peptide derivative, or a peptide mimetic, which has improved physical properties by having a different pI from that of native glucagon by modifying a part of the amino acid(s) of native glucagon.\n\nAs used herein, the term “native glucagon” refers to native human glucagon having the sequence of\n\n(SEQ ID NO: 1)His-Ser-Gln-Gly-Thr-Phe-Thr-Ser-Asp-Tyr-Ser-Lys-Tyr-Leu-Asp-Ser-Arg-Arg-Ala-Gln-Asp-Phe-Val-Gln-Trp-Leu-Met-Asn-Thr.\n\nReferring to the sequence of General Formula I according to the present invention, the amino acids proceed from the N-terminus on the left to the C-terminus on the right according to the conventional method of description. Accordingly, when the “position” of any particular residue is referred to in the sequence of General Formula 1, it should be interpreted in the same manner as when any position in native glucagon or other molecules is referred to.\n\nOver the entire specification of the present invention, not only the conventional one-letter or three-letter codes for naturally occurring amino acids, but also those three-letter codes generally allowed for other amino acids, such as α-aminoisobutyric acid (Aib), Sar(N-methylglycine), and α-methyl-glutamic acid, are used.\n\nAdditionally, the amino acids mentioned herein are abbreviated according to the nomenclature rules of IUPAC-IUB as follows:\n\nAlanineA;ArginineR;AsparagineN;Aspartic acidD;CysteineC;Glutamic acidE;GlutamineQ;GlycineG;HistidineH;IsoleucineI;LeucineL;LysineK;MethionineM;PhenylalanineF;ProlineP;SerineS;ThreonineT;TryptophanW;TyrosineY; andValineV.\n\nAs used herein, the term “peptide” refers to a compound of two or more native and non-native amino acids or amino acid derivatives such as α-amino acids linked by a peptide bond. As used herein, the term “glucagon derivative” refers to a peptide including the sequence of General Formula 1 or a derivative thereof, an analog, or a modified product thereof. The peptide according to the present invention includes peptidomimetics, which have a change in pI compared to that of native glucagon by modifying a part of the amino acid(s) of glucagon in the form of a substitution, etc. In an exemplary embodiment of the present invention, the glucagon derivative has an isoelectric point different from that of native glucagon while maintaining the activity of a glucagon receptor. In a more specific exemplary embodiment of the present invention, the glucagon derivative refers to a peptide with improved solubility of native glucagon at a physiological pH while maintaining the glucagon receptor activity.\n\nAs used herein, the term “pI” or “isoelectric point” refers to the pH value at which a macromolecule such as a polypeptide has no net charge (0). In the case of a polypeptide with various charged functional groups, the net charge of the total polypeptide is “0” at a point where the pH value is the same as that of pI. The net charge of the polypeptide at a pH higher than the pI will be negative while the net charge of the polypeptide at a pH lower than the pI will be positive.\n\nThe pI values may be measured or estimated by a conventional method used in the art. For example, the pI values may be measured on an immobilized pH gradient gel consisting of polyacrylamide, starch, or agarose by isoelectric electrophoresis, or, for example, may be estimated from an amino acid sequence using a pI/MW tool (expasy.org/tools/pi_tool.html; Gasteiger et al., 2003) in an ExPASy server.\n\nIn a specific embodiment of the present invention, the glucagon derivative containing an amino acid sequence of General Formula I encompasses any peptide that is prepared by the substitution, addition, deletion, or post-translational modification (e.g., methylation, acylation, ubiquitination, or intramolecular covalent bonding) of amino acid(s) in the amino acid sequence of native glucagon represented by SEQ ID NO: 1, which exhibits improved solubility according to the pH of a solution due to the difference of its pI from that of native glucagon while maintaining the glucagon receptor activities as they are, thereby having improved in vivo chemical stability.\n\nDuring the substitution or addition of amino acids, not only the 20 amino acids commonly found in human proteins, but also atypical or non-naturally occurring amino acids and derivatives thereof can be used. Commercial sources of atypical amino acids may include Sigma-Aldrich, ChemPep Inc., Genzyme Pharmaceuticals, etc. The peptides including these amino acids and atypical peptide sequences may be synthesized and purchased from commercial suppliers, e.g., American Peptide Company, Bachem (USA), or Anygen (Korea). Amino acid derivatives, e.g., desamino-histidine, β-hydroxyimidazopropionic acid, 4-imidazoacetic acid, or β-carboxyimidazopropionic acid, may be obtained in the same manner.\n\nSince glucagon has a pH of about 7, it is insoluble in a solution having a pH of 6 to 8 and tends to precipitate at a neutral pH. In an aqueous solution with a pH of 3 or below, glucagon is dissolved at the initial stage but precipitates within one hour by forming a gel. Since the gelated glucagon mainly consists of β-sheet fibrils, the administration of the thus-precipitated glucagon via an injection needle or intravenous injection will block blood vessels, and thus is not suitable for use as an injection agent. In order to delay the precipitation process, acidic (pH of 2 to 4) formulations are commonly used, and by doing so, glucagon can be maintained in a relatively non-aggregated state for a short period of time. However, glucagon can form fibrils very rapidly at a low pH, and thus these acidic formulations must be injected upon preparation.\n\nIt is widely known in the art that the solubility, activity, and stability of a protein in a solution can vary according to pI (Shaw, K. L. et al., Protein Science 10, pp 1206-1215, 2001).\n\nAs such, the present inventors have developed glucagon derivatives with extended stability and functional effects by modifying the sequence of native glucagon, thereby altering its pI. The glucagon derivatives of the present invention, by having an altered pI compared to that of native glucagon, are characterized in that they have improved solubility and stability according to the pH of a given solution, compared to that of native glucagon.\n\nIn a specific embodiment of the present invention, the glucagon derivative may be a peptide in which, in the amino acid sequence of General Formula I,\n\nX1 is histidine or tryptophan, tyrosine, or deleted;\n\nX2 is serine or aminoisobutyric acid (Aib);\n\nX7 is threonine or valine;\n\nX12 is lysine or cysteine;\n\nX13 is tyrosine or cysteine;\n\nX14 is leucine or cysteine;\n\nX15 is aspartic acid or cysteine;\n\nX16 is glutamic acid, aspartic acid, serine, or cysteine;\n\nX17 is aspartic acid, glutamic acid, lysine, arginine, valine, or cysteine;\n\nX18 is aspartic acid, glutamic acid, arginine, or cysteine;\n\nX19 is alanine or cysteine;\n\nX20 is lysine, glutamic acid, glutamine, aspartic acid, lysine, or cysteine;\n\nX21 is aspartic acid, glutamic acid, valine, or cysteine;\n\nX23 is valine or arginine;\n\nX24 is valine, leucine, or glutamine;\n\nX27 is isoleucine or methionine; and\n\nX28 is arginine or asparagine\n\n(with the proviso that when the amino acid sequence of General Formula 1 is identical to SEQ ID NO: 1, it is excluded).\n\nMore preferably, the glucagon derivative of the present invention may be a peptide including any one amino acid sequence among the amino acid sequences represented by SEQ ID NOS: 2 to 34.\n\nThe peptide including the glucagon derivative of the present invention may be prepared by a standard synthesis method, a recombinant expression system, or any other method in the art. Accordingly, the glucagon analog according to the present invention may be synthesized by many methods including the methods described below:\n\n(a) a method of synthesizing a peptide by a solid-phase or liquid-phase method stepwise or by fragment assembly, followed by isolation and purification of the final peptide product; or\n\n(b) a method of expressing a nucleic acid construct encoding a peptide in a host cell and recovering the expression product from the host cell culture; or\n\n(c) a method of performing an in vitro cell-free expression of a nucleic acid construct encoding a peptide and recovering the expression product therefrom; or\n\n(d) a method of obtaining peptide fragments by any combination of the methods (a), (b), and (c), obtaining the peptide by linking the peptide fragments, and then recovering the peptide.\n\nIn an exemplary aspect of the present invention, it was confirmed that the glucagon derivative of the present invention has a different pI compared to that of native glucagon (see Table 1). As a result, the glucagon derivative of the present invention has improved solubility and higher stability according to the pH of a given solution, compared to that of native glucagon. Accordingly, the glucagon derivative of the present invention can increase patient compliance when used as a hypoglycemic agent and is also suitable for the combined administration to be administered in combination with other anti-obesity agents, and thus can be effectively used for the prevention and treatment of hypoglycemia and obesity.\n\nIn this regard, the glucagon derivative of the present invention can provide an attractive therapeutic selection regarding hypoglycemia, obesity, or associated diseases thereof.\n\nFor example, the glucagon derivative of the present invention is a major insulin response-controlling hormone, and can be effectively used for the treatment of severe hypoglycemia in diabetic patients.\n\nAdditionally, the glucagon derivative of the present invention may be used as a pharmaceutical drug not only for preventing body weight increase, promotion of body weight decrease, reduction of overweight, and obesities including morbid obesity(e.g., by controlling appetite, ingestion, food intake, calorie intake, and/or energy consumption), but also for treating obesity-related inflammation, obesity-related gallbladder disease, and obesity-induced sleep apnea, but is not limited thereto, and may be used for treating the associated diseases or health conditions thereof. The glucagon derivative of the present invention may also be used for treating the health conditions that may be associated with obesity, such as metabolic syndrome, hypertension, atherosclerosis-induced dyslipidemia, arteriosclerosis, arterial chlerosis, coronary heart disease, strokes, etc. However, the effects of the glucagon derivative according to the present invention may be mediated entirely or partially by the body weight-related effects described above or may be independent of the same.\n\nMeanwhile, for the improvement of the therapeutic effects of the glucagon derivative of the present invention, the glucagon derivative may be modified using the typical techniques in the art, including a modification with polymers such as polyethylene glycol (PEG) and sugar chains, or a fusion with albumin, transferrin, fatty acid, and immunoglobulin, etc. For example, at least one amino acid side chain within the compounds of the present invention may be attached to a polymer in order to increase in vivo solubility and/or half-lives, and/or increase bioavailabilities thereof. These modifications are known to reduce the clearance of therapeutic proteins and peptides.\n\nFor these polymers, soluble (amphipathic or hydrophilic), non-toxic, and pharmaceutically inert polymers are appropriate, and preferably, they may include PEG, homopolymers or copolymers of PEG, monomethyl-substituted polymers (mPEG), and poly-amino acids such as poly-lysine, poly-aspartic acid, and poly-glutamic acid.\n\nThe variants of the glucagon derivative as described above also belong to the scope of the present invention.\n\nIn another aspect, the present invention provides polynucleotides encoding the glucagon derivatives described above.\n\nThe term “homology”, as used herein for the polynucleotide, indicates the degree of similarity to a wild-type amino acid sequence and a wild-type nucleic acid sequence, and includes a gene sequence that is 75% or higher, preferably 85% or higher, more preferably 90% or higher, and even more preferably 95% or higher identical to the polynucleotide sequence encoding the glucagon derivatives. The homology evaluation may be done with the naked eye or using a commercially available program. Using a commercially available computer program, the homology between two or more sequences may be expressed as a percentage (%), and the homology (%) between adjacent sequences may be evaluated. The polynucleotide encoding the glucagon derivatives may be inserted into a vector and expressed to obtain a large amount of the glucagon derivatives.\n\nFor these recombinant expressions, the polynucleotides of the present invention are generally inserted into appropriate vectors to construct cloning vectors or recombinant vectors containing these polynucleotides, and these vectors also belong to the scope of the present invention.\n\nAs used herein, the term “recombinant vector” refers to a DNA construct including the sequence of a polynucleotide encoding a target peptide, which is operably linked to an appropriate regulatory sequence to enable the expression of the target peptide, e.g., a glucagon derivative, in a host cell. The regulatory sequence includes a promoter capable of initiating transcription, any operator sequence for the regulation of the transcription, a sequence encoding an appropriate mRNA ribosome-binding domain, and a sequence regulating the termination of transcription and translation. The recombinant vector, after being transformed into a suitable host cell, may be replicated or function irrespective of the host genome, or may be integrated into the host genome itself.\n\nThe recombinant vector used in the present invention may not be particularly limited as long as the vector is replicable in the host cell, and it may be constructed using any vector known in the art. Examples of the vector may include natural or recombinant plasmids, cosmids, viruses, and bacteriophages. For example, as a phage vector or cosmid vector, pWE15, M13, MBL3, MBL4, IXII, ASHII, t10, t11, Charon4A, Charon21A, etc., may be used; and as a plasmid vector, those based on pBR, pUC, pBluescriptII, pGEM, pTZ, pCL, pET, etc., may be used. The vectors that can be used in the present invention are not particularly limited but any known expression vector may be used.\n\nThe recombinant vector is used for the transformation of a host cell for producing glucagon derivatives of the present invention. Additionally, these transformed cells, as a part of the present invention, may be used for the amplification of nucleic acid fragments and vectors, or may be cultured cells or cell lines used in the recombinant production of glucagon derivatives of the present invention.\n\nAs used herein, the term “transformation” refers to a process of introducing a recombinant vector including a polynucleotide encoding a target protein into a host cell, thereby enabling the expression of the polynucleotide encoded by the protein in the host cell. For the transformed polynucleotide, it does not matter whether it is inserted into the chromosome of a host cell and located therein or located outside the chromosome, as long as it can be expressed in the host cell, and both cases are included.\n\nAdditionally, the polynucleotide includes DNA and RNA which encode the target protein. The polynucleotide may be inserted in any form insofar as it can be introduced into a host cell and expressed therein. For example, the polynucleotide may be introduced into a host cell in the form of an expression cassette. The expression cassette may conventionally include a promoter operably linked to the polynucleotide, a transcription termination signal, a ribosome-binding domain, and a translation termination signal. The expression cassette may be in the form of an expression vector capable of self-replication. Additionally, the polynucleotide may be introduced into a host cell as it is and operably linked to a sequence essential for its expression in the host cell, but is not limited thereto. Additionally, as used herein, the term “operably linked” refers to a functional connection between a promoter sequence, which initiates and mediates the transcription of the polynucleotide encoding the target protein of the present invention, and the above gene sequence,\n\nAn appropriate host to be used in the present invention may not be particularly limited as long as it can express the polynucleotide of the present invention. Examples of the appropriate host may include bacteria belonging to the genusEscherichiasuch asE. coli, bacteria belonging to the genusBacillussuch asBacillus subtilis, bacteria belonging to the genusPseudomonassuch asPseudomonas putida, yeasts such asPichia pastoris, Saccharomyces cerevisiae, andSchizosaccharomyces pompe, insect cells such asSpodoptero frugipercia(Sf9), and animal cells such as CHO, COS, and BSC.\n\nIn another aspect, the present invention provides a pharmaceutical composition for preventing or treating hypoglycemia or obesity containing the glucagon derivatives.\n\nAs used herein, the term “prevention” refers to any action resulting in suppression or delay of the onset of obesity by the administration of the glucagon derivatives or the pharmaceutical composition, and the term “treatment” refers to any action resulting in improvement in symptoms of obesity or the beneficial alteration by the administration of the glucagon derivatives or the pharmaceutical composition.\n\nAs used herein, the term “administration” refers to introduction of a particular material to a patient by an appropriate manner, and the composition may be administered via any of the common routes as long as the composition can arrive at a target tissue. For example, administration may be performed intraperitoneally, intravenously, intramuscularly, subcutaneously, intradermally, orally, topically, intranasally, intrapulmonarily, intrarectally, etc.\n\nAs used herein, the term “hypoglycemia” refers to an acute symptom of diabetes, in which blood glucose levels are lower than those of normal people, and in general, refers to a state when the blood glucose levels are 50 mg/dL or less. Hypoglycemia is frequently caused when a person who takes an oral hypoglycemic agent has eaten less than usual or has performed activities or exercised more than usual. In addition, hypoglycemia may occur due to the use of glucose level-lowering drugs, severe physical diseases, hormone deficiency such as adrenocortical hormones and glucagon, tumor in insulin-producing pancreas, insulin autoimmune syndrome, gastrectomy patients, inborn error of carbohydrate metabolism disorder, etc.\n\nSymptoms of hypoglycemia include weakness, trembling, pale skin, cold sweat, dizziness, excitement, anxiety, pounding heart, empty stomach, headache, fatigue, etc. In the case of persistent hypoglycemia, it may lead to convulsion or seizure, and may cause shock and thus fainting.\n\nAs used herein, the term “obesity” refers to a medical condition with excess body fat in the body, and when a person having a body mass index (BMI; body mass (kg) divided by the square of the body height (m)) of 25 or higher is diagnosed as having obesity. Obesity generally occurs due to a long-term energy imbalance in which energy intake exceeds energy expenditure. Obesity is a metabolic disease that affects the entire body, which increases the risk of diabetes, hyperlipidemia, sexual dysfunction, arthritis, and cardiovascular disease, and in some cases, it is also associated with the occurrence of cancers.\n\nThe pharmaceutical composition of the present invention may contain a pharmaceutically acceptable carrier, excipient, or diluent. As used herein, the term “pharmaceutically acceptable” refers to the properties of having a sufficient amount to exhibit a therapeutic effect and not causing adverse effects, and may be easily determined by a skilled person in the art based on the factors well known in the medical field, such as the kind of disease, age, body weight, health status, sex, drug sensitivity of a patient, administration route, administration method, administration frequency, duration of treatment, a drug to be mixed or administered simultaneously in combination, etc.\n\nThe pharmaceutical composition of the present invention containing the glucagon derivative of the present invention may further contain a pharmaceutically acceptable carrier. The pharmaceutically acceptable carrier may include, for oral administration, a binder, a glidant, a disintegrant, an excipient, a solubilizing agent, a dispersant, a stabilizing agent, a suspending agent, a coloring agent, a flavoring agent, etc.; for injections, a buffering agent, a preserving agent, an analgesic, a solubilizing agent, an isotonic agent, a stabilizing agent, etc., which may be combined to be used; and for topical administrations, a base, an excipient, a lubricant, a preserving agent, etc., although it is not limited thereto.\n\nThe formulation type of the composition according to the present invention may be prepared variously by combining with a pharmaceutically acceptable carrier as described above. For example, for oral administration, the composition may be formulated into tablets, troches, capsules, elixirs, suspensions, syrups, wafers, etc. For injections, the composition may be formulated into single-dose ampoules or multidose containers. The composition may be also formulated into solutions, suspensions, tablets, capsules, and sustained-release formulations.\n\nMeanwhile, examples of suitable carriers, excipients, and diluents may include lactose, dextrose, sucrose, sorbitol, mannitol, xylitol, erythritol, maltitol, starch, acacia rubber, alginate, gelatin, calcium phosphate, calcium silicate, cellulose, methyl cellulose, microcrystalline cellulose, polyvinylpyrrolidone, water, methyl hydroxybenzoate, propyl hydroxybenzoate, talc, magnesium stearate, mineral oil, etc. Additionally, the composition may further contain a filler, an anti-coagulant, a lubricant, a humectant, a flavoring agent, a preservative, etc.\n\nAdditionally, the pharmaceutical composition of the present invention may be prepared in any formulation type selected from the group consisting of tablets, pills, powders, granules, capsules, suspensions, liquid medicine for internal use, emulsions, syrups, sterile injection solutions, non-aqueous solvents, lyophilized formulations, and suppositories.\n\nAdditionally, the composition may be formulated into a single dosage form suitable for the patient's body, and preferably is formulated into a preparation useful for peptide drugs according to the typical method in the pharmaceutical field so as to be administered by an oral or parenteral route, such as through skin, intravenously, intramuscularly, intra-arterially, intramedullarily, intrathecally, intraventricularly, pulmonarily, transdermally, subcutaneously, intraperitoneally, intranasally, intragastrically, topically, sublingually, vaginally, or rectally, but is not limited thereto.\n\nAdditionally, the glucagon derivative may be used by blending with a variety of pharmaceutically acceptable carriers such as physiological saline or organic solvents. In order to increase the stability or absorptivity, carbohydrates such as glucose, sucrose, or dextrans, antioxidants such as ascorbic acid or glutathione, chelating agents, low molecular weight proteins, or other stabilizers may be used.\n\nThe administration dose and frequency of the pharmaceutical composition of the present invention are determined by the type of active ingredient(s), together with various factors such as the disease to be treated, administration route, patient's age, gender, and body weight, and severity of the disease.\n\nThe total effective dose of the composition of the present invention may be administered to a patient in a single dose, or may be administered for a long period of time in multiple doses according to a fractionated treatment protocol. In the pharmaceutical composition of the present invention, the content of active ingredient(s) may vary depending on the disease severity. Preferably, the total daily dose of the peptide of the present invention may be approximately 0.0001 μg to 500 mg per 1 kg of body weight of a patient. However, the effective dose of the glucagon derivative is determined considering various factors including patient's age, body weight, health conditions, gender, disease severity, diet, and excretion rate, in addition to administration route and treatment frequency of the pharmaceutical composition. In this regard, those skilled in the art may easily determine the effective dose suitable for the particular use of the pharmaceutical composition of the present invention. The pharmaceutical composition according to the present invention is not particularly limited to the formulation and administration route and mode, as long as it shows the effects of the present invention.\n\nThe pharmaceutical composition of the present invention shows excellent in viva duration of efficacy and titer, thereby remarkably reducing the number and frequency of administration thereof.\n\nIn particular, since the pharmaceutical composition of the present invention contains, as an active ingredient, a glucagon derivative having an altered pI different from that of native glucagon, it shows improved solubility and high stability according to the pH of a given solution, and thus the pharmaceutical composition of the present invention can be effectively used in the preparation of a stable glucagon formulation for treating hypoglycemia or obesity.\n\nFurthermore, the pharmaceutical composition of the present invention may be administered alone or in combination with other pharmaceutical formulation(s) showing prophylactic or therapeutic effects on obesity. Additionally, the pharmaceutical composition of the present invention may further contain a pharmaceutical formulation showing prophylactic or therapeutic effects on obesity.\n\nThe pharmaceutical formulations showing prophylactic or therapeutic effects on obesity are not particularly limited, and may include a GLP-1 receptor agonist, a glucose-dependent insulinotropic peptide (GIP) receptor antagonist, a leptin receptor agonist, a DPP-IV inhibitor, a Y5 receptor antagonist, a melanin-concentrating hormone (MCH) receptor antagonist, a Y2/3/4 receptor agonist, an MC3/4 receptor agonist, a gastric/pancreatic lipase inhibitor, a 5HT2c agonist, a β3A receptor agonist, an amylin receptor agonist, a ghrelin antagonist and a ghrelin receptor antagonist, FGF1, an FGF21 receptor agonist, a cholecystokinin (CCK) receptor agonist, a pancreatic polypeptide (PP) receptor agonist, a dopamine reabsorption inhibitor, etc.\n\nIn still another aspect, the present invention provides a method for preventing or treating hypoglycemia or obesity, including administration of the glucagon derivative or the pharmaceutical composition containing the same to a subject.\n\nAs used herein, the term “subject” refers to those suspected of having hypoglycemia or obesity, which are mammals including humans, mice, and livestock animals having hypoglycemia or obesity, or with the possibility of having hypoglycemia or obesity. However, any subject to be treated with the glucagon derivatives or the pharmaceutical composition of the present invention is included without limitation. The pharmaceutical composition containing the glucagon derivative of the present invention may be administered to a subject suspected of having hypoglycemia or obesity, thereby treating the subject effectively. The hypoglycemia and obesity are the same as described above.\n\nThe therapeutic method of the present invention may include administration of the pharmaceutical composition containing the glucagon derivative at a pharmaceutically effective amount. Preferably, the total daily dose should be determined based on appropriate medical judgment by a physician and administered once or several times. In view of the objects of the present invention, the specific therapeutically effective dose for any particular patient may vary depending on various factors, such as the kind and degree of the response to be achieved, specific compositions including whether other agent(s) is (are) used therewith or not, the patient's age, body weight, health condition, gender, and diet, the time and route of administration, the secretion rate of the composition, duration of therapy, other drug(s) used in combination or simultaneously with the specific compositions, and similar factors well known in the medical art.\n\nIn still another aspect, the present invention provides a use of the glucagon derivatives in the preparation of pharmaceutical drugs for the prevention or treatment of hypoglycemia or obesity.\n\nAdvantageous Effects\n\nThe novel glucagon derivatives of the present invention have excellent stability and solubility according to the pH of a given solution by having a pI different from that of native glucagon. Therefore, when the novel glucagon derivatives of the present invention are used as a therapeutic agent for treating hypoglycemia, they can increase patient compliance. Additionally, the novel glucagon derivatives of the present invention are suitable for administration in combination with other anti-obesity agents, and thus they can be effectively used for preventing or treating hypoglycemia and obesity.\n\n"
        },
        {
            "uuid": "0028751f-9949-11eb-9615-121df0c29c1e",
            "patent_id": "10881858",
            "text": "FIELD OF THE APPLICATION\n\nThe present invention relates generally to treatment and prevention of Alzheimer's disease and/or cerebral amyloid angiopathy (CAA), and specifically to electrical techniques for treating, preventing, or slowing the progression of Alzheimer's disease and/or CAA.\n\nBACKGROUND OF THE APPLICATION\n\nAlzheimer's disease is a chronic neurodegenerative disease that causes dementia. Accumulation of substances such as amyloid beta and/or tau protein in the brain is widely believed to contribute to the development of Alzheimer's disease.\n\nUS Patent Application Publication 2014/0324128 to Gross, which is assigned to the assignee of the present application and is incorporated herein by reference, describes apparatus for driving fluid between first and second anatomical sites of a subject. The apparatus comprises (1) a first electrode, configured to be coupled to the first anatomical site of the subject; (2) a second electrode, configured to be coupled to the second anatomical site of the subject; and (3) a control unit, configured to (i) detect a pressure difference between the first and second anatomical sites, and (ii) in response to the detected pressure difference, drive fluid between the first and second anatomical sites by applying a treatment voltage between the first and second electrodes. Other embodiments are also described.\n\nPCT Publication WO 2017/072769 to Fostick et al., which is assigned to the assignee of the present application and is incorporated herein by reference, describes a system that includes a parenchymal electrode, configured to be implanted in brain parenchyma of a subject identified as at risk of or suffering from a disease; and a cerebrospinal fluid (CSF) electrode, configured to be implanted in a CSF-filled space of a brain of the subject, the CSF-filled space selected from the group consisting of: a ventricular system and a subarachnoid space. Control circuitry is configured to drive the parenchymal electrode and the CSF electrode to clear a substance from the brain parenchyma (50) into the CSF-filled space of the brain. Other embodiments are also described.\n\nSUMMARY OF THE APPLICATION\n\nSome embodiments of the present invention provide techniques for treating Alzheimer's disease and/or cerebral amyloid angiopathy (CAA). In some applications of the present invention, an extracranial electrode is placed (e.g., implanted) outside and in electrical contact with the skull, and a cerebrospinal fluid (CSF) electrode is implanted in a ventricular system of the brain. Control circuitry is activated to drive the extracranial and the CSF electrodes to clear a substance, such as amyloid beta and/or tau protein, from brain parenchyma either into the ventricular system of the brain or into the subarachnoid space and/or dural sinuses of the brain.\n\nThere is therefore provided, in accordance with an Inventive Concept 1 of the present invention, apparatus including:\n\nan extracranial electrode, configured to be placed outside and in electrical contact with a skull of a subject identified as at risk of or suffering from a disease;\n\na cerebrospinal fluid (CSF) electrode, configured to be implanted in a ventricular system of a brain of the subject; and\n\ncontrol circuitry, configured to drive the extracranial and the CSF electrodes to clear a substance from brain parenchyma of the subject into the ventricular system of the brain.\n\nInventive Concept 2. The apparatus according to Inventive Concept 1, wherein the extracranial electrode is configured to be implanted under skin of a head of the subject.\n\nInventive Concept 3. The apparatus according to Inventive Concept 1, wherein the extracranial electrode is configured to be placed on skin of a head of the subject.\n\nInventive Concept 4. The apparatus according to Inventive Concept 1, wherein the control circuitry is configured to be implanted under skin of the subject.\n\nInventive Concept 5. The apparatus according to Inventive Concept 1, wherein the disease is Alzheimer's disease, and wherein the extracranial electrode is configured to placed outside and in electrical contact with the skull of the subject identified as at risk of or suffering from Alzheimer's disease.\n\nInventive Concept 6. The apparatus according to Inventive Concept 1, wherein the disease is cerebral amyloid angiopathy (CAA), and wherein the extracranial electrode is configured to placed outside and in electrical contact with the skull of the subject identified as at risk of or suffering from CAA.\n\nInventive Concept 7. The apparatus according to Inventive Concept 1, wherein the substance includes amyloid beta, and wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the amyloid beta from the brain parenchyma into the ventricular system of the brain.\n\nInventive Concept 8. The apparatus according to Inventive Concept 1, wherein the substance includes tau protein, and wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the tau protein from the brain parenchyma into the ventricular system of the brain.\n\nInventive Concept 9. The apparatus according to Inventive Concept 1,\n\nwherein the apparatus includes a plurality of extracranial electrodes, and\n\nwherein the control circuitry is configured to drive a first average charge between (a) one or more extracranial electrodes of a first subset of the extracranial electrodes and (b) the CSF electrode over a 24-hour period of time, and a second average charge between (a) one or more extracranial electrodes of a second subset of the extracranial electrodes and (b) the CSF electrode over the 24-hour period of time, the first average charge greater than the second average charge.\n\nInventive Concept 10. The apparatus according to Inventive Concept 1, wherein the control circuitry is configured to configure the extracranial electrode to be an anode, and the CSF electrode to be a cathode.\n\nInventive Concept 11. The apparatus according to Inventive Concept 1, wherein the control circuitry is configured to configure the extracranial electrode to be a cathode, and the CSF electrode to be an anode.\n\nInventive Concept 12. The apparatus according to Inventive Concept 1, wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the substance by applying a non-excitatory current between the extracranial and the CSF electrodes.\n\nInventive Concept 13. The apparatus according to Inventive Concept 1, wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the substance by applying direct current between the extracranial and the CSF electrodes.\n\nInventive Concept 14. The apparatus according to Inventive Concept 13, wherein the control circuitry is configured to apply the direct current with an average amplitude of between 1 and 5 mA.\n\nInventive Concept 15. The apparatus according to Inventive Concept 13, wherein the control circuitry is configured to apply the direct current with an average amplitude of less than 1.2 V.\n\nInventive Concept 16. The apparatus according to Inventive Concept 13, wherein the control circuitry is configured to apply the direct current as a series of pulses.\n\nInventive Concept 17. The apparatus according to Inventive Concept 16, wherein the control circuitry is configured to apply the direct current as the series of pulses having an average pulse duration of between 100 milliseconds and 300 seconds.\n\nInventive Concept 18. The apparatus according to Inventive Concept 16, wherein the control circuitry is configured to apply the direct current as the series of pulses with a duty cycle of between 1 and 50%.\n\nThere is further provided, in accordance with an Inventive Concept 19 of the present invention, a method including:\n\nplacing an extracranial electrode outside and in electrical contact with a skull of a subject identified as at risk of or suffering from a disease;\n\nimplanting a cerebrospinal fluid (CSF) electrode in a ventricular system of a brain of the subject; and\n\nactivating control circuitry to drive the extracranial and the CSF electrodes to clear a substance from brain parenchyma into the ventricular system of the brain.\n\nInventive Concept 20. The method according to Inventive Concept 19, wherein placing the extracranial electrode includes implanting the extracranial electrode under skin of a head of the subject.\n\nInventive Concept 21. The method according to Inventive Concept 19, wherein placing the extracranial electrode includes placing the extracranial electrode on skin of a head of the subject.\n\nInventive Concept 22. The method according to Inventive Concept 19, further including implanting the control circuitry under skin of the subject.\n\nInventive Concept 23. The method according to Inventive Concept 19, wherein the disease is Alzheimer's disease, and wherein placing the extracranial electrode includes placing the extracranial electrode outside and in electrical contact with the skull of the subject identified as at risk of or suffering from Alzheimer's disease.\n\nInventive Concept 24. The method according to Inventive Concept 19, wherein the disease is cerebral amyloid angiopathy (CAA), and wherein placing the extracranial electrode includes placing the extracranial electrode outside and in electrical contact with the skull of the subject identified as at risk of or suffering from CAA.\n\nInventive Concept 25. The method according to Inventive Concept 19, wherein the substance includes amyloid beta, and wherein activating the control circuitry includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the amyloid beta from the brain parenchyma into the ventricular system of the brain.\n\nInventive Concept 26. The method according to Inventive Concept 19, wherein the substance includes tau protein, and wherein activating the control circuitry includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the tau protein from the brain parenchyma into the ventricular system of the brain.\n\nInventive Concept 27. The method according to Inventive Concept 19, wherein placing the extracranial electrode includes placing the extracranial electrode such that an area of build-up of the substance is between the extracranial electrode and an area of the ventricular system of the brain nearest the area of build-up.\n\nInventive Concept 28. The method according to Inventive Concept 27, wherein placing the extracranial electrode includes identifying the area of build-up of the substance in the brain parenchyma before placing the extracranial electrode.\n\nInventive Concept 29. The method according to Inventive Concept 28, wherein identifying the area of build-up includes performing imaging of the brain.\n\nInventive Concept 30. The method according to Inventive Concept 29, wherein performing the imaging includes performing functional MRI (fMRI) imaging of the brain.\n\nInventive Concept 31. The method according to Inventive Concept 27, wherein placing the extracranial electrode includes placing a plurality of extracranial electrodes, such that a first subset of the plurality of extracranial electrodes are located such that one or more respective areas of build-up of the substance in the brain parenchyma are between one or more of the extracranial electrodes and respective areas of the ventricular system.\n\nInventive Concept 32. The method according to Inventive Concept 31, wherein activating the control circuitry to clear the substance from the brain parenchyma includes activating the control circuitry to drive a first average charge between the one or more extracranial electrodes of the first subset and the CSF electrode over a 24-hour period of time, and a second average charge between (a) one or more extracranial electrodes of a second subset of the one or more extracranial electrodes and (b) the CSF electrode over the 24-hour period of time, the first average charge greater than the second average charge, and the first and the second subsets not including any extracranial electrodes common to both subsets.\n\nInventive Concept 33. The method according to Inventive Concept 19,\n\nwherein placing the extracranial electrode includes placing a plurality of extracranial electrodes, and\n\nwherein the method further includes, after placing the plurality of extracranial electrodes:identifying one or more areas of build-up of the substance in the parenchyma between the extracranial electrodes and respective areas of the ventricular system of the brain nearest the areas of build-up; andidentifying a first subset of the one or more extracranial electrodes as located such that one or more of the areas of build-up of the substance in brain parenchyma are between the one or more extracranial electrodes and the respective areas of the ventricular system.\n\nInventive Concept 34. The method according to Inventive Concept 33, wherein activating the control circuitry to clear the substance from the brain parenchyma includes activating the control circuitry to drive a first average charge between the one or more extracranial electrodes of the first subset and the CSF electrode over a 24-hour period of time, and a second average charge between (a) the one or more extracranial electrodes of a second subset of the one or more extracranial electrodes and (b) the CSF electrode over the 24-hour period of time, the first average charge greater than the second average charge, and the first and the second subsets not including any extracranial electrodes common to both subsets.\n\nInventive Concept 35. The method according to Inventive Concept 33, wherein identifying the one or more areas of build-up includes performing imaging of the brain.\n\nInventive Concept 36. The method according to Inventive Concept 19, wherein the extracranial electrode includes a plurality of extracranial electrodes, and wherein placing the extracranial electrode includes placing a two-dimensional arrangement of the extracranial electrodes around a portion of the skull.\n\nInventive Concept 37. The method according to Inventive Concept 19, wherein activating the control circuitry includes activating the control circuitry to configure the extracranial electrode to be an anode, and the CSF electrode to be a cathode.\n\nInventive Concept 38. The method according to Inventive Concept 19, wherein activating the control circuitry includes activating the control circuitry to configure the extracranial electrode to be a cathode, and the CSF electrode to be an anode.\n\nInventive Concept 39. The method according to Inventive Concept 19, wherein activating the control circuitry to drive the extracranial and the CSF electrodes includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the substance by applying a non-excitatory current between the extracranial and the CSF electrodes.\n\nInventive Concept 40. The method according to Inventive Concept 19, wherein activating the control circuitry to drive the extracranial and the CSF electrodes includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the substance by applying direct current between the extracranial and the CSF electrodes.\n\nInventive Concept 41. The method according to Inventive Concept 40, wherein activating the control circuitry to apply the direct current includes activating the control circuitry to apply the direct current with an average amplitude of between 1 and 5 mA.\n\nInventive Concept 42. The method according to Inventive Concept 40, wherein activating the control circuitry to apply the direct current includes activating the control circuitry to apply the direct current with an average amplitude of less than 1.2 V.\n\nInventive Concept 43. The method according to Inventive Concept 40, wherein activating the control circuitry to apply the direct current includes activating the control circuitry to apply the direct current as a series of pulses.\n\nInventive Concept 44. The method according to Inventive Concept 43, wherein activating the control circuitry to apply the direct current as the series of pulses includes activating the control circuitry to apply the direct current as the series of pulses having an average pulse duration of between 100 milliseconds and 300 seconds.\n\nInventive Concept 45. The method according to Inventive Concept 43, wherein activating the control circuitry to apply the direct current as the series of pulses includes activating the control circuitry to apply the direct current as the series of pulses with a duty cycle of between 1% and 50%.\n\nThere is still further provided, in accordance with an Inventive Concept 46 of the present invention, apparatus including:\n\na two-dimensional arrangement of extracranial electrodes, configured to be placed outside and in electrical contact with a skull of a subject identified as at risk of or suffering from a disease;\n\na cerebrospinal fluid (CSF) electrode, configured to be implanted in a ventricular system of a brain of the subject; and\n\ncontrol circuitry, configured to drive the extracranial and the CSF electrodes to clear a substance from brain parenchyma of the subject into at least one region of the brain selected from the group consisting of: a subarachnoid space of the brain and dural sinuses of the brain.\n\nInventive Concept 47. The apparatus according to Inventive Concept 46, wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the substance from the brain parenchyma into at least the subarachnoid space.\n\nInventive Concept 48. The apparatus according to Inventive Concept 46, wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the substance from the brain parenchyma into at least the dural sinuses.\n\nInventive Concept 49. The apparatus according to Inventive Concept 46, wherein the extracranial electrodes are configured to be implanted under skin of a head of the subject.\n\nInventive Concept 50. The apparatus according to Inventive Concept 46, wherein the extracranial electrodes are configured to be placed on skin of a head of the subject.\n\nInventive Concept 51. The apparatus according to Inventive Concept 46, wherein the control circuitry is configured to be implanted under skin of the subject.\n\nInventive Concept 52. The apparatus according to Inventive Concept 46, wherein the disease is Alzheimer's disease, and wherein the two-dimensional arrangement of extracranial electrodes is configured to placed outside and in electrical contact with the skull of the subject identified as at risk of or suffering from Alzheimer's disease.\n\nInventive Concept 53. The apparatus according to Inventive Concept 46, wherein the disease is cerebral amyloid angiopathy (CAA), and wherein the two-dimensional arrangement of extracranial electrodes is configured to placed outside and in electrical contact with the skull of the subject identified as at risk of or suffering from CAA.\n\nInventive Concept 54. The apparatus according to Inventive Concept 46, wherein the substance includes amyloid beta, and wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the amyloid beta from the brain parenchyma into the at least one region of the brain.\n\nInventive Concept 55. The apparatus according to Inventive Concept 46, wherein the substance includes tau protein, and wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the tau protein from the brain parenchyma into the at least one region of the brain.\n\nInventive Concept 56. The apparatus according to Inventive Concept 46, wherein the two-dimensional arrangement includes at least a 2×3 arrangement of the extracranial electrodes.\n\nInventive Concept 57. The apparatus according to Inventive Concept 56, wherein the two-dimensional arrangement includes at least a 4×4 arrangement of the extracranial electrodes.\n\nInventive Concept 58. The apparatus according to Inventive Concept 46, wherein the control circuitry is configured to drive a first average charge between (a) one or more extracranial electrodes of a first subset of the extracranial electrodes and (b) the CSF electrode over a 24-hour period of time, and a second average charge between (a) one or more extracranial electrodes of a second subset of the extracranial electrodes and (b) the CSF electrode over the 24-hour period of time, the first average charge greater than the second average charge.\n\nInventive Concept 59. The apparatus according to Inventive Concept 46, wherein the control circuitry is configured to configure the extracranial electrodes to be anodes, and the CSF electrode to be a cathode.\n\nInventive Concept 60. The apparatus according to Inventive Concept 46, wherein the control circuitry is configured to configure the extracranial electrodes to be cathodes, and the CSF electrode to be an anode.\n\nInventive Concept 61. The apparatus according to Inventive Concept 46, wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the substance by applying a non-excitatory current between the extracranial and the CSF electrodes.\n\nInventive Concept 62. The apparatus according to Inventive Concept 46, wherein the control circuitry is configured to drive the extracranial and the CSF electrodes to clear the substance by applying direct current between the extracranial and the CSF electrodes.\n\nInventive Concept 63. The apparatus according to Inventive Concept 62, wherein the control circuitry is configured to apply the direct current with an average amplitude of between 1 and 5 mA.\n\nInventive Concept 64. The apparatus according to Inventive Concept 62, wherein the control circuitry is configured to apply the direct current with an average amplitude of less than 1.2 V.\n\nInventive Concept 65. The apparatus according to Inventive Concept 62, wherein the control circuitry is configured to apply the direct current as a series of pulses.\n\nInventive Concept 66. The apparatus according to Inventive Concept 65, wherein the control circuitry is configured to apply the direct current as the series of pulses having an average pulse duration of between 100 milliseconds and 300 seconds.\n\nInventive Concept 67. The apparatus according to Inventive Concept 65, wherein the control circuitry is configured to apply the direct current as the series of pulses with a duty cycle of between 1% and 50%.\n\nThere is additionally provided, in accordance with an Inventive Concept 68 of the present invention, a method including:\n\nplacing a two-dimensional arrangement of extracranial electrodes outside and in electrical contact with a skull of a subject identified as at risk of or suffering from a disease;\n\nimplanting a cerebrospinal fluid (CSF) electrode in a ventricular system of a brain of the subject; and\n\nactivating control circuitry to drive the extracranial and the CSF electrodes to clear a substance from brain parenchyma into at least one region of the brain selected from the group consisting of: a subarachnoid space of the brain and dural sinuses of the brain.\n\nInventive Concept 69. The method according to Inventive Concept 68, wherein activating the control circuitry includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the substance from the brain parenchyma into at least the subarachnoid space.\n\nInventive Concept 70. The method according to Inventive Concept 68, wherein activating the control circuitry includes activating the control circuitry to clear the substance from the brain parenchyma into at least the dural sinuses.\n\nInventive Concept 71. The method according to Inventive Concept 68, wherein placing the two-dimensional arrangement of extracranial electrodes includes implanting the extracranial electrodes under skin of a head of the subject.\n\nInventive Concept 72. The method according to Inventive Concept 68, wherein placing the two-dimensional arrangement of extracranial electrodes includes placing the extracranial electrodes on skin of a head of the subject.\n\nInventive Concept 73. The method according to Inventive Concept 68, further including implanting the control circuitry under skin of the subject.\n\nInventive Concept 74. The method according to Inventive Concept 68, wherein the disease is Alzheimer's disease, and wherein placing the two-dimensional arrangement of extracranial electrodes includes placing the two-dimensional arrangement of extracranial electrodes outside and in electrical contact with the skull of the subject identified as at risk of or suffering from Alzheimer's disease.\n\nInventive Concept 75. The method according to Inventive Concept 68, wherein the disease is cerebral amyloid angiopathy (CAA), and wherein placing the two-dimensional arrangement of extracranial electrodes includes placing the two-dimensional arrangement of extracranial electrode outsides and in electrical contact with the skull of the subject identified as at risk of or suffering from CAA.\n\nInventive Concept 76. The method according to Inventive Concept 68, wherein the substance includes amyloid beta, and wherein activating the control circuitry includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the amyloid beta from the brain parenchyma into the at least one region of the brain.\n\nInventive Concept 77. The method according to Inventive Concept 68, wherein the substance includes tau protein, and wherein activating the control circuitry includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the tau protein from the brain parenchyma into the at least one region of the brain.\n\nInventive Concept 78. The method according to Inventive Concept 68, wherein placing the two-dimensional arrangement of extracranial electrodes includes placing the two-dimensional arrangement of extracranial electrodes such that an area of build-up of the substance is between the two-dimensional arrangement of extracranial electrodes and an area of the ventricular system of the brain nearest the area of build-up.\n\nInventive Concept 79. The method according to Inventive Concept 78, wherein placing the two-dimensional arrangement of extracranial electrodes includes identifying the area of build-up of the substance in the brain parenchyma before placing the two-dimensional arrangement of extracranial electrodes.\n\nInventive Concept 80. The method according to Inventive Concept 79, wherein identifying the area of build-up includes performing imaging of the brain.\n\nInventive Concept 81. The method according to Inventive Concept 80, wherein performing the imaging includes performing functional MRI (fMRI) imaging of the brain.\n\nInventive Concept 82. The method according to Inventive Concept 78, wherein placing the two-dimensional arrangement of extracranial electrodes includes placing the two-dimensional arrangement of extracranial electrodes such that a first subset of the one or more extracranial electrodes are located such that one or more respective areas of build-up of the substance in the brain parenchyma are between the one or more extracranial electrodes and respective areas of the ventricular system.\n\nInventive Concept 83. The method according to Inventive Concept 82, wherein activating the control circuitry to clear the substance from the brain parenchyma includes activating the control circuitry to drive a first average charge between the one or more extracranial electrodes of the first subset and the CSF electrode over a 24-hour period of time, and a second average charge between (a) one or more extracranial electrodes of a second subset of the one or more extracranial electrodes and (b) the CSF electrode over the 24-hour period of time, the first average charge greater than the second average charge, and the first and the second subsets not including any extracranial electrodes common to both subsets.\n\nInventive Concept 84. The method according to Inventive Concept 68, further including, after placing the two-dimensional arrangement of extracranial electrodes:identifying one or more areas of build-up of the substance in the parenchyma between the two-dimensional arrangement of extracranial electrodes and respective areas of the ventricular system of the brain nearest the areas of build-up; andidentifying a first subset of the one or more extracranial electrodes as located such that one or more of the areas of build-up of the substance in brain parenchyma are between the one or more extracranial electrodes and the respective areas of the ventricular system.\n\nInventive Concept 85. The method according to Inventive Concept 84, wherein activating the control circuitry to clear the substance from the brain parenchyma includes activating the control circuitry to drive a first average charge between the one or more extracranial electrodes of the first subset and the CSF electrode over a 24-hour period of time, and a second average charge between (a) one or more extracranial electrodes of a second subset of the one or more extracranial electrodes and (b) the CSF electrode over the 24-hour period of time, the first average charge greater than the second average charge, and the first and the second subsets not including any extracranial electrodes common to both subsets.\n\nInventive Concept 86. The method according to Inventive Concept 84, wherein identifying the one or more areas of build-up includes performing imaging of the brain.\n\nInventive Concept 87. The method according to Inventive Concept 68, wherein activating the control circuitry includes activating the control circuitry to configure the extracranial electrodes to be anodes, and the CSF electrode to be a cathode.\n\nInventive Concept 88. The method according to Inventive Concept 68, wherein activating the control circuitry includes activating the control circuitry to configure the extracranial electrodes to be cathodes, and the CSF electrode to be an anode.\n\nInventive Concept 89. The method according to Inventive Concept 68, wherein activating the control circuitry to drive the extracranial and the CSF electrodes includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the substance by applying a non-excitatory current between the extracranial and the CSF electrodes.\n\nInventive Concept 90. The method according to Inventive Concept 68, wherein activating the control circuitry to drive the extracranial and the CSF electrodes includes activating the control circuitry to drive the extracranial and the CSF electrodes to clear the substance by applying direct current between the extracranial and the CSF electrodes.\n\nInventive Concept 91. The method according to Inventive Concept 90, wherein activating the control circuitry to apply the direct current includes activating the control circuitry to apply the direct current with an average amplitude of between 1 and 5 mA.\n\nInventive Concept 92. The method according to Inventive Concept 90, wherein activating the control circuitry to apply the direct current includes activating the control circuitry to apply the direct current with an average amplitude of less than 1.2 V.\n\nInventive Concept 93. The method according to Inventive Concept 90, wherein activating the control circuitry to apply the direct current includes activating the control circuitry to apply the direct current as a series of pulses.\n\nInventive Concept 94. The method according to Inventive Concept 93, wherein activating the control circuitry to apply the direct current as the series of pulses includes activating the control circuitry to apply the direct current as the series of pulses having an average pulse duration of between 100 milliseconds and 300 seconds.\n\nInventive Concept 95. The method according to Inventive Concept 93, wherein activating the control circuitry to apply the direct current as the series of pulses includes activating the control circuitry to apply the direct current as the series of pulses with a duty cycle of between 1% and 50%.\n\nThe present invention will be more fully understood from the following detailed description of embodiments thereof, taken together with the drawings, in which:\n\n"
        },
        {
            "uuid": "002e0858-9949-11eb-9615-121df0c29c1e",
            "patent_id": "10882421",
            "text": "TECHNICAL FIELD\n\nThe instant invention relates to an assembly group of a vehicle seat. The instant invention in particular relates to an assembly group of a vehicle seat comprising a lower guide rail attachable to a vehicle floor and an upper guide rail coupled to the lower guide rail and movable with respect to the lower guide rail along a longitudinal axis, the upper guide rail and the lower guide rail being part of a length adjustment device for adjusting a length position of the vehicle seat with respect to a vehicle floor.\n\nBACKGROUND\n\nFor a vehicle seat, in particular a front seat in a vehicle, it is desirable to be able to adjust the height of a seat part in order to allow adapting the vehicle seat for providing a comfortable seating for a passenger. For this, typically one or multiple link arms are pivotably connected to an upper guide rail on either side of a vehicle seat, such that, by pivoting the one or the multiple link arms, a frame assembly connected to the upper guide rail by means of the one or the multiple link arms is adjusted in its height position with respect to the upper guide rail.\n\nHerein, the lowest position of the frame assembly with respect to the upper guide rail, the so-called “low block height”, is generally defined by the connection of the one or the multiple link arms to the upper guide rail. The connection of a link arm to the upper guide rail in particular defines a pivot axis about which the link arm is pivotable with respect to the upper guide rail, the position of the pivot axis with respect to the upper guide rail constraining the ability to lower the low block height of the vehicle seat.\n\nDifferent arrangements of a fastener element on an upper guide rail are known for example from DE 10 2010 042 008 A1, DE 10 2010 042 285 A1, and DE 10 2010 051 955 A1.\n\nSUMMARY OF THE INVENTION\n\nIt is an object to provide an assembly group of a vehicle seat which allows to lower the low block height, the low block height defining the lowest position to which a frame assembly of a vehicle seat can be approached towards the upper guide rail by pivoting a link arm with respect to the upper guide rail.\n\nIn one aspect, an assembly group of a vehicle seat is provided, the assembly group comprising: a lower guide rail attachable to a vehicle floor; an upper guide rail coupled to the lower guide rail and movable with respect to the lower guide rail along a longitudinal axis, the upper guide rail comprising a top wall and a pair of side walls connected by the top wall; a link arm pivotably connectable to the upper guide rail for coupling a frame assembly to the upper guide rail; and a first fastener for pivotably coupling the link arm to the upper guide rail, the first fastener being disposed between the pair of side walls and being at least partially positioned below a top surface of the top wall.\n\nAccording to one aspect, the first fastener serves to pivotably couple the link arm to the upper guide rail. The first fastener herein is disposed between the pair of side walls and extends from one side wall to another, the first fastener being at least partially positioned beneath a top surface of the top wall, the top surface being located at an upper side of the top wall opposite the side walls extending from the top wall towards the lower guide rail. Because the first fastener at least partially is positioned below the top surface of the top wall, the position of the pivot axis provided by the first fastener can be lowered with respect to the top wall of the upper guide rail, hence reducing constraints on lowering the lower block height.\n\nIn one embodiment, a second fastener is connectable to the first fastener for pivotably coupling the link arm to the upper guide rail. The first fastener herein may have the shape of a threaded sleeve comprising a threaded opening for receiving the second fastener, which in this case is shaped as a threaded stud comprising a threaded shaft. In another embodiment, the first fastener is shaped as a threaded stud comprising a threaded shaft, a second fastener in the shape of a threaded sleeve being screw-connectable to the first fastener.\n\nThe first fastener and the second fastener together serve to provide a bearing for the link arm to pivotably connect the link arm to the upper guide rail. For this, one of the first fastener and the second fastener may comprise a bearing section on which the link arm may be received such that the link arm is pivotable with respect to the first fastener and the second fastener. By pivoting the link arm with respect to the upper guide rail the height position of the frame assembly with respect to the upper guide rail can be adjusted such that the frame assembly can for example be approached towards the upper guide rail in order to lower a seat height of the vehicle seat.\n\nIn another aspect, the upper guide rail comprises an aperture for receiving the first fastener.\n\nIn one embodiment, the aperture may be formed in the top wall such that it reaches into both side walls, the aperture providing for a recess in the shape of a notch (cutout) in which the first fastener may be disposed such that the first fastener at least partially reaches into the recess and hence is at least partially positioned below the top surface of the top wall.\n\nIn another embodiment, each side wall of the pair of side walls comprises a bore, the bores of the side walls together forming an aperture for receiving the first fastener. The bores of the side walls in particular may be aligned with respect to each other along a transverse direction pointing transverse to the longitudinal axis such that the first fastener may be inserted into the bores to extend in between the side walls of the upper guide rail.\n\nIn one aspect, the first fastener, for example in the shape of a threaded sleeve or a threaded stud, extends along a direction transverse to the longitudinal axis from a first side wall of the pair of side walls to a second side wall of the pair of side walls. The first fastener hence extends transversely across the upper guide rail from one side wall to the other side wall, thus allowing for a strong connection of the fast first fastener to the upper guide rail.\n\nIn one embodiment, the first fastener is connected to the upper guide rail by means of a weld joint. The first fastener hence may be directly connected to the upper guide rail, for example to the top wall of the upper guide rail or to one or both of the side walls of the upper guide rail, by welding, for example by laser welding or by MIG or MAG welding. For example, if an aperture is formed in the top wall of the upper guide rail, the first fastener may be connected by welding to edges of the aperture formed in the top wall. If the aperture is formed by bores in the side walls, the first fastener may be connected to the side walls by weld joints extending about each bore.\n\nIn another embodiment, an attachment bracket may be provided serving to connect the first fastener to the upper guide rail. Herein, the attachment bracket may for example be connected to the top wall of the upper guide rail, wherein the first fastener is connected to the attachment bracket by means of a weld joint, for example by laser welding or by MIG or MAG welding. In this embodiment, the first fastener is for example not connected directly to the upper guide rail, but is connected to the attachment bracket and via the attachment bracket to the upper guide rail. A weld joint hence is formed in between the first fastener and the attachment bracket, but not in between the first fastener and the upper guide rail, allowing for example to pre-assemble and deliver a sub assembly comprising an attachment bracket and a first fastener connected to the attachment bracket.\n\nIn one embodiment, the attachment bracket is connected to the upper guide rail, in particular the top wall of the upper guide rail, by welding. The attachment bracket herein may be formed such that it bridges, when it is connected to the top wall of the upper guide rail, an aperture formed in the top wall for receiving the first fastener, the attachment bracket hence reaching over the aperture along the longitudinal axis and hence increasing the strength of the upper guide rail in the neighborhood of the aperture formed in the top wall.\n\nIn one embodiment, the attachment bracket comprises a middle section and at least one flange section, wherein the middle section confines a reception opening for receiving the first fastener. The middle section may have a generally rectangular (C) shape or a rounded shape and serves to receive the first fastener therein. The first fastener herein may be connected to the middle portion by means of welding, for example by laser welding or MIG or MAG welding.\n\nThe at least one flange section may for example be flatly placed on the top wall of the upper guide rail. The at least one flange section may for example be connected to the top wall by welding, for example laser welding or MIG or MAG welding. The at least one flange section forms a lap joint with the top wall, wherein one or multiple projections may be provided on the at least one flange section for engaging with an associated, complementary opening in the top wall for establishing a particularly strong welded connection in between the attachment bracket and the top wall of the upper guide rail.\n\nIn one embodiment, the attachment bracket comprises two flange sections, one flange section being placed at each side of the middle portion. Each flange section flatly abuts the top wall of the upper guide rail, wherein the attachment bracket is connected to the upper guide rail by welding each flange section to the top wall.\n\nIn another aspect, in a preassembly state in which the first fastener is separate from the attachment bracket, the first fastener may be receivable within the reception opening confined by the middle portion of the attachment bracket at different height positions when viewed along a vertical direction perpendicular to the top wall of the upper guide rail. Prior to fixedly connecting the first fastener to the attachment bracket the first fastener may be brought into a suitable position with respect to the attachment bracket, the first fastener in particular being placeable on the attachment bracket such that the first fastener may assume different height positions with respect to the middle portion of the attachment bracket. This allows to adjust the height position of the first fastener with respect to the attachment bracket and hence with respect to the top wall of the upper guide rail, such that a lower block height may be adapted as desired by suitably placing the first fastener on the attachment bracket and connecting the first fastener to the attachment bracket.\n\nAccording to one aspect, a sub-assembly comprises: a first fastener for pivotably coupling a link arm to an upper guide rail of a vehicle seat, the first fastener being configured to be disposed between a pair of side walls of the upper guide rail and to be at least partially positioned below a top surface of a top wall of the upper guide rail; and an attachment bracket configured to be connected to the top wall of the upper guide rail, wherein the first fastener is connected to the attachment bracket by means of a weld joint.\n\nA sub-assembly of this kind may be manufactured and delivered to a customer in a state in which it is not connected to the upper guide rail. The sub-assembly is configured to be placed on an upper guide rail such that the first fastener is for example received in an aperture formed in the top wall of the upper guide rail and hence is positioned at least partially below the top surface of the top wall of the upper guide rail.\n\nIn one embodiment, said attachment bracket of the sub-assembly comprises a middle section and at least one flange section, wherein the middle section confines a reception opening for receiving the first fastener. The middle section may have a generally rectangular (C) shape or rounded shape and serves to receive the first fastener therein. The first fastener herein may be connected to the middle portion by means of welding, for example by laser welding or MIG or MAG welding.\n\nThe at least one flange section may for example be flatly placed on the top wall of the upper guide rail. The at least one flange section may for example be connected to the top wall by welding, for example laser welding or MIG or MAG welding. The at least one flange section forms a lap joint with the top wall, wherein one or multiple projections may be provided on the at least one flange section for engaging with an associated, complementary opening in the top wall for establishing a particularly strong welded connection in between the attachment bracket and the top wall of the upper guide rail.\n\nIn one embodiment, the attachment bracket comprises two flange sections, one flange section being placed at each side of the middle portion. Each flange section flatly abuts the top wall of the upper guide rail, wherein the attachment bracket is connected to the upper guide rail by welding each flange section to the top wall.\n\nIn one embodiment, in a preassembly state of the sub-assembly in which the first fastener is separate from the attachment bracket, the first fastener may be receivable within the reception opening confined by the middle portion of the attachment bracket at different height positions when viewed along a vertical direction perpendicular to the top wall of the upper guide rail. Prior to fixedly connecting the first fastener to the attachment bracket the first fastener may be brought into a suitable position with respect to the attachment bracket, the first fastener in particular being placeable on the attachment bracket such that the first fastener may assume different height positions with respect to the middle portion of the attachment bracket.\n\n"
        },
        {
            "uuid": "00364bc0-9949-11eb-9615-121df0c29c1e",
            "patent_id": "10883230",
            "text": "FIELD OF THE INVENTION\n\nThe present invention relates generally to artificial turf, and more particularly to an edging system and method for installing an artificial turf edge that improves the appearance of artificial turf after installation and reduces the amount of labor necessary to install artificial turf.\n\nBACKGROUND OF THE INVENTION\n\nDue to the increasing costs of water in most states, more consumers are choosing to install artificial turf in their residences and businesses than ever before. Although the quality and appearance of artificial turf has improved over the past several decades, the appearance of artificial turf still suffers from some drawbacks. One of clearest tell-tale signs that allows consumers to readily distinguish artificial turf from real turf is the lack of a raised and cut edge on the artificial turf. This is especially apparent when the artificial turf is installed adjacent another flat surface such as concrete or decking, for example. The blades of the artificial turf extend upwardly from a synthetic backing which is typically flush or near flush with the level of the adjacent surface. This gives the artificial turf a fake “carpet-like” appearance as opposed to a natural look that simulates the appearance of a real-grass lawn.\n\nIn contrast, real grass lawns which are mowed and edged almost always have a raised edge that typically rises two to four inches above an adjacent flat surface (e.g., concrete, decking, etc.). The raised edge comprises blades of grass that have been cut to create the lawn edge. This natural appearance of real-grass lawns is not emulated in conventional artificial turf installations.\n\nAdditionally, the installation process for artificial turf is cumbersome. Before artificial turf is laid down over a predetermined surface area, workers must typically excavate the surface area to a desired depth (e.g., three to four inches) to allow space for a correspondingly thick layer of base material (typically, a fine rock or gravel material) to be poured under the artificial turf to support the turf as the foundation and drainage bed during heavy rains. An optional weed barrier is then placed over the base material, followed by the artificial turf, which is placed on the top of the weed barrier or directly on top of the base material. Depending on the size of the surface area, such excavation may incur significant labor costs. Additionally, the excavated dirt and/or soil typically needs to be removed from the premises, which incur additional fees for removal and dumping of the dirt and/or soil.\n\nIn view of the above deficiencies of conventional artificial turf systems, there is a need for an artificial turf edging system that provides a more realistic appearance to artificial turf after it is installed, and reduces costs associated with the installation of conventional artificial turf systems.\n\nSUMMARY OF THE INVENTION\n\nThe invention addresses the above needs by providing an artificial turf edging system and method that gives the appearance of a raised, cut edge of a real-grass lawn. The artificial turf edging system and method further allows for significant reductions in installation costs by eliminating or substantially reducing the amount of labor required to excavate dirt or soil from an installation area, as well as eliminating or reducing the costs associated with transport and dumping of the excavated dirt or soil.\n\nIn one embodiment, the invention provides an artificial turf edging method that includes: providing at least one layer of base material within the artificial turf area; securing at least one raised border piece to the at least one layer of base material, wherein the at least one raised border piece includes a main wall that extends upwardly and away from an external top surface adjacent to the artificial turf area at a first predetermined angle; placing an artificial turf material over the at least one layer of base material and over the main surface of the at least one raised border piece; and securing the artificial turf material to the at least one layer of base material and the at least one raised border piece, wherein the artificial turf material comprises a plurality of artificial turf blades that extend outwardly and away from the main wall, and wherein a level of the at least one layer of base material confined behind the at least one raised border piece is higher than the external top surface.\n\nIn a further embodiment, the invention provides an artificial turf edging method that includes: providing a first layer of base material along a perimeter of the artificial turf area; placing at least one raised border piece on top of the first layer of base material and thereafter securing the at least one raised border piece to the first layer of base material, wherein the at least one raised border piece includes a main wall that extends upwardly and at a predetermined angle away from an external surface adjacent to the artificial turf area; providing a second layer of base material over at least a portion of the first layer of base material, wherein the second layer of base material is confined by the at least one raised border; placing an artificial turf material over the second layer of base material and over the main wall; and securing the artificial turf material to the second layer of base material and the at least one raised border, wherein a level of the second layer of base material confined by the at least one raised border piece is higher than a level of the external surface.\n\nIn another embodiment, a raised artificial turf edge system includes a first raised border piece. The first raised border piece includes: a first main wall; a first bottom flange extending outwardly from a bottom portion of the first main wall at a first predetermined angle; and a first top flange extending outwardly from a top portion of the first main wall at a second predetermined angle, wherein the first and second predetermined angles are each in the range of 120 to 155 degrees.\n\n"
        }
    ]
}