{
    "table_name": "cpc_subgroup_201908",
    "table_fullname": "patents-public-data.patentsview.cpc_subgroup_201908",
    "column_names": [
        "id",
        "title"
    ],
    "column_types": [
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "id",
        "title"
    ],
    "nested_column_types": [
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null
    ],
    "sample_rows": [
        {
            "id": "B01F15/0234",
            "title": "Accessories for mixers ; ; Auxiliary operations or auxiliary devices; Parts or details of general application-Feed or discharge mechanisms-Feed mechanisms -characterized by the means for feeding the components to the mixer-using gravity, e.g. from a hopper"
        },
        {
            "id": "B01F15/0237",
            "title": "Accessories for mixers ; ; Auxiliary operations or auxiliary devices; Parts or details of general application-Feed or discharge mechanisms-Feed mechanisms -characterized by the means for feeding the components to the mixer-using pistons, plungers, syringes"
        },
        {
            "id": "E05B17/223",
            "title": "Accessories in connection with locks -Means for operating or controlling lock or fastening device accessories, i.e. other than the fastening members, e.g. switches, indicators -preventing lock actuation after detection of drug use, e.g. alcohol consumption"
        },
        {
            "id": "F01D15/065",
            "title": "Adaptations of machines or engines for special use; Combinations of engines with devices driven thereby -Adaptations for driving, or combinations with, hand-held tools or the like ; control thereof-with pressure-velocity transformation exclusively in rotor"
        },
        {
            "id": "B29C64/35",
            "title": "Additive manufacturing, i.e. manufacturing of three-dimensional [3D] objects by additive deposition, additive agglomeration or additive layering, e.g. by 3D printing, stereolithography or selective laser sintering-Auxiliary operations or equipment-Cleaning"
        }
    ]
}