{
    "table_name": "government_interest_201708",
    "table_fullname": "patents-public-data.patentsview.government_interest_201708",
    "column_names": [
        "patent_id",
        "gi_statement"
    ],
    "column_types": [
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "patent_id",
        "gi_statement"
    ],
    "nested_column_types": [
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null
    ],
    "sample_rows": [
        {
            "patent_id": "6467284",
            "gi_statement": "&lsqb;Federal Research Statement Paragraph&rsqb;This invention was made with Government support under contract no. DE-AC05-00OR22725 to UT-Battelle, LLC, awarded by the United States Department of Energy. The Government has certain rights in the invention."
        },
        {
            "patent_id": "7740871",
            "gi_statement": "A sequence listing is submitted herewith on compact disc (file name: &#x201c;P2142US_Seq.ST25.TXT&#x201d;, created Mar. 24, 2006, File size: 506 KB). The material contained on the compact disc is explicitly incorporated herein by reference in its entirety."
        },
        {
            "patent_id": "9714611",
            "gi_statement": "Development of this invention was supported in part by the United States Department of Energy, Advanced Turbine Development Program, Contract No. DE-FC26-05NT42644-Sub011. Accordingly, the United States Government may have certain rights in this invention."
        },
        {
            "patent_id": "7774297",
            "gi_statement": "Embodiments of the invention were developed in part with funds from the United States government. This invention was made with Government support under Contract FA8750-04-C-0253 awarded by the Air Force. The government has certain rights in this invention."
        },
        {
            "patent_id": "6281354",
            "gi_statement": "Funds used to support some of the studies reported herein were provided by the United States Government (National Institutes of Health Grant, Calif. 55276.) The United States Government, therefore, may have certain rights in the invention disclosed herein."
        }
    ]
}