{
    "table_name": "subclass_current",
    "table_fullname": "patents-public-data.patentsview.subclass_current",
    "column_names": [
        "id",
        "title"
    ],
    "column_types": [
        "STRING",
        "STRING"
    ],
    "nested_column_names": [
        "id",
        "title"
    ],
    "nested_column_types": [
        "STRING",
        "STRING"
    ],
    "description": [
        null,
        null
    ],
    "sample_rows": [
        {
            "id": "558/165",
            "title": "Divalent chalcogen, bonded directly to two carbons or to carbon and hydrogen, attached indirectly to phosphorus by acyclic nonionic bonding (wherein the hydrogen may be replaced by substituted or unsubstituted ammonium, or by a Group IA or IIA light metal)"
        },
        {
            "id": "G9B/31",
            "title": "Arrangements for the associated working of recording or reproducing apparatus with related apparatus (with cameras or projectors G03B31/00; [N: recording/reproducing of music for electrophonic musical instruments G10H1/00R; automatic arrangements for answering calls or for recording messages for absent subscribers H04M1/64; telephonic communication systems adapted for combination with dictation recording and playback systems H04M11/10; connection of TV recorder with other related apparatus, e.g. TV camera o"
        },
        {
            "id": "968/243",
            "title": "INDICATING THE TIME BY OTHER MEANS OR BY COMBINED MEANS (electric or electromechanical indicating subclass 425; illumination of dials and hand subclass 213; indicating by acoustic means subclass 217; arrangements producing acoustic signals at preselected times subclass 229; continuously indicating the time optically by electric means subclass 577; producing acoustic time signals by electrical means subclass 580; gas lamp adjustment by clockwork subclass 243; devices for cooking eggs A47J 29/00) [G04B 25/00]"
        },
        {
            "id": "G9B/20.39",
            "title": "[N: to or from biphase level coding, i.e. to or from codes where a one is coded as a transition from a high to a low level during the middle of a bit cell and a zero is encoded as a transition from a low to a high level during the middle of a bit cell or vice versa, e.g. split phase code, Manchester code conversion to or from biphase space or mark coding, i.e. to or from codes where there is a transition at the beginning of every bit cell and a one has no second transition and a zero has a second transition"
        },
        {
            "id": "210/DIG.*",
            "title": "1"
        }
    ]
}