{
    "table_name": "PUBLICATION_MANIFEST_METADATA_CURRENT",
    "table_fullname": "HTAN_2.HTAN.PUBLICATION_MANIFEST_METADATA_CURRENT",
    "column_names": [
        "HTAN_Center",
        "Location_of_Publication",
        "License",
        "Title",
        "Corresponding_Author",
        "Supporting_Link",
        "Data_Type",
        "Publication_Content_Type",
        "Tool",
        "Year_of_Publication",
        "HTAN_Center_ID",
        "Corresponding_Author_ORCID",
        "Supporting_Link_Description",
        "HTAN_Grant_ID",
        "Manifest_Id",
        "entityId",
        "Id",
        "Publication_Abstract",
        "Manifest_Version",
        "Publication_associated_HTAN_Parent_Data_File_ID",
        "Component",
        "Authors",
        "DOI",
        "Publication_contains_HTAN_ID",
        "PMID"
    ],
    "column_types": [
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "NUMBER",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT",
        "TEXT"
    ],
    "description": [
        "Name of HTAN Center e.g. HTAN HTAPP",
        "The name of the preprint server, journal, or conference where the content was presented/published.",
        "The type of license applicable to the content.",
        "The title of the content presented or published.",
        "The name(s) of the corresponding author(s) of the content presented/published. If more than one corresponding author, please list in the order they appear in the author list.",
        "Relevant external links associated with the content (e.g external datasets used for validation). Please note: Supporting Links and Supporting Link Descriptions are provided by authors and are not verified by the NIH NCI or the HTAN DCC. This information and any linked data should only be shared by an authorized individual(s) in accordance with the terms of the HTAN data sharing agreements and policies and/or any other applicable agreement(s). Validated as URL",
        "Types of data associated with the content. Fill out Other Data Type Specified, if not on the list.",
        "The type of content presented or published.",
        "Were any software or computational tools generated for this content",
        "The year the content was presented or published (format YYYY).",
        "List of HTAN Center ID(s) associated with the content presented/published.",
        "The ORCiD(s) of the corresponding author(s) of the content presented/published. Should be a valid ORCiD url starting with https://orcid.org/ followed by a 16 digit identifier in dash separated groups of 4 (for example https://orcid.org/0000-0002-1825-0097). If more than one corresponding author, please list ORCiDs in the order the authors appear in the author list.",
        "Description of relevant external links associated with the publication (e.g An external mouse dataset used for validation). Please note: Supporting Links and Supporting Link Descriptions are provided by authors and are not verified by the NIH NCI or the HTAN DCC. This information and any linked data should only be shared by an authorized individual(s) in accordance with the terms of the HTAN data sharing agreements and policies and-or any other applicable agreement(s).",
        "HTAN grant number(s) (i.e. CA------ format) associated with the content presented/published.",
        "Synapse ID of manifest containing file annotation",
        "Synapse ID of entity",
        "Unique identifier of entity e.g. a96059eb-81af-4b24-ae50-9242c0d8f819",
        "The abstract or short description of the content presented/published.",
        "Latest version of metadata manifest",
        "HTAN Data File Identifier(s) of the files associated with the content presented/published. Should be comma-separated lists.",
        "Category of metadata (e.g. Diagnosis, Biospecimen, scRNA-seq Level 1, etc.); provide the same one for all items/rows.",
        "The names of the author(s) of the content presented/published, in the order they appear.",
        "The digital object identifier (DOI) of the content in the form of https://www.doi.org/{doi} to comply with CrossRef DOI display guidelines.",
        "HTAN IDs are used in the publication.",
        "The PubMed identifier associated with the publication (applicable to published manuscripts). Provide as a URL of the form https://pubmed.ncbi.nlm.nih.gov/{pmid}"
    ],
    "sample_rows": []
}